const express = require('express');
const router = express.Router();
// 收货地址
router.post("/location-info", (req, res) => {
    console.log(11)
    // 省市区   不要打开  太大
    let params = {
        "code": 200,
        "data": [
            {
                "id": "30",
                "name": "上海市",
                "children": [
                    {
                        "id": "495",
                        "name": "上海市",
                        "pid": "30",
                        "children": [
                            {
                                "id": "3074",
                                "name": "宝山区",
                                "cid": "495"
                            },
                            {
                                "id": "3075",
                                "name": "卢湾区",
                                "cid": "495"
                            },
                            {
                                "id": "3076",
                                "name": "浦东新区",
                                "cid": "495"
                            },
                            {
                                "id": "3077",
                                "name": "闸北区",
                                "cid": "495"
                            },
                            {
                                "id": "3078",
                                "name": "嘉定区",
                                "cid": "495"
                            },
                            {
                                "id": "3079",
                                "name": "奉贤区",
                                "cid": "495"
                            },
                            {
                                "id": "3080",
                                "name": "普陀区",
                                "cid": "495"
                            },
                            {
                                "id": "3081",
                                "name": "金山区",
                                "cid": "495"
                            },
                            {
                                "id": "3082",
                                "name": "虹口区",
                                "cid": "495"
                            },
                            {
                                "id": "3083",
                                "name": "松江区",
                                "cid": "495"
                            },
                            {
                                "id": "3084",
                                "name": "长宁区",
                                "cid": "495"
                            },
                            {
                                "id": "3085",
                                "name": "杨浦区",
                                "cid": "495"
                            },
                            {
                                "id": "3086",
                                "name": "徐汇区",
                                "cid": "495"
                            },
                            {
                                "id": "3087",
                                "name": "闵行区",
                                "cid": "495"
                            },
                            {
                                "id": "3088",
                                "name": "青浦区",
                                "cid": "495"
                            },
                            {
                                "id": "3089",
                                "name": "黄浦区",
                                "cid": "495"
                            },
                            {
                                "id": "3090",
                                "name": "静安区",
                                "cid": "495"
                            },
                            {
                                "id": "3091",
                                "name": "崇明县",
                                "cid": "495"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "28",
                "name": "北京市",
                "children": [
                    {
                        "id": "496",
                        "name": "北京市",
                        "pid": "28",
                        "children": [
                            {
                                "id": "3092",
                                "name": "怀柔区",
                                "cid": "496"
                            },
                            {
                                "id": "3093",
                                "name": "密云县",
                                "cid": "496"
                            },
                            {
                                "id": "3094",
                                "name": "丰台区",
                                "cid": "496"
                            },
                            {
                                "id": "3095",
                                "name": "平谷区",
                                "cid": "496"
                            },
                            {
                                "id": "3096",
                                "name": "房山区",
                                "cid": "496"
                            },
                            {
                                "id": "3097",
                                "name": "大兴区",
                                "cid": "496"
                            },
                            {
                                "id": "3098",
                                "name": "昌平区",
                                "cid": "496"
                            },
                            {
                                "id": "3099",
                                "name": "延庆县",
                                "cid": "496"
                            },
                            {
                                "id": "3100",
                                "name": "门头沟区",
                                "cid": "496"
                            },
                            {
                                "id": "3101",
                                "name": "顺义区",
                                "cid": "496"
                            },
                            {
                                "id": "3102",
                                "name": "东城区",
                                "cid": "496"
                            },
                            {
                                "id": "3103",
                                "name": "石景山区",
                                "cid": "496"
                            },
                            {
                                "id": "3104",
                                "name": "海淀区",
                                "cid": "496"
                            },
                            {
                                "id": "3105",
                                "name": "西城区",
                                "cid": "496"
                            },
                            {
                                "id": "3106",
                                "name": "朝阳区",
                                "cid": "496"
                            },
                            {
                                "id": "3107",
                                "name": "通州区",
                                "cid": "496"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "31",
                "name": "天津市",
                "children": [
                    {
                        "id": "498",
                        "name": "天津市",
                        "pid": "31",
                        "children": [
                            {
                                "id": "3164",
                                "name": "北辰区",
                                "cid": "498"
                            },
                            {
                                "id": "3165",
                                "name": "南开区",
                                "cid": "498"
                            },
                            {
                                "id": "3166",
                                "name": "武清区",
                                "cid": "498"
                            },
                            {
                                "id": "3167",
                                "name": "河东区",
                                "cid": "498"
                            },
                            {
                                "id": "3168",
                                "name": "滨海新区",
                                "cid": "498"
                            },
                            {
                                "id": "3169",
                                "name": "东丽区",
                                "cid": "498"
                            },
                            {
                                "id": "3170",
                                "name": "静海县",
                                "cid": "498"
                            },
                            {
                                "id": "3171",
                                "name": "红桥区",
                                "cid": "498"
                            },
                            {
                                "id": "3172",
                                "name": "蓟县",
                                "cid": "498"
                            },
                            {
                                "id": "3173",
                                "name": "河北区",
                                "cid": "498"
                            },
                            {
                                "id": "3174",
                                "name": "宝坻区",
                                "cid": "498"
                            },
                            {
                                "id": "3175",
                                "name": "西青区",
                                "cid": "498"
                            },
                            {
                                "id": "3176",
                                "name": "和平区",
                                "cid": "498"
                            },
                            {
                                "id": "3177",
                                "name": "宁河县",
                                "cid": "498"
                            },
                            {
                                "id": "3178",
                                "name": "津南区",
                                "cid": "498"
                            },
                            {
                                "id": "3179",
                                "name": "河西区",
                                "cid": "498"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "29",
                "name": "重庆市",
                "children": [
                    {
                        "id": "497",
                        "name": "重庆市",
                        "pid": "29",
                        "children": [
                            {
                                "id": "3108",
                                "name": "奉节县",
                                "cid": "497"
                            },
                            {
                                "id": "3109",
                                "name": "大渡口区",
                                "cid": "497"
                            },
                            {
                                "id": "3110",
                                "name": "石柱土家族自治县",
                                "cid": "497"
                            },
                            {
                                "id": "3111",
                                "name": "巫山县",
                                "cid": "497"
                            },
                            {
                                "id": "3112",
                                "name": "双桥区",
                                "cid": "497"
                            },
                            {
                                "id": "3113",
                                "name": "江北区",
                                "cid": "497"
                            },
                            {
                                "id": "3114",
                                "name": "巴南区",
                                "cid": "497"
                            },
                            {
                                "id": "3115",
                                "name": "铜梁县",
                                "cid": "497"
                            },
                            {
                                "id": "3116",
                                "name": "武隆县",
                                "cid": "497"
                            },
                            {
                                "id": "3117",
                                "name": "巫溪县",
                                "cid": "497"
                            },
                            {
                                "id": "3118",
                                "name": "綦江县",
                                "cid": "497"
                            },
                            {
                                "id": "3119",
                                "name": "大足县",
                                "cid": "497"
                            },
                            {
                                "id": "3120",
                                "name": "渝北区",
                                "cid": "497"
                            },
                            {
                                "id": "3121",
                                "name": "南岸区",
                                "cid": "497"
                            },
                            {
                                "id": "3122",
                                "name": "南川区",
                                "cid": "497"
                            },
                            {
                                "id": "3123",
                                "name": "丰都县",
                                "cid": "497"
                            },
                            {
                                "id": "3124",
                                "name": "云阳县",
                                "cid": "497"
                            },
                            {
                                "id": "3125",
                                "name": "永川区",
                                "cid": "497"
                            },
                            {
                                "id": "3126",
                                "name": "渝中区",
                                "cid": "497"
                            },
                            {
                                "id": "3127",
                                "name": "垫江县",
                                "cid": "497"
                            },
                            {
                                "id": "3128",
                                "name": "忠县",
                                "cid": "497"
                            },
                            {
                                "id": "3129",
                                "name": "黔江区",
                                "cid": "497"
                            },
                            {
                                "id": "3130",
                                "name": "璧山县",
                                "cid": "497"
                            },
                            {
                                "id": "3131",
                                "name": "万州区",
                                "cid": "497"
                            },
                            {
                                "id": "3132",
                                "name": "城口县",
                                "cid": "497"
                            },
                            {
                                "id": "3133",
                                "name": "江津区",
                                "cid": "497"
                            },
                            {
                                "id": "3134",
                                "name": "长寿区",
                                "cid": "497"
                            },
                            {
                                "id": "3135",
                                "name": "荣昌县",
                                "cid": "497"
                            },
                            {
                                "id": "3136",
                                "name": "酉阳土家族苗族自治县",
                                "cid": "497"
                            },
                            {
                                "id": "3137",
                                "name": "梁平县",
                                "cid": "497"
                            },
                            {
                                "id": "3138",
                                "name": "沙坪坝区",
                                "cid": "497"
                            },
                            {
                                "id": "3139",
                                "name": "合川区",
                                "cid": "497"
                            },
                            {
                                "id": "3140",
                                "name": "九龙坡区",
                                "cid": "497"
                            },
                            {
                                "id": "3141",
                                "name": "万盛区",
                                "cid": "497"
                            },
                            {
                                "id": "3142",
                                "name": "北碚区",
                                "cid": "497"
                            },
                            {
                                "id": "3143",
                                "name": "涪陵区",
                                "cid": "497"
                            },
                            {
                                "id": "3144",
                                "name": "彭水苗族土家族自治县",
                                "cid": "497"
                            },
                            {
                                "id": "3145",
                                "name": "潼南县",
                                "cid": "497"
                            },
                            {
                                "id": "3146",
                                "name": "秀山土家族苗族自治县",
                                "cid": "497"
                            },
                            {
                                "id": "3147",
                                "name": "开县",
                                "cid": "497"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "15",
                "name": "宁夏回族自治区",
                "children": [
                    {
                        "id": "187",
                        "name": "中卫市",
                        "pid": "15",
                        "children": [
                            {
                                "id": "1351",
                                "name": "海原县",
                                "cid": "187"
                            },
                            {
                                "id": "1352",
                                "name": "沙坡头区",
                                "cid": "187"
                            },
                            {
                                "id": "1353",
                                "name": "中宁县",
                                "cid": "187"
                            }
                        ]
                    },
                    {
                        "id": "188",
                        "name": "固原市",
                        "pid": "15",
                        "children": [
                            {
                                "id": "1354",
                                "name": "隆德县",
                                "cid": "188"
                            },
                            {
                                "id": "1355",
                                "name": "原州区",
                                "cid": "188"
                            },
                            {
                                "id": "1356",
                                "name": "西吉县",
                                "cid": "188"
                            },
                            {
                                "id": "1357",
                                "name": "泾源县",
                                "cid": "188"
                            },
                            {
                                "id": "1358",
                                "name": "彭阳县",
                                "cid": "188"
                            }
                        ]
                    },
                    {
                        "id": "189",
                        "name": "吴忠市",
                        "pid": "15",
                        "children": [
                            {
                                "id": "1359",
                                "name": "利通区",
                                "cid": "189"
                            },
                            {
                                "id": "1360",
                                "name": "盐池县",
                                "cid": "189"
                            },
                            {
                                "id": "1361",
                                "name": "青铜峡市",
                                "cid": "189"
                            },
                            {
                                "id": "1362",
                                "name": "同心县",
                                "cid": "189"
                            }
                        ]
                    },
                    {
                        "id": "190",
                        "name": "石嘴山市",
                        "pid": "15",
                        "children": [
                            {
                                "id": "1363",
                                "name": "平罗县",
                                "cid": "190"
                            },
                            {
                                "id": "1364",
                                "name": "大武口区",
                                "cid": "190"
                            },
                            {
                                "id": "1365",
                                "name": "惠农区",
                                "cid": "190"
                            }
                        ]
                    },
                    {
                        "id": "191",
                        "name": "银川市",
                        "pid": "15",
                        "children": [
                            {
                                "id": "1366",
                                "name": "永宁县",
                                "cid": "191"
                            },
                            {
                                "id": "1367",
                                "name": "灵武市",
                                "cid": "191"
                            },
                            {
                                "id": "1368",
                                "name": "贺兰县",
                                "cid": "191"
                            },
                            {
                                "id": "1369",
                                "name": "金凤区",
                                "cid": "191"
                            },
                            {
                                "id": "1370",
                                "name": "兴庆区",
                                "cid": "191"
                            },
                            {
                                "id": "1371",
                                "name": "西夏区",
                                "cid": "191"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "9",
                "name": "西藏自治区",
                "children": [
                    {
                        "id": "113",
                        "name": "山南地区",
                        "pid": "9",
                        "children": [
                            {
                                "id": "780",
                                "name": "错那县",
                                "cid": "113"
                            },
                            {
                                "id": "781",
                                "name": "洛扎县",
                                "cid": "113"
                            },
                            {
                                "id": "782",
                                "name": "隆子县",
                                "cid": "113"
                            },
                            {
                                "id": "783",
                                "name": "曲松县",
                                "cid": "113"
                            },
                            {
                                "id": "784",
                                "name": "措美县",
                                "cid": "113"
                            },
                            {
                                "id": "785",
                                "name": "浪卡子县",
                                "cid": "113"
                            },
                            {
                                "id": "786",
                                "name": "加查县",
                                "cid": "113"
                            },
                            {
                                "id": "787",
                                "name": "乃东县",
                                "cid": "113"
                            },
                            {
                                "id": "788",
                                "name": "琼结县",
                                "cid": "113"
                            },
                            {
                                "id": "789",
                                "name": "贡嘎县",
                                "cid": "113"
                            },
                            {
                                "id": "790",
                                "name": "桑日县",
                                "cid": "113"
                            },
                            {
                                "id": "791",
                                "name": "扎囊县",
                                "cid": "113"
                            }
                        ]
                    },
                    {
                        "id": "114",
                        "name": "林芝地区",
                        "pid": "9",
                        "children": [
                            {
                                "id": "792",
                                "name": "墨脱县",
                                "cid": "114"
                            },
                            {
                                "id": "793",
                                "name": "朗县",
                                "cid": "114"
                            },
                            {
                                "id": "794",
                                "name": "米林县",
                                "cid": "114"
                            },
                            {
                                "id": "795",
                                "name": "林芝县",
                                "cid": "114"
                            },
                            {
                                "id": "796",
                                "name": "工布江达县",
                                "cid": "114"
                            },
                            {
                                "id": "797",
                                "name": "波密县",
                                "cid": "114"
                            },
                            {
                                "id": "798",
                                "name": "察隅县",
                                "cid": "114"
                            }
                        ]
                    },
                    {
                        "id": "115",
                        "name": "昌都地区",
                        "pid": "9",
                        "children": [
                            {
                                "id": "799",
                                "name": "八宿县",
                                "cid": "115"
                            },
                            {
                                "id": "800",
                                "name": "洛隆县",
                                "cid": "115"
                            },
                            {
                                "id": "801",
                                "name": "察雅县",
                                "cid": "115"
                            },
                            {
                                "id": "802",
                                "name": "边坝县",
                                "cid": "115"
                            },
                            {
                                "id": "803",
                                "name": "类乌齐县",
                                "cid": "115"
                            },
                            {
                                "id": "804",
                                "name": "丁青县",
                                "cid": "115"
                            },
                            {
                                "id": "805",
                                "name": "江达县",
                                "cid": "115"
                            },
                            {
                                "id": "806",
                                "name": "昌都县",
                                "cid": "115"
                            },
                            {
                                "id": "807",
                                "name": "芒康县",
                                "cid": "115"
                            },
                            {
                                "id": "808",
                                "name": "贡觉县",
                                "cid": "115"
                            },
                            {
                                "id": "809",
                                "name": "左贡县",
                                "cid": "115"
                            }
                        ]
                    },
                    {
                        "id": "116",
                        "name": "拉萨市",
                        "pid": "9",
                        "children": [
                            {
                                "id": "810",
                                "name": "曲水县",
                                "cid": "116"
                            },
                            {
                                "id": "811",
                                "name": "尼木县",
                                "cid": "116"
                            },
                            {
                                "id": "812",
                                "name": "达孜县",
                                "cid": "116"
                            },
                            {
                                "id": "813",
                                "name": "墨竹工卡县",
                                "cid": "116"
                            },
                            {
                                "id": "814",
                                "name": "堆龙德庆县",
                                "cid": "116"
                            },
                            {
                                "id": "815",
                                "name": "林周县",
                                "cid": "116"
                            },
                            {
                                "id": "816",
                                "name": "当雄县",
                                "cid": "116"
                            },
                            {
                                "id": "817",
                                "name": "城关区",
                                "cid": "116"
                            }
                        ]
                    },
                    {
                        "id": "117",
                        "name": "那曲地区",
                        "pid": "9",
                        "children": [
                            {
                                "id": "818",
                                "name": "嘉黎县",
                                "cid": "117"
                            },
                            {
                                "id": "819",
                                "name": "那曲县",
                                "cid": "117"
                            },
                            {
                                "id": "820",
                                "name": "班戈县",
                                "cid": "117"
                            },
                            {
                                "id": "821",
                                "name": "比如县",
                                "cid": "117"
                            },
                            {
                                "id": "822",
                                "name": "索县",
                                "cid": "117"
                            },
                            {
                                "id": "823",
                                "name": "申扎县",
                                "cid": "117"
                            },
                            {
                                "id": "824",
                                "name": "安多县",
                                "cid": "117"
                            },
                            {
                                "id": "825",
                                "name": "巴青县",
                                "cid": "117"
                            },
                            {
                                "id": "826",
                                "name": "聂荣县",
                                "cid": "117"
                            },
                            {
                                "id": "827",
                                "name": "尼玛县",
                                "cid": "117"
                            }
                        ]
                    },
                    {
                        "id": "118",
                        "name": "日喀则地区",
                        "pid": "9",
                        "children": [
                            {
                                "id": "828",
                                "name": "亚东县",
                                "cid": "118"
                            },
                            {
                                "id": "829",
                                "name": "定结县",
                                "cid": "118"
                            },
                            {
                                "id": "830",
                                "name": "聂拉木县",
                                "cid": "118"
                            },
                            {
                                "id": "831",
                                "name": "定日县",
                                "cid": "118"
                            },
                            {
                                "id": "832",
                                "name": "吉隆县",
                                "cid": "118"
                            },
                            {
                                "id": "833",
                                "name": "康马县",
                                "cid": "118"
                            },
                            {
                                "id": "834",
                                "name": "白朗县",
                                "cid": "118"
                            },
                            {
                                "id": "835",
                                "name": "江孜县",
                                "cid": "118"
                            },
                            {
                                "id": "836",
                                "name": "岗巴县",
                                "cid": "118"
                            },
                            {
                                "id": "837",
                                "name": "萨迦县",
                                "cid": "118"
                            },
                            {
                                "id": "838",
                                "name": "萨嘎县",
                                "cid": "118"
                            },
                            {
                                "id": "839",
                                "name": "昂仁县",
                                "cid": "118"
                            },
                            {
                                "id": "840",
                                "name": "拉孜县",
                                "cid": "118"
                            },
                            {
                                "id": "841",
                                "name": "仲巴县",
                                "cid": "118"
                            },
                            {
                                "id": "842",
                                "name": "日喀则市",
                                "cid": "118"
                            },
                            {
                                "id": "843",
                                "name": "南木林县",
                                "cid": "118"
                            },
                            {
                                "id": "844",
                                "name": "谢通门县",
                                "cid": "118"
                            },
                            {
                                "id": "845",
                                "name": "仁布县",
                                "cid": "118"
                            }
                        ]
                    },
                    {
                        "id": "119",
                        "name": "阿里地区",
                        "pid": "9",
                        "children": [
                            {
                                "id": "846",
                                "name": "措勤县",
                                "cid": "119"
                            },
                            {
                                "id": "847",
                                "name": "普兰县",
                                "cid": "119"
                            },
                            {
                                "id": "848",
                                "name": "札达县",
                                "cid": "119"
                            },
                            {
                                "id": "849",
                                "name": "革吉县",
                                "cid": "119"
                            },
                            {
                                "id": "850",
                                "name": "噶尔县",
                                "cid": "119"
                            },
                            {
                                "id": "851",
                                "name": "日土县",
                                "cid": "119"
                            },
                            {
                                "id": "852",
                                "name": "改则县",
                                "cid": "119"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "7",
                "name": "青海省",
                "children": [
                    {
                        "id": "87",
                        "name": "海西蒙古族藏族自治州",
                        "pid": "7",
                        "children": [
                            {
                                "id": "648",
                                "name": "天峻县",
                                "cid": "87"
                            },
                            {
                                "id": "649",
                                "name": "乌兰县",
                                "cid": "87"
                            },
                            {
                                "id": "650",
                                "name": "都兰县",
                                "cid": "87"
                            },
                            {
                                "id": "651",
                                "name": "德令哈市",
                                "cid": "87"
                            },
                            {
                                "id": "652",
                                "name": "海西蒙古族藏族自治州直辖",
                                "cid": "87"
                            },
                            {
                                "id": "653",
                                "name": "格尔木市",
                                "cid": "87"
                            }
                        ]
                    },
                    {
                        "id": "88",
                        "name": "西宁市",
                        "pid": "7",
                        "children": [
                            {
                                "id": "654",
                                "name": "大通回族土族自治县",
                                "cid": "88"
                            },
                            {
                                "id": "655",
                                "name": "湟中县",
                                "cid": "88"
                            },
                            {
                                "id": "656",
                                "name": "湟源县",
                                "cid": "88"
                            },
                            {
                                "id": "657",
                                "name": "城北区",
                                "cid": "88"
                            },
                            {
                                "id": "658",
                                "name": "城中区",
                                "cid": "88"
                            },
                            {
                                "id": "659",
                                "name": "城西区",
                                "cid": "88"
                            },
                            {
                                "id": "660",
                                "name": "城东区",
                                "cid": "88"
                            }
                        ]
                    },
                    {
                        "id": "89",
                        "name": "海北藏族自治州",
                        "pid": "7",
                        "children": [
                            {
                                "id": "661",
                                "name": "海晏县",
                                "cid": "89"
                            },
                            {
                                "id": "662",
                                "name": "刚察县",
                                "cid": "89"
                            },
                            {
                                "id": "663",
                                "name": "门源回族自治县",
                                "cid": "89"
                            },
                            {
                                "id": "664",
                                "name": "祁连县",
                                "cid": "89"
                            }
                        ]
                    },
                    {
                        "id": "90",
                        "name": "海南藏族自治州",
                        "pid": "7",
                        "children": [
                            {
                                "id": "665",
                                "name": "共和县",
                                "cid": "90"
                            },
                            {
                                "id": "666",
                                "name": "贵德县",
                                "cid": "90"
                            },
                            {
                                "id": "667",
                                "name": "贵南县",
                                "cid": "90"
                            },
                            {
                                "id": "668",
                                "name": "同德县",
                                "cid": "90"
                            },
                            {
                                "id": "669",
                                "name": "兴海县",
                                "cid": "90"
                            }
                        ]
                    },
                    {
                        "id": "91",
                        "name": "海东地区",
                        "pid": "7",
                        "children": [
                            {
                                "id": "670",
                                "name": "化隆回族自治县",
                                "cid": "91"
                            },
                            {
                                "id": "671",
                                "name": "平安县",
                                "cid": "91"
                            },
                            {
                                "id": "672",
                                "name": "民和回族土族自治县",
                                "cid": "91"
                            },
                            {
                                "id": "673",
                                "name": "循化撒拉族自治县",
                                "cid": "91"
                            },
                            {
                                "id": "674",
                                "name": "乐都县",
                                "cid": "91"
                            },
                            {
                                "id": "675",
                                "name": "互助土族自治县",
                                "cid": "91"
                            }
                        ]
                    },
                    {
                        "id": "92",
                        "name": "黄南藏族自治州",
                        "pid": "7",
                        "children": [
                            {
                                "id": "676",
                                "name": "尖扎县",
                                "cid": "92"
                            },
                            {
                                "id": "677",
                                "name": "河南蒙古族自治县",
                                "cid": "92"
                            },
                            {
                                "id": "678",
                                "name": "泽库县",
                                "cid": "92"
                            },
                            {
                                "id": "679",
                                "name": "同仁县",
                                "cid": "92"
                            }
                        ]
                    },
                    {
                        "id": "93",
                        "name": "玉树藏族自治州",
                        "pid": "7",
                        "children": []
                    },
                    {
                        "id": "94",
                        "name": "果洛藏族自治州",
                        "pid": "7",
                        "children": [
                            {
                                "id": "680",
                                "name": "玛沁县",
                                "cid": "94"
                            },
                            {
                                "id": "681",
                                "name": "玛多县",
                                "cid": "94"
                            },
                            {
                                "id": "682",
                                "name": "甘德县",
                                "cid": "94"
                            },
                            {
                                "id": "683",
                                "name": "久治县",
                                "cid": "94"
                            },
                            {
                                "id": "684",
                                "name": "达日县",
                                "cid": "94"
                            },
                            {
                                "id": "685",
                                "name": "班玛县",
                                "cid": "94"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "11",
                "name": "福建省",
                "children": [
                    {
                        "id": "137",
                        "name": "南平市",
                        "pid": "11",
                        "children": [
                            {
                                "id": "951",
                                "name": "建阳市",
                                "cid": "137"
                            },
                            {
                                "id": "952",
                                "name": "延平区",
                                "cid": "137"
                            },
                            {
                                "id": "953",
                                "name": "武夷山市",
                                "cid": "137"
                            },
                            {
                                "id": "954",
                                "name": "顺昌县",
                                "cid": "137"
                            },
                            {
                                "id": "955",
                                "name": "松溪县",
                                "cid": "137"
                            },
                            {
                                "id": "956",
                                "name": "光泽县",
                                "cid": "137"
                            },
                            {
                                "id": "957",
                                "name": "邵武市",
                                "cid": "137"
                            },
                            {
                                "id": "958",
                                "name": "建瓯市",
                                "cid": "137"
                            },
                            {
                                "id": "959",
                                "name": "浦城县",
                                "cid": "137"
                            },
                            {
                                "id": "960",
                                "name": "政和县",
                                "cid": "137"
                            }
                        ]
                    },
                    {
                        "id": "138",
                        "name": "泉州市",
                        "pid": "11",
                        "children": [
                            {
                                "id": "961",
                                "name": "永春县",
                                "cid": "138"
                            },
                            {
                                "id": "962",
                                "name": "晋江市",
                                "cid": "138"
                            },
                            {
                                "id": "963",
                                "name": "安溪县",
                                "cid": "138"
                            },
                            {
                                "id": "964",
                                "name": "石狮市",
                                "cid": "138"
                            },
                            {
                                "id": "965",
                                "name": "惠安县",
                                "cid": "138"
                            },
                            {
                                "id": "966",
                                "name": "南安市",
                                "cid": "138"
                            },
                            {
                                "id": "967",
                                "name": "德化县",
                                "cid": "138"
                            },
                            {
                                "id": "968",
                                "name": "金门县",
                                "cid": "138"
                            },
                            {
                                "id": "969",
                                "name": "泉港区",
                                "cid": "138"
                            },
                            {
                                "id": "970",
                                "name": "洛江区",
                                "cid": "138"
                            },
                            {
                                "id": "971",
                                "name": "鲤城区",
                                "cid": "138"
                            },
                            {
                                "id": "972",
                                "name": "丰泽区",
                                "cid": "138"
                            }
                        ]
                    },
                    {
                        "id": "139",
                        "name": "宁德市",
                        "pid": "11",
                        "children": [
                            {
                                "id": "973",
                                "name": "蕉城区",
                                "cid": "139"
                            },
                            {
                                "id": "974",
                                "name": "周宁县",
                                "cid": "139"
                            },
                            {
                                "id": "975",
                                "name": "古田县",
                                "cid": "139"
                            },
                            {
                                "id": "976",
                                "name": "霞浦县",
                                "cid": "139"
                            },
                            {
                                "id": "977",
                                "name": "屏南县",
                                "cid": "139"
                            },
                            {
                                "id": "978",
                                "name": "福鼎市",
                                "cid": "139"
                            },
                            {
                                "id": "979",
                                "name": "福安市",
                                "cid": "139"
                            },
                            {
                                "id": "980",
                                "name": "寿宁县",
                                "cid": "139"
                            },
                            {
                                "id": "981",
                                "name": "柘荣县",
                                "cid": "139"
                            }
                        ]
                    },
                    {
                        "id": "140",
                        "name": "龙岩市",
                        "pid": "11",
                        "children": [
                            {
                                "id": "982",
                                "name": "长汀县",
                                "cid": "140"
                            },
                            {
                                "id": "983",
                                "name": "新罗区",
                                "cid": "140"
                            },
                            {
                                "id": "984",
                                "name": "连城县",
                                "cid": "140"
                            },
                            {
                                "id": "985",
                                "name": "漳平市",
                                "cid": "140"
                            },
                            {
                                "id": "986",
                                "name": "武平县",
                                "cid": "140"
                            },
                            {
                                "id": "987",
                                "name": "上杭县",
                                "cid": "140"
                            },
                            {
                                "id": "988",
                                "name": "永定县",
                                "cid": "140"
                            }
                        ]
                    },
                    {
                        "id": "141",
                        "name": "厦门市",
                        "pid": "11",
                        "children": [
                            {
                                "id": "989",
                                "name": "集美区",
                                "cid": "141"
                            },
                            {
                                "id": "990",
                                "name": "思明区",
                                "cid": "141"
                            },
                            {
                                "id": "991",
                                "name": "翔安区",
                                "cid": "141"
                            },
                            {
                                "id": "992",
                                "name": "海沧区",
                                "cid": "141"
                            },
                            {
                                "id": "993",
                                "name": "同安区",
                                "cid": "141"
                            },
                            {
                                "id": "994",
                                "name": "湖里区",
                                "cid": "141"
                            }
                        ]
                    },
                    {
                        "id": "142",
                        "name": "莆田市",
                        "pid": "11",
                        "children": [
                            {
                                "id": "995",
                                "name": "仙游县",
                                "cid": "142"
                            },
                            {
                                "id": "996",
                                "name": "荔城区",
                                "cid": "142"
                            },
                            {
                                "id": "997",
                                "name": "城厢区",
                                "cid": "142"
                            },
                            {
                                "id": "998",
                                "name": "秀屿区",
                                "cid": "142"
                            },
                            {
                                "id": "999",
                                "name": "涵江区",
                                "cid": "142"
                            }
                        ]
                    },
                    {
                        "id": "143",
                        "name": "三明市",
                        "pid": "11",
                        "children": [
                            {
                                "id": "1000",
                                "name": "将乐县",
                                "cid": "143"
                            },
                            {
                                "id": "1001",
                                "name": "建宁县",
                                "cid": "143"
                            },
                            {
                                "id": "1002",
                                "name": "永安市",
                                "cid": "143"
                            },
                            {
                                "id": "1003",
                                "name": "清流县",
                                "cid": "143"
                            },
                            {
                                "id": "1004",
                                "name": "泰宁县",
                                "cid": "143"
                            },
                            {
                                "id": "1005",
                                "name": "大田县",
                                "cid": "143"
                            },
                            {
                                "id": "1006",
                                "name": "明溪县",
                                "cid": "143"
                            },
                            {
                                "id": "1007",
                                "name": "尤溪县",
                                "cid": "143"
                            },
                            {
                                "id": "1008",
                                "name": "宁化县",
                                "cid": "143"
                            },
                            {
                                "id": "1009",
                                "name": "沙县",
                                "cid": "143"
                            },
                            {
                                "id": "1010",
                                "name": "三元区",
                                "cid": "143"
                            },
                            {
                                "id": "1011",
                                "name": "梅列区",
                                "cid": "143"
                            }
                        ]
                    },
                    {
                        "id": "144",
                        "name": "漳州市",
                        "pid": "11",
                        "children": [
                            {
                                "id": "1012",
                                "name": "南靖县",
                                "cid": "144"
                            },
                            {
                                "id": "1013",
                                "name": "漳浦县",
                                "cid": "144"
                            },
                            {
                                "id": "1014",
                                "name": "东山县",
                                "cid": "144"
                            },
                            {
                                "id": "1015",
                                "name": "云霄县",
                                "cid": "144"
                            },
                            {
                                "id": "1016",
                                "name": "华安县",
                                "cid": "144"
                            },
                            {
                                "id": "1017",
                                "name": "平和县",
                                "cid": "144"
                            },
                            {
                                "id": "1018",
                                "name": "长泰县",
                                "cid": "144"
                            },
                            {
                                "id": "1019",
                                "name": "诏安县",
                                "cid": "144"
                            },
                            {
                                "id": "1020",
                                "name": "龙海市",
                                "cid": "144"
                            },
                            {
                                "id": "1021",
                                "name": "芗城区",
                                "cid": "144"
                            },
                            {
                                "id": "1022",
                                "name": "龙文区",
                                "cid": "144"
                            }
                        ]
                    },
                    {
                        "id": "145",
                        "name": "福州市",
                        "pid": "11",
                        "children": [
                            {
                                "id": "1023",
                                "name": "连江县",
                                "cid": "145"
                            },
                            {
                                "id": "1024",
                                "name": "长乐市",
                                "cid": "145"
                            },
                            {
                                "id": "1025",
                                "name": "永泰县",
                                "cid": "145"
                            },
                            {
                                "id": "1026",
                                "name": "鼓楼区",
                                "cid": "145"
                            },
                            {
                                "id": "1027",
                                "name": "闽侯县",
                                "cid": "145"
                            },
                            {
                                "id": "1028",
                                "name": "平潭县",
                                "cid": "145"
                            },
                            {
                                "id": "1029",
                                "name": "罗源县",
                                "cid": "145"
                            },
                            {
                                "id": "1030",
                                "name": "仓山区",
                                "cid": "145"
                            },
                            {
                                "id": "1031",
                                "name": "福清市",
                                "cid": "145"
                            },
                            {
                                "id": "1032",
                                "name": "闽清县",
                                "cid": "145"
                            },
                            {
                                "id": "1033",
                                "name": "马尾区",
                                "cid": "145"
                            },
                            {
                                "id": "1034",
                                "name": "台江区",
                                "cid": "145"
                            },
                            {
                                "id": "1035",
                                "name": "晋安区",
                                "cid": "145"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "19",
                "name": "贵州省",
                "children": [
                    {
                        "id": "242",
                        "name": "贵阳市",
                        "pid": "19",
                        "children": [
                            {
                                "id": "1583",
                                "name": "息烽县",
                                "cid": "242"
                            },
                            {
                                "id": "1584",
                                "name": "开阳县",
                                "cid": "242"
                            },
                            {
                                "id": "1585",
                                "name": "清镇市",
                                "cid": "242"
                            },
                            {
                                "id": "1586",
                                "name": "修文县",
                                "cid": "242"
                            },
                            {
                                "id": "1587",
                                "name": "白云区",
                                "cid": "242"
                            },
                            {
                                "id": "1588",
                                "name": "云岩区",
                                "cid": "242"
                            },
                            {
                                "id": "1589",
                                "name": "花溪区",
                                "cid": "242"
                            },
                            {
                                "id": "1590",
                                "name": "小河区",
                                "cid": "242"
                            },
                            {
                                "id": "1591",
                                "name": "南明区",
                                "cid": "242"
                            },
                            {
                                "id": "1592",
                                "name": "乌当区",
                                "cid": "242"
                            }
                        ]
                    },
                    {
                        "id": "243",
                        "name": "六盘水市",
                        "pid": "19",
                        "children": [
                            {
                                "id": "1593",
                                "name": "盘县",
                                "cid": "243"
                            },
                            {
                                "id": "1594",
                                "name": "水城县",
                                "cid": "243"
                            },
                            {
                                "id": "1595",
                                "name": "六枝特区",
                                "cid": "243"
                            },
                            {
                                "id": "1596",
                                "name": "钟山区",
                                "cid": "243"
                            }
                        ]
                    },
                    {
                        "id": "244",
                        "name": "铜仁地区",
                        "pid": "19",
                        "children": [
                            {
                                "id": "1597",
                                "name": "德江县",
                                "cid": "244"
                            },
                            {
                                "id": "1598",
                                "name": "江口县",
                                "cid": "244"
                            },
                            {
                                "id": "1599",
                                "name": "万山特区",
                                "cid": "244"
                            },
                            {
                                "id": "1600",
                                "name": "思南县",
                                "cid": "244"
                            },
                            {
                                "id": "1601",
                                "name": "玉屏侗族自治县",
                                "cid": "244"
                            },
                            {
                                "id": "1602",
                                "name": "石阡县",
                                "cid": "244"
                            },
                            {
                                "id": "1603",
                                "name": "松桃苗族自治县",
                                "cid": "244"
                            },
                            {
                                "id": "1604",
                                "name": "沿河土家族自治县",
                                "cid": "244"
                            },
                            {
                                "id": "1605",
                                "name": "铜仁市",
                                "cid": "244"
                            },
                            {
                                "id": "1606",
                                "name": "印江土家族苗族自治县",
                                "cid": "244"
                            }
                        ]
                    },
                    {
                        "id": "245",
                        "name": "毕节地区",
                        "pid": "19",
                        "children": [
                            {
                                "id": "1607",
                                "name": "赫章县",
                                "cid": "245"
                            },
                            {
                                "id": "1608",
                                "name": "威宁彝族回族苗族自治县",
                                "cid": "245"
                            },
                            {
                                "id": "1609",
                                "name": "黔西县",
                                "cid": "245"
                            },
                            {
                                "id": "1610",
                                "name": "纳雍县",
                                "cid": "245"
                            },
                            {
                                "id": "1611",
                                "name": "金沙县",
                                "cid": "245"
                            },
                            {
                                "id": "1612",
                                "name": "织金县",
                                "cid": "245"
                            },
                            {
                                "id": "1613",
                                "name": "大方县",
                                "cid": "245"
                            },
                            {
                                "id": "1614",
                                "name": "毕节市",
                                "cid": "245"
                            }
                        ]
                    },
                    {
                        "id": "246",
                        "name": "遵义市",
                        "pid": "19",
                        "children": [
                            {
                                "id": "1615",
                                "name": "绥阳县",
                                "cid": "246"
                            },
                            {
                                "id": "1616",
                                "name": "湄潭县",
                                "cid": "246"
                            },
                            {
                                "id": "1617",
                                "name": "遵义县",
                                "cid": "246"
                            },
                            {
                                "id": "1618",
                                "name": "正安县",
                                "cid": "246"
                            },
                            {
                                "id": "1619",
                                "name": "凤冈县",
                                "cid": "246"
                            },
                            {
                                "id": "1620",
                                "name": "道真仡佬族苗族自治县",
                                "cid": "246"
                            },
                            {
                                "id": "1621",
                                "name": "桐梓县",
                                "cid": "246"
                            },
                            {
                                "id": "1622",
                                "name": "习水县",
                                "cid": "246"
                            },
                            {
                                "id": "1623",
                                "name": "务川仡佬族苗族自治县",
                                "cid": "246"
                            },
                            {
                                "id": "1624",
                                "name": "余庆县",
                                "cid": "246"
                            },
                            {
                                "id": "1625",
                                "name": "赤水市",
                                "cid": "246"
                            },
                            {
                                "id": "1626",
                                "name": "仁怀市",
                                "cid": "246"
                            },
                            {
                                "id": "1627",
                                "name": "汇川区",
                                "cid": "246"
                            },
                            {
                                "id": "1628",
                                "name": "红花岗区",
                                "cid": "246"
                            }
                        ]
                    },
                    {
                        "id": "247",
                        "name": "安顺市",
                        "pid": "19",
                        "children": [
                            {
                                "id": "1629",
                                "name": "紫云苗族布依族自治县",
                                "cid": "247"
                            },
                            {
                                "id": "1630",
                                "name": "关岭布依族苗族自治县",
                                "cid": "247"
                            },
                            {
                                "id": "1631",
                                "name": "平坝县",
                                "cid": "247"
                            },
                            {
                                "id": "1632",
                                "name": "镇宁布依族苗族自治县",
                                "cid": "247"
                            },
                            {
                                "id": "1633",
                                "name": "西秀区",
                                "cid": "247"
                            },
                            {
                                "id": "1634",
                                "name": "普定县",
                                "cid": "247"
                            }
                        ]
                    },
                    {
                        "id": "248",
                        "name": "黔南布依族苗族自治州",
                        "pid": "19",
                        "children": [
                            {
                                "id": "1635",
                                "name": "瓮安县",
                                "cid": "248"
                            },
                            {
                                "id": "1636",
                                "name": "龙里县",
                                "cid": "248"
                            },
                            {
                                "id": "1637",
                                "name": "贵定县",
                                "cid": "248"
                            },
                            {
                                "id": "1638",
                                "name": "三都水族自治县",
                                "cid": "248"
                            },
                            {
                                "id": "1639",
                                "name": "长顺县",
                                "cid": "248"
                            },
                            {
                                "id": "1640",
                                "name": "惠水县",
                                "cid": "248"
                            },
                            {
                                "id": "1641",
                                "name": "都匀市",
                                "cid": "248"
                            },
                            {
                                "id": "1642",
                                "name": "罗甸县",
                                "cid": "248"
                            },
                            {
                                "id": "1643",
                                "name": "荔波县",
                                "cid": "248"
                            },
                            {
                                "id": "1644",
                                "name": "福泉市",
                                "cid": "248"
                            },
                            {
                                "id": "1645",
                                "name": "独山县",
                                "cid": "248"
                            },
                            {
                                "id": "1646",
                                "name": "平塘县",
                                "cid": "248"
                            }
                        ]
                    },
                    {
                        "id": "249",
                        "name": "黔东南苗族侗族自治州",
                        "pid": "19",
                        "children": [
                            {
                                "id": "1647",
                                "name": "施秉县",
                                "cid": "249"
                            },
                            {
                                "id": "1648",
                                "name": "榕江县",
                                "cid": "249"
                            },
                            {
                                "id": "1649",
                                "name": "麻江县",
                                "cid": "249"
                            },
                            {
                                "id": "1650",
                                "name": "三穗县",
                                "cid": "249"
                            },
                            {
                                "id": "1651",
                                "name": "台江县",
                                "cid": "249"
                            },
                            {
                                "id": "1652",
                                "name": "锦屏县",
                                "cid": "249"
                            },
                            {
                                "id": "1653",
                                "name": "凯里市",
                                "cid": "249"
                            },
                            {
                                "id": "1654",
                                "name": "剑河县",
                                "cid": "249"
                            },
                            {
                                "id": "1655",
                                "name": "黄平县",
                                "cid": "249"
                            },
                            {
                                "id": "1656",
                                "name": "雷山县",
                                "cid": "249"
                            },
                            {
                                "id": "1657",
                                "name": "黎平县",
                                "cid": "249"
                            },
                            {
                                "id": "1658",
                                "name": "天柱县",
                                "cid": "249"
                            },
                            {
                                "id": "1659",
                                "name": "丹寨县",
                                "cid": "249"
                            },
                            {
                                "id": "1660",
                                "name": "从江县",
                                "cid": "249"
                            },
                            {
                                "id": "1661",
                                "name": "镇远县",
                                "cid": "249"
                            },
                            {
                                "id": "1662",
                                "name": "岑巩县",
                                "cid": "249"
                            }
                        ]
                    },
                    {
                        "id": "250",
                        "name": "黔西南布依族苗族自治州",
                        "pid": "19",
                        "children": [
                            {
                                "id": "1663",
                                "name": "普安县",
                                "cid": "250"
                            },
                            {
                                "id": "1664",
                                "name": "晴隆县",
                                "cid": "250"
                            },
                            {
                                "id": "1665",
                                "name": "兴仁县",
                                "cid": "250"
                            },
                            {
                                "id": "1666",
                                "name": "兴义市",
                                "cid": "250"
                            },
                            {
                                "id": "1667",
                                "name": "安龙县",
                                "cid": "250"
                            },
                            {
                                "id": "1668",
                                "name": "贞丰县",
                                "cid": "250"
                            },
                            {
                                "id": "1669",
                                "name": "册亨县",
                                "cid": "250"
                            },
                            {
                                "id": "1670",
                                "name": "望谟县",
                                "cid": "250"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "5",
                "name": "吉林省",
                "children": [
                    {
                        "id": "67",
                        "name": "白城市",
                        "pid": "5",
                        "children": [
                            {
                                "id": "470",
                                "name": "镇赉县",
                                "cid": "67"
                            },
                            {
                                "id": "471",
                                "name": "大安市",
                                "cid": "67"
                            },
                            {
                                "id": "472",
                                "name": "洮南市",
                                "cid": "67"
                            },
                            {
                                "id": "473",
                                "name": "洮北区",
                                "cid": "67"
                            },
                            {
                                "id": "474",
                                "name": "通榆县",
                                "cid": "67"
                            }
                        ]
                    },
                    {
                        "id": "68",
                        "name": "松原市",
                        "pid": "5",
                        "children": [
                            {
                                "id": "475",
                                "name": "宁江区",
                                "cid": "68"
                            },
                            {
                                "id": "476",
                                "name": "扶余县",
                                "cid": "68"
                            },
                            {
                                "id": "477",
                                "name": "前郭尔罗斯蒙古族自治县",
                                "cid": "68"
                            },
                            {
                                "id": "478",
                                "name": "乾安县",
                                "cid": "68"
                            },
                            {
                                "id": "479",
                                "name": "长岭县",
                                "cid": "68"
                            }
                        ]
                    },
                    {
                        "id": "69",
                        "name": "长春市",
                        "pid": "5",
                        "children": [
                            {
                                "id": "480",
                                "name": "榆树市",
                                "cid": "69"
                            },
                            {
                                "id": "481",
                                "name": "德惠市",
                                "cid": "69"
                            },
                            {
                                "id": "482",
                                "name": "农安县",
                                "cid": "69"
                            },
                            {
                                "id": "483",
                                "name": "九台市",
                                "cid": "69"
                            },
                            {
                                "id": "484",
                                "name": "宽城区",
                                "cid": "69"
                            },
                            {
                                "id": "485",
                                "name": "绿园区",
                                "cid": "69"
                            },
                            {
                                "id": "486",
                                "name": "双阳区",
                                "cid": "69"
                            },
                            {
                                "id": "487",
                                "name": "朝阳区",
                                "cid": "69"
                            },
                            {
                                "id": "488",
                                "name": "二道区",
                                "cid": "69"
                            },
                            {
                                "id": "489",
                                "name": "南关区",
                                "cid": "69"
                            }
                        ]
                    },
                    {
                        "id": "70",
                        "name": "延边朝鲜族自治州",
                        "pid": "5",
                        "children": [
                            {
                                "id": "490",
                                "name": "敦化市",
                                "cid": "70"
                            },
                            {
                                "id": "491",
                                "name": "汪清县",
                                "cid": "70"
                            },
                            {
                                "id": "492",
                                "name": "图们市",
                                "cid": "70"
                            },
                            {
                                "id": "493",
                                "name": "延吉市",
                                "cid": "70"
                            },
                            {
                                "id": "494",
                                "name": "龙井市",
                                "cid": "70"
                            },
                            {
                                "id": "495",
                                "name": "和龙市",
                                "cid": "70"
                            },
                            {
                                "id": "496",
                                "name": "安图县",
                                "cid": "70"
                            },
                            {
                                "id": "497",
                                "name": "珲春市",
                                "cid": "70"
                            }
                        ]
                    },
                    {
                        "id": "71",
                        "name": "吉林市",
                        "pid": "5",
                        "children": [
                            {
                                "id": "498",
                                "name": "舒兰市",
                                "cid": "71"
                            },
                            {
                                "id": "499",
                                "name": "蛟河市",
                                "cid": "71"
                            },
                            {
                                "id": "500",
                                "name": "桦甸市",
                                "cid": "71"
                            },
                            {
                                "id": "501",
                                "name": "永吉县",
                                "cid": "71"
                            },
                            {
                                "id": "502",
                                "name": "磐石市",
                                "cid": "71"
                            },
                            {
                                "id": "503",
                                "name": "昌邑区",
                                "cid": "71"
                            },
                            {
                                "id": "504",
                                "name": "龙潭区",
                                "cid": "71"
                            },
                            {
                                "id": "505",
                                "name": "丰满区",
                                "cid": "71"
                            },
                            {
                                "id": "506",
                                "name": "船营区",
                                "cid": "71"
                            }
                        ]
                    },
                    {
                        "id": "72",
                        "name": "四平市",
                        "pid": "5",
                        "children": [
                            {
                                "id": "507",
                                "name": "公主岭市",
                                "cid": "72"
                            },
                            {
                                "id": "508",
                                "name": "双辽市",
                                "cid": "72"
                            },
                            {
                                "id": "509",
                                "name": "伊通满族自治县",
                                "cid": "72"
                            },
                            {
                                "id": "510",
                                "name": "梨树县",
                                "cid": "72"
                            },
                            {
                                "id": "511",
                                "name": "铁西区",
                                "cid": "72"
                            },
                            {
                                "id": "512",
                                "name": "铁东区",
                                "cid": "72"
                            }
                        ]
                    },
                    {
                        "id": "73",
                        "name": "白山市",
                        "pid": "5",
                        "children": [
                            {
                                "id": "513",
                                "name": "靖宇县",
                                "cid": "73"
                            },
                            {
                                "id": "514",
                                "name": "抚松县",
                                "cid": "73"
                            },
                            {
                                "id": "515",
                                "name": "临江市",
                                "cid": "73"
                            },
                            {
                                "id": "516",
                                "name": "长白朝鲜族自治县",
                                "cid": "73"
                            },
                            {
                                "id": "517",
                                "name": "江源区",
                                "cid": "73"
                            },
                            {
                                "id": "518",
                                "name": "浑江区",
                                "cid": "73"
                            }
                        ]
                    },
                    {
                        "id": "74",
                        "name": "通化市",
                        "pid": "5",
                        "children": [
                            {
                                "id": "519",
                                "name": "辉南县",
                                "cid": "74"
                            },
                            {
                                "id": "520",
                                "name": "梅河口市",
                                "cid": "74"
                            },
                            {
                                "id": "521",
                                "name": "柳河县",
                                "cid": "74"
                            },
                            {
                                "id": "522",
                                "name": "集安市",
                                "cid": "74"
                            },
                            {
                                "id": "523",
                                "name": "通化县",
                                "cid": "74"
                            },
                            {
                                "id": "524",
                                "name": "东昌区",
                                "cid": "74"
                            },
                            {
                                "id": "525",
                                "name": "二道江区",
                                "cid": "74"
                            }
                        ]
                    },
                    {
                        "id": "75",
                        "name": "辽源市",
                        "pid": "5",
                        "children": [
                            {
                                "id": "526",
                                "name": "东丰县",
                                "cid": "75"
                            },
                            {
                                "id": "527",
                                "name": "东辽县",
                                "cid": "75"
                            },
                            {
                                "id": "528",
                                "name": "西安区",
                                "cid": "75"
                            },
                            {
                                "id": "529",
                                "name": "龙山区",
                                "cid": "75"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "22",
                "name": "陕西省",
                "children": [
                    {
                        "id": "276",
                        "name": "渭南市",
                        "pid": "22",
                        "children": [
                            {
                                "id": "1965",
                                "name": "富平县",
                                "cid": "276"
                            },
                            {
                                "id": "1966",
                                "name": "华县",
                                "cid": "276"
                            },
                            {
                                "id": "1967",
                                "name": "合阳县",
                                "cid": "276"
                            },
                            {
                                "id": "1968",
                                "name": "澄城县",
                                "cid": "276"
                            },
                            {
                                "id": "1969",
                                "name": "临渭区",
                                "cid": "276"
                            },
                            {
                                "id": "1970",
                                "name": "华阴市",
                                "cid": "276"
                            },
                            {
                                "id": "1971",
                                "name": "韩城市",
                                "cid": "276"
                            },
                            {
                                "id": "1972",
                                "name": "蒲城县",
                                "cid": "276"
                            },
                            {
                                "id": "1973",
                                "name": "潼关县",
                                "cid": "276"
                            },
                            {
                                "id": "1974",
                                "name": "白水县",
                                "cid": "276"
                            },
                            {
                                "id": "1975",
                                "name": "大荔县",
                                "cid": "276"
                            }
                        ]
                    },
                    {
                        "id": "277",
                        "name": "宝鸡市",
                        "pid": "22",
                        "children": [
                            {
                                "id": "1976",
                                "name": "麟游县",
                                "cid": "277"
                            },
                            {
                                "id": "1977",
                                "name": "陇县",
                                "cid": "277"
                            },
                            {
                                "id": "1978",
                                "name": "凤县",
                                "cid": "277"
                            },
                            {
                                "id": "1979",
                                "name": "千阳县",
                                "cid": "277"
                            },
                            {
                                "id": "1980",
                                "name": "岐山县",
                                "cid": "277"
                            },
                            {
                                "id": "1981",
                                "name": "扶风县",
                                "cid": "277"
                            },
                            {
                                "id": "1982",
                                "name": "太白县",
                                "cid": "277"
                            },
                            {
                                "id": "1983",
                                "name": "凤翔县",
                                "cid": "277"
                            },
                            {
                                "id": "1984",
                                "name": "眉县",
                                "cid": "277"
                            },
                            {
                                "id": "1985",
                                "name": "陈仓区",
                                "cid": "277"
                            },
                            {
                                "id": "1986",
                                "name": "渭滨区",
                                "cid": "277"
                            },
                            {
                                "id": "1987",
                                "name": "金台区",
                                "cid": "277"
                            }
                        ]
                    },
                    {
                        "id": "278",
                        "name": "榆林市",
                        "pid": "22",
                        "children": [
                            {
                                "id": "1988",
                                "name": "佳县",
                                "cid": "278"
                            },
                            {
                                "id": "1989",
                                "name": "清涧县",
                                "cid": "278"
                            },
                            {
                                "id": "1990",
                                "name": "靖边县",
                                "cid": "278"
                            },
                            {
                                "id": "1991",
                                "name": "吴堡县",
                                "cid": "278"
                            },
                            {
                                "id": "1992",
                                "name": "横山县",
                                "cid": "278"
                            },
                            {
                                "id": "1993",
                                "name": "绥德县",
                                "cid": "278"
                            },
                            {
                                "id": "1994",
                                "name": "定边县",
                                "cid": "278"
                            },
                            {
                                "id": "1995",
                                "name": "榆阳区",
                                "cid": "278"
                            },
                            {
                                "id": "1996",
                                "name": "子洲县",
                                "cid": "278"
                            },
                            {
                                "id": "1997",
                                "name": "神木县",
                                "cid": "278"
                            },
                            {
                                "id": "1998",
                                "name": "米脂县",
                                "cid": "278"
                            },
                            {
                                "id": "1999",
                                "name": "府谷县",
                                "cid": "278"
                            }
                        ]
                    },
                    {
                        "id": "279",
                        "name": "铜川市",
                        "pid": "22",
                        "children": [
                            {
                                "id": "2000",
                                "name": "宜君县",
                                "cid": "279"
                            },
                            {
                                "id": "2001",
                                "name": "印台区",
                                "cid": "279"
                            },
                            {
                                "id": "2002",
                                "name": "王益区",
                                "cid": "279"
                            },
                            {
                                "id": "2003",
                                "name": "耀州区",
                                "cid": "279"
                            }
                        ]
                    },
                    {
                        "id": "280",
                        "name": "西安市",
                        "pid": "22",
                        "children": [
                            {
                                "id": "2004",
                                "name": "周至县",
                                "cid": "280"
                            },
                            {
                                "id": "2005",
                                "name": "户县",
                                "cid": "280"
                            },
                            {
                                "id": "2006",
                                "name": "蓝田县",
                                "cid": "280"
                            },
                            {
                                "id": "2007",
                                "name": "高陵县",
                                "cid": "280"
                            },
                            {
                                "id": "2008",
                                "name": "临潼区",
                                "cid": "280"
                            },
                            {
                                "id": "2009",
                                "name": "灞桥区",
                                "cid": "280"
                            },
                            {
                                "id": "2010",
                                "name": "长安区",
                                "cid": "280"
                            },
                            {
                                "id": "2011",
                                "name": "未央区",
                                "cid": "280"
                            },
                            {
                                "id": "2012",
                                "name": "阎良区",
                                "cid": "280"
                            },
                            {
                                "id": "2013",
                                "name": "莲湖区",
                                "cid": "280"
                            },
                            {
                                "id": "2014",
                                "name": "雁塔区",
                                "cid": "280"
                            },
                            {
                                "id": "2015",
                                "name": "碑林区",
                                "cid": "280"
                            },
                            {
                                "id": "2016",
                                "name": "新城区",
                                "cid": "280"
                            }
                        ]
                    },
                    {
                        "id": "281",
                        "name": "延安市",
                        "pid": "22",
                        "children": [
                            {
                                "id": "2017",
                                "name": "甘泉县",
                                "cid": "281"
                            },
                            {
                                "id": "2018",
                                "name": "洛川县",
                                "cid": "281"
                            },
                            {
                                "id": "2019",
                                "name": "延长县",
                                "cid": "281"
                            },
                            {
                                "id": "2020",
                                "name": "安塞县",
                                "cid": "281"
                            },
                            {
                                "id": "2021",
                                "name": "吴起县",
                                "cid": "281"
                            },
                            {
                                "id": "2022",
                                "name": "富县",
                                "cid": "281"
                            },
                            {
                                "id": "2023",
                                "name": "延川县",
                                "cid": "281"
                            },
                            {
                                "id": "2024",
                                "name": "子长县",
                                "cid": "281"
                            },
                            {
                                "id": "2025",
                                "name": "黄陵县",
                                "cid": "281"
                            },
                            {
                                "id": "2026",
                                "name": "黄龙县",
                                "cid": "281"
                            },
                            {
                                "id": "2027",
                                "name": "宝塔区",
                                "cid": "281"
                            },
                            {
                                "id": "2028",
                                "name": "志丹县",
                                "cid": "281"
                            },
                            {
                                "id": "2029",
                                "name": "宜川县",
                                "cid": "281"
                            }
                        ]
                    },
                    {
                        "id": "282",
                        "name": "商洛市",
                        "pid": "22",
                        "children": [
                            {
                                "id": "2030",
                                "name": "商州区",
                                "cid": "282"
                            },
                            {
                                "id": "2031",
                                "name": "柞水县",
                                "cid": "282"
                            },
                            {
                                "id": "2032",
                                "name": "丹凤县",
                                "cid": "282"
                            },
                            {
                                "id": "2033",
                                "name": "洛南县",
                                "cid": "282"
                            },
                            {
                                "id": "2034",
                                "name": "镇安县",
                                "cid": "282"
                            },
                            {
                                "id": "2035",
                                "name": "商南县",
                                "cid": "282"
                            },
                            {
                                "id": "2036",
                                "name": "山阳县",
                                "cid": "282"
                            }
                        ]
                    },
                    {
                        "id": "283",
                        "name": "咸阳市",
                        "pid": "22",
                        "children": [
                            {
                                "id": "2037",
                                "name": "旬邑县",
                                "cid": "283"
                            },
                            {
                                "id": "2038",
                                "name": "长武县",
                                "cid": "283"
                            },
                            {
                                "id": "2039",
                                "name": "彬县",
                                "cid": "283"
                            },
                            {
                                "id": "2040",
                                "name": "泾阳县",
                                "cid": "283"
                            },
                            {
                                "id": "2041",
                                "name": "武功县",
                                "cid": "283"
                            },
                            {
                                "id": "2042",
                                "name": "淳化县",
                                "cid": "283"
                            },
                            {
                                "id": "2043",
                                "name": "兴平市",
                                "cid": "283"
                            },
                            {
                                "id": "2044",
                                "name": "乾县",
                                "cid": "283"
                            },
                            {
                                "id": "2045",
                                "name": "三原县",
                                "cid": "283"
                            },
                            {
                                "id": "2046",
                                "name": "礼泉县",
                                "cid": "283"
                            },
                            {
                                "id": "2047",
                                "name": "杨陵区",
                                "cid": "283"
                            },
                            {
                                "id": "2048",
                                "name": "永寿县",
                                "cid": "283"
                            },
                            {
                                "id": "2049",
                                "name": "秦都区",
                                "cid": "283"
                            },
                            {
                                "id": "2050",
                                "name": "渭城区",
                                "cid": "283"
                            }
                        ]
                    },
                    {
                        "id": "284",
                        "name": "安康市",
                        "pid": "22",
                        "children": [
                            {
                                "id": "2051",
                                "name": "石泉县",
                                "cid": "284"
                            },
                            {
                                "id": "2052",
                                "name": "汉滨区",
                                "cid": "284"
                            },
                            {
                                "id": "2053",
                                "name": "镇坪县",
                                "cid": "284"
                            },
                            {
                                "id": "2054",
                                "name": "汉阴县",
                                "cid": "284"
                            },
                            {
                                "id": "2055",
                                "name": "白河县",
                                "cid": "284"
                            },
                            {
                                "id": "2056",
                                "name": "宁陕县",
                                "cid": "284"
                            },
                            {
                                "id": "2057",
                                "name": "平利县",
                                "cid": "284"
                            },
                            {
                                "id": "2058",
                                "name": "紫阳县",
                                "cid": "284"
                            },
                            {
                                "id": "2059",
                                "name": "岚皋县",
                                "cid": "284"
                            },
                            {
                                "id": "2060",
                                "name": "旬阳县",
                                "cid": "284"
                            }
                        ]
                    },
                    {
                        "id": "285",
                        "name": "汉中市",
                        "pid": "22",
                        "children": [
                            {
                                "id": "2061",
                                "name": "汉台区",
                                "cid": "285"
                            },
                            {
                                "id": "2062",
                                "name": "佛坪县",
                                "cid": "285"
                            },
                            {
                                "id": "2063",
                                "name": "城固县",
                                "cid": "285"
                            },
                            {
                                "id": "2064",
                                "name": "勉县",
                                "cid": "285"
                            },
                            {
                                "id": "2065",
                                "name": "留坝县",
                                "cid": "285"
                            },
                            {
                                "id": "2066",
                                "name": "略阳县",
                                "cid": "285"
                            },
                            {
                                "id": "2067",
                                "name": "西乡县",
                                "cid": "285"
                            },
                            {
                                "id": "2068",
                                "name": "洋县",
                                "cid": "285"
                            },
                            {
                                "id": "2069",
                                "name": "镇巴县",
                                "cid": "285"
                            },
                            {
                                "id": "2070",
                                "name": "南郑县",
                                "cid": "285"
                            },
                            {
                                "id": "2071",
                                "name": "宁强县",
                                "cid": "285"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "24",
                "name": "浙江省",
                "children": [
                    {
                        "id": "302",
                        "name": "温州市",
                        "pid": "24",
                        "children": [
                            {
                                "id": "2201",
                                "name": "泰顺县",
                                "cid": "302"
                            },
                            {
                                "id": "2202",
                                "name": "洞头县",
                                "cid": "302"
                            },
                            {
                                "id": "2203",
                                "name": "瑞安市",
                                "cid": "302"
                            },
                            {
                                "id": "2204",
                                "name": "文成县",
                                "cid": "302"
                            },
                            {
                                "id": "2205",
                                "name": "瓯海区",
                                "cid": "302"
                            },
                            {
                                "id": "2206",
                                "name": "苍南县",
                                "cid": "302"
                            },
                            {
                                "id": "2207",
                                "name": "乐清市",
                                "cid": "302"
                            },
                            {
                                "id": "2208",
                                "name": "平阳县",
                                "cid": "302"
                            },
                            {
                                "id": "2209",
                                "name": "鹿城区",
                                "cid": "302"
                            },
                            {
                                "id": "2210",
                                "name": "永嘉县",
                                "cid": "302"
                            },
                            {
                                "id": "2211",
                                "name": "龙湾区",
                                "cid": "302"
                            }
                        ]
                    },
                    {
                        "id": "303",
                        "name": "杭州市",
                        "pid": "24",
                        "children": [
                            {
                                "id": "2212",
                                "name": "桐庐县",
                                "cid": "303"
                            },
                            {
                                "id": "2213",
                                "name": "西湖区",
                                "cid": "303"
                            },
                            {
                                "id": "2214",
                                "name": "江干区",
                                "cid": "303"
                            },
                            {
                                "id": "2215",
                                "name": "临安市",
                                "cid": "303"
                            },
                            {
                                "id": "2216",
                                "name": "拱墅区",
                                "cid": "303"
                            },
                            {
                                "id": "2217",
                                "name": "滨江区",
                                "cid": "303"
                            },
                            {
                                "id": "2218",
                                "name": "富阳市",
                                "cid": "303"
                            },
                            {
                                "id": "2219",
                                "name": "下城区",
                                "cid": "303"
                            },
                            {
                                "id": "2220",
                                "name": "淳安县",
                                "cid": "303"
                            },
                            {
                                "id": "2221",
                                "name": "萧山区",
                                "cid": "303"
                            },
                            {
                                "id": "2222",
                                "name": "余杭区",
                                "cid": "303"
                            },
                            {
                                "id": "2223",
                                "name": "建德市",
                                "cid": "303"
                            },
                            {
                                "id": "2224",
                                "name": "上城区",
                                "cid": "303"
                            }
                        ]
                    },
                    {
                        "id": "304",
                        "name": "宁波市",
                        "pid": "24",
                        "children": [
                            {
                                "id": "2225",
                                "name": "宁海县",
                                "cid": "304"
                            },
                            {
                                "id": "2226",
                                "name": "镇海区",
                                "cid": "304"
                            },
                            {
                                "id": "2227",
                                "name": "象山县",
                                "cid": "304"
                            },
                            {
                                "id": "2228",
                                "name": "慈溪市",
                                "cid": "304"
                            },
                            {
                                "id": "2229",
                                "name": "江东区",
                                "cid": "304"
                            },
                            {
                                "id": "2230",
                                "name": "余姚市",
                                "cid": "304"
                            },
                            {
                                "id": "2231",
                                "name": "北仑区",
                                "cid": "304"
                            },
                            {
                                "id": "2232",
                                "name": "海曙区",
                                "cid": "304"
                            },
                            {
                                "id": "2233",
                                "name": "鄞州区",
                                "cid": "304"
                            },
                            {
                                "id": "2234",
                                "name": "江北区",
                                "cid": "304"
                            },
                            {
                                "id": "2235",
                                "name": "奉化市",
                                "cid": "304"
                            }
                        ]
                    },
                    {
                        "id": "305",
                        "name": "衢州市",
                        "pid": "24",
                        "children": [
                            {
                                "id": "2236",
                                "name": "开化县",
                                "cid": "305"
                            },
                            {
                                "id": "2237",
                                "name": "柯城区",
                                "cid": "305"
                            },
                            {
                                "id": "2238",
                                "name": "江山市",
                                "cid": "305"
                            },
                            {
                                "id": "2239",
                                "name": "龙游县",
                                "cid": "305"
                            },
                            {
                                "id": "2240",
                                "name": "衢江区",
                                "cid": "305"
                            },
                            {
                                "id": "2241",
                                "name": "常山县",
                                "cid": "305"
                            }
                        ]
                    },
                    {
                        "id": "306",
                        "name": "台州市",
                        "pid": "24",
                        "children": [
                            {
                                "id": "2242",
                                "name": "临海市",
                                "cid": "306"
                            },
                            {
                                "id": "2243",
                                "name": "温岭市",
                                "cid": "306"
                            },
                            {
                                "id": "2244",
                                "name": "仙居县",
                                "cid": "306"
                            },
                            {
                                "id": "2245",
                                "name": "椒江区",
                                "cid": "306"
                            },
                            {
                                "id": "2246",
                                "name": "玉环县",
                                "cid": "306"
                            },
                            {
                                "id": "2247",
                                "name": "黄岩区",
                                "cid": "306"
                            },
                            {
                                "id": "2248",
                                "name": "天台县",
                                "cid": "306"
                            },
                            {
                                "id": "2249",
                                "name": "路桥区",
                                "cid": "306"
                            },
                            {
                                "id": "2250",
                                "name": "三门县",
                                "cid": "306"
                            }
                        ]
                    },
                    {
                        "id": "307",
                        "name": "舟山市",
                        "pid": "24",
                        "children": [
                            {
                                "id": "2251",
                                "name": "普陀区",
                                "cid": "307"
                            },
                            {
                                "id": "2252",
                                "name": "岱山县",
                                "cid": "307"
                            },
                            {
                                "id": "2253",
                                "name": "定海区",
                                "cid": "307"
                            },
                            {
                                "id": "2254",
                                "name": "嵊泗县",
                                "cid": "307"
                            }
                        ]
                    },
                    {
                        "id": "308",
                        "name": "丽水市",
                        "pid": "24",
                        "children": [
                            {
                                "id": "2255",
                                "name": "庆元县",
                                "cid": "308"
                            },
                            {
                                "id": "2256",
                                "name": "青田县",
                                "cid": "308"
                            },
                            {
                                "id": "2257",
                                "name": "遂昌县",
                                "cid": "308"
                            },
                            {
                                "id": "2258",
                                "name": "景宁畲族自治县",
                                "cid": "308"
                            },
                            {
                                "id": "2259",
                                "name": "松阳县",
                                "cid": "308"
                            },
                            {
                                "id": "2260",
                                "name": "龙泉市",
                                "cid": "308"
                            },
                            {
                                "id": "2261",
                                "name": "莲都区",
                                "cid": "308"
                            },
                            {
                                "id": "2262",
                                "name": "云和县",
                                "cid": "308"
                            },
                            {
                                "id": "2263",
                                "name": "缙云县",
                                "cid": "308"
                            }
                        ]
                    },
                    {
                        "id": "309",
                        "name": "绍兴市",
                        "pid": "24",
                        "children": [
                            {
                                "id": "2264",
                                "name": "上虞市",
                                "cid": "309"
                            },
                            {
                                "id": "2265",
                                "name": "新昌县",
                                "cid": "309"
                            },
                            {
                                "id": "2266",
                                "name": "绍兴县",
                                "cid": "309"
                            },
                            {
                                "id": "2267",
                                "name": "越城区",
                                "cid": "309"
                            },
                            {
                                "id": "2268",
                                "name": "嵊州市",
                                "cid": "309"
                            },
                            {
                                "id": "2269",
                                "name": "诸暨市",
                                "cid": "309"
                            }
                        ]
                    },
                    {
                        "id": "310",
                        "name": "湖州市",
                        "pid": "24",
                        "children": [
                            {
                                "id": "2270",
                                "name": "安吉县",
                                "cid": "310"
                            },
                            {
                                "id": "2271",
                                "name": "南浔区",
                                "cid": "310"
                            },
                            {
                                "id": "2272",
                                "name": "吴兴区",
                                "cid": "310"
                            },
                            {
                                "id": "2273",
                                "name": "德清县",
                                "cid": "310"
                            },
                            {
                                "id": "2274",
                                "name": "长兴县",
                                "cid": "310"
                            }
                        ]
                    },
                    {
                        "id": "311",
                        "name": "金华市",
                        "pid": "24",
                        "children": [
                            {
                                "id": "2275",
                                "name": "兰溪市",
                                "cid": "311"
                            },
                            {
                                "id": "2276",
                                "name": "东阳市",
                                "cid": "311"
                            },
                            {
                                "id": "2277",
                                "name": "金东区",
                                "cid": "311"
                            },
                            {
                                "id": "2278",
                                "name": "浦江县",
                                "cid": "311"
                            },
                            {
                                "id": "2279",
                                "name": "义乌市",
                                "cid": "311"
                            },
                            {
                                "id": "2280",
                                "name": "武义县",
                                "cid": "311"
                            },
                            {
                                "id": "2281",
                                "name": "磐安县",
                                "cid": "311"
                            },
                            {
                                "id": "2282",
                                "name": "婺城区",
                                "cid": "311"
                            },
                            {
                                "id": "2283",
                                "name": "永康市",
                                "cid": "311"
                            }
                        ]
                    },
                    {
                        "id": "312",
                        "name": "嘉兴市",
                        "pid": "24",
                        "children": [
                            {
                                "id": "2284",
                                "name": "南湖区",
                                "cid": "312"
                            },
                            {
                                "id": "2285",
                                "name": "秀洲区",
                                "cid": "312"
                            },
                            {
                                "id": "2286",
                                "name": "海盐县",
                                "cid": "312"
                            },
                            {
                                "id": "2287",
                                "name": "桐乡市",
                                "cid": "312"
                            },
                            {
                                "id": "2288",
                                "name": "嘉善县",
                                "cid": "312"
                            },
                            {
                                "id": "2289",
                                "name": "平湖市",
                                "cid": "312"
                            },
                            {
                                "id": "2290",
                                "name": "海宁市",
                                "cid": "312"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "6",
                "name": "山西省",
                "children": [
                    {
                        "id": "76",
                        "name": "太原市",
                        "pid": "6",
                        "children": [
                            {
                                "id": "530",
                                "name": "古交市",
                                "cid": "76"
                            },
                            {
                                "id": "531",
                                "name": "阳曲县",
                                "cid": "76"
                            },
                            {
                                "id": "532",
                                "name": "清徐县",
                                "cid": "76"
                            },
                            {
                                "id": "533",
                                "name": "娄烦县",
                                "cid": "76"
                            },
                            {
                                "id": "534",
                                "name": "尖草坪区",
                                "cid": "76"
                            },
                            {
                                "id": "535",
                                "name": "万柏林区",
                                "cid": "76"
                            },
                            {
                                "id": "536",
                                "name": "杏花岭区",
                                "cid": "76"
                            },
                            {
                                "id": "537",
                                "name": "晋源区",
                                "cid": "76"
                            },
                            {
                                "id": "538",
                                "name": "迎泽区",
                                "cid": "76"
                            },
                            {
                                "id": "539",
                                "name": "小店区",
                                "cid": "76"
                            }
                        ]
                    },
                    {
                        "id": "77",
                        "name": "朔州市",
                        "pid": "6",
                        "children": [
                            {
                                "id": "540",
                                "name": "怀仁县",
                                "cid": "77"
                            },
                            {
                                "id": "541",
                                "name": "右玉县",
                                "cid": "77"
                            },
                            {
                                "id": "542",
                                "name": "应县",
                                "cid": "77"
                            },
                            {
                                "id": "543",
                                "name": "山阴县",
                                "cid": "77"
                            },
                            {
                                "id": "544",
                                "name": "平鲁区",
                                "cid": "77"
                            },
                            {
                                "id": "545",
                                "name": "朔城区",
                                "cid": "77"
                            }
                        ]
                    },
                    {
                        "id": "78",
                        "name": "晋中市",
                        "pid": "6",
                        "children": [
                            {
                                "id": "546",
                                "name": "寿阳县",
                                "cid": "78"
                            },
                            {
                                "id": "547",
                                "name": "榆社县",
                                "cid": "78"
                            },
                            {
                                "id": "548",
                                "name": "榆次区",
                                "cid": "78"
                            },
                            {
                                "id": "549",
                                "name": "平遥县",
                                "cid": "78"
                            },
                            {
                                "id": "550",
                                "name": "左权县",
                                "cid": "78"
                            },
                            {
                                "id": "551",
                                "name": "昔阳县",
                                "cid": "78"
                            },
                            {
                                "id": "552",
                                "name": "介休市",
                                "cid": "78"
                            },
                            {
                                "id": "553",
                                "name": "太谷县",
                                "cid": "78"
                            },
                            {
                                "id": "554",
                                "name": "灵石县",
                                "cid": "78"
                            },
                            {
                                "id": "555",
                                "name": "和顺县",
                                "cid": "78"
                            },
                            {
                                "id": "556",
                                "name": "祁县",
                                "cid": "78"
                            }
                        ]
                    },
                    {
                        "id": "79",
                        "name": "晋城市",
                        "pid": "6",
                        "children": [
                            {
                                "id": "557",
                                "name": "市辖区",
                                "cid": "79"
                            },
                            {
                                "id": "558",
                                "name": "沁水县",
                                "cid": "79"
                            },
                            {
                                "id": "559",
                                "name": "高平市",
                                "cid": "79"
                            },
                            {
                                "id": "560",
                                "name": "阳城县",
                                "cid": "79"
                            },
                            {
                                "id": "561",
                                "name": "泽州县",
                                "cid": "79"
                            },
                            {
                                "id": "562",
                                "name": "陵川县",
                                "cid": "79"
                            }
                        ]
                    },
                    {
                        "id": "80",
                        "name": "吕梁市",
                        "pid": "6",
                        "children": [
                            {
                                "id": "563",
                                "name": "方山县",
                                "cid": "80"
                            },
                            {
                                "id": "564",
                                "name": "文水县",
                                "cid": "80"
                            },
                            {
                                "id": "565",
                                "name": "中阳县",
                                "cid": "80"
                            },
                            {
                                "id": "566",
                                "name": "岚县",
                                "cid": "80"
                            },
                            {
                                "id": "567",
                                "name": "交城县",
                                "cid": "80"
                            },
                            {
                                "id": "568",
                                "name": "孝义市",
                                "cid": "80"
                            },
                            {
                                "id": "569",
                                "name": "离石区",
                                "cid": "80"
                            },
                            {
                                "id": "570",
                                "name": "交口县",
                                "cid": "80"
                            },
                            {
                                "id": "571",
                                "name": "兴县",
                                "cid": "80"
                            },
                            {
                                "id": "572",
                                "name": "汾阳市",
                                "cid": "80"
                            },
                            {
                                "id": "573",
                                "name": "柳林县",
                                "cid": "80"
                            },
                            {
                                "id": "574",
                                "name": "临县",
                                "cid": "80"
                            },
                            {
                                "id": "575",
                                "name": "石楼县",
                                "cid": "80"
                            }
                        ]
                    },
                    {
                        "id": "81",
                        "name": "运城市",
                        "pid": "6",
                        "children": [
                            {
                                "id": "576",
                                "name": "稷山县",
                                "cid": "81"
                            },
                            {
                                "id": "577",
                                "name": "盐湖区",
                                "cid": "81"
                            },
                            {
                                "id": "578",
                                "name": "绛县",
                                "cid": "81"
                            },
                            {
                                "id": "579",
                                "name": "芮城县",
                                "cid": "81"
                            },
                            {
                                "id": "580",
                                "name": "夏县",
                                "cid": "81"
                            },
                            {
                                "id": "581",
                                "name": "临猗县",
                                "cid": "81"
                            },
                            {
                                "id": "582",
                                "name": "闻喜县",
                                "cid": "81"
                            },
                            {
                                "id": "583",
                                "name": "永济市",
                                "cid": "81"
                            },
                            {
                                "id": "584",
                                "name": "新绛县",
                                "cid": "81"
                            },
                            {
                                "id": "585",
                                "name": "垣曲县",
                                "cid": "81"
                            },
                            {
                                "id": "586",
                                "name": "万荣县",
                                "cid": "81"
                            },
                            {
                                "id": "587",
                                "name": "平陆县",
                                "cid": "81"
                            },
                            {
                                "id": "588",
                                "name": "河津市",
                                "cid": "81"
                            }
                        ]
                    },
                    {
                        "id": "82",
                        "name": "大同市",
                        "pid": "6",
                        "children": [
                            {
                                "id": "589",
                                "name": "左云县",
                                "cid": "82"
                            },
                            {
                                "id": "590",
                                "name": "广灵县",
                                "cid": "82"
                            },
                            {
                                "id": "591",
                                "name": "天镇县",
                                "cid": "82"
                            },
                            {
                                "id": "592",
                                "name": "灵丘县",
                                "cid": "82"
                            },
                            {
                                "id": "593",
                                "name": "大同县",
                                "cid": "82"
                            },
                            {
                                "id": "594",
                                "name": "阳高县",
                                "cid": "82"
                            },
                            {
                                "id": "595",
                                "name": "浑源县",
                                "cid": "82"
                            },
                            {
                                "id": "596",
                                "name": "南郊区",
                                "cid": "82"
                            },
                            {
                                "id": "597",
                                "name": "新荣区",
                                "cid": "82"
                            },
                            {
                                "id": "598",
                                "name": "城区",
                                "cid": "82"
                            }
                        ]
                    },
                    {
                        "id": "83",
                        "name": "长治市",
                        "pid": "6",
                        "children": [
                            {
                                "id": "599",
                                "name": "沁源县",
                                "cid": "83"
                            },
                            {
                                "id": "600",
                                "name": "长子县",
                                "cid": "83"
                            },
                            {
                                "id": "601",
                                "name": "襄垣县",
                                "cid": "83"
                            },
                            {
                                "id": "602",
                                "name": "屯留县",
                                "cid": "83"
                            },
                            {
                                "id": "603",
                                "name": "长治县",
                                "cid": "83"
                            },
                            {
                                "id": "604",
                                "name": "沁县",
                                "cid": "83"
                            },
                            {
                                "id": "605",
                                "name": "潞城市",
                                "cid": "83"
                            },
                            {
                                "id": "606",
                                "name": "壶关县",
                                "cid": "83"
                            },
                            {
                                "id": "607",
                                "name": "黎城县",
                                "cid": "83"
                            },
                            {
                                "id": "608",
                                "name": "武乡县",
                                "cid": "83"
                            },
                            {
                                "id": "609",
                                "name": "平顺县",
                                "cid": "83"
                            },
                            {
                                "id": "610",
                                "name": "郊区",
                                "cid": "83"
                            },
                            {
                                "id": "611",
                                "name": "城区",
                                "cid": "83"
                            }
                        ]
                    },
                    {
                        "id": "84",
                        "name": "阳泉市",
                        "pid": "6",
                        "children": [
                            {
                                "id": "612",
                                "name": "盂县",
                                "cid": "84"
                            },
                            {
                                "id": "613",
                                "name": "平定县",
                                "cid": "84"
                            },
                            {
                                "id": "614",
                                "name": "郊区",
                                "cid": "84"
                            },
                            {
                                "id": "615",
                                "name": "矿区",
                                "cid": "84"
                            },
                            {
                                "id": "616",
                                "name": "城区",
                                "cid": "84"
                            }
                        ]
                    },
                    {
                        "id": "85",
                        "name": "忻州市",
                        "pid": "6",
                        "children": [
                            {
                                "id": "617",
                                "name": "偏关县",
                                "cid": "85"
                            },
                            {
                                "id": "618",
                                "name": "代县",
                                "cid": "85"
                            },
                            {
                                "id": "619",
                                "name": "宁武县",
                                "cid": "85"
                            },
                            {
                                "id": "620",
                                "name": "定襄县",
                                "cid": "85"
                            },
                            {
                                "id": "621",
                                "name": "保德县",
                                "cid": "85"
                            },
                            {
                                "id": "622",
                                "name": "原平市",
                                "cid": "85"
                            },
                            {
                                "id": "623",
                                "name": "五寨县",
                                "cid": "85"
                            },
                            {
                                "id": "624",
                                "name": "神池县",
                                "cid": "85"
                            },
                            {
                                "id": "625",
                                "name": "忻府区",
                                "cid": "85"
                            },
                            {
                                "id": "626",
                                "name": "繁峙县",
                                "cid": "85"
                            },
                            {
                                "id": "627",
                                "name": "河曲县",
                                "cid": "85"
                            },
                            {
                                "id": "628",
                                "name": "岢岚县",
                                "cid": "85"
                            },
                            {
                                "id": "629",
                                "name": "静乐县",
                                "cid": "85"
                            },
                            {
                                "id": "630",
                                "name": "五台县",
                                "cid": "85"
                            }
                        ]
                    },
                    {
                        "id": "86",
                        "name": "临汾市",
                        "pid": "6",
                        "children": [
                            {
                                "id": "631",
                                "name": "汾西县",
                                "cid": "86"
                            },
                            {
                                "id": "632",
                                "name": "尧都区",
                                "cid": "86"
                            },
                            {
                                "id": "633",
                                "name": "翼城县",
                                "cid": "86"
                            },
                            {
                                "id": "634",
                                "name": "侯马市",
                                "cid": "86"
                            },
                            {
                                "id": "635",
                                "name": "隰县",
                                "cid": "86"
                            },
                            {
                                "id": "636",
                                "name": "洪洞县",
                                "cid": "86"
                            },
                            {
                                "id": "637",
                                "name": "襄汾县",
                                "cid": "86"
                            },
                            {
                                "id": "638",
                                "name": "古县",
                                "cid": "86"
                            },
                            {
                                "id": "639",
                                "name": "蒲县",
                                "cid": "86"
                            },
                            {
                                "id": "640",
                                "name": "永和县",
                                "cid": "86"
                            },
                            {
                                "id": "641",
                                "name": "乡宁县",
                                "cid": "86"
                            },
                            {
                                "id": "642",
                                "name": "安泽县",
                                "cid": "86"
                            },
                            {
                                "id": "643",
                                "name": "曲沃县",
                                "cid": "86"
                            },
                            {
                                "id": "644",
                                "name": "吉县",
                                "cid": "86"
                            },
                            {
                                "id": "645",
                                "name": "浮山县",
                                "cid": "86"
                            },
                            {
                                "id": "646",
                                "name": "霍州市",
                                "cid": "86"
                            },
                            {
                                "id": "647",
                                "name": "大宁县",
                                "cid": "86"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "26",
                "name": "江西省",
                "children": [
                    {
                        "id": "331",
                        "name": "南昌市",
                        "pid": "26",
                        "children": [
                            {
                                "id": "2436",
                                "name": "南昌县",
                                "cid": "331"
                            },
                            {
                                "id": "2437",
                                "name": "安义县",
                                "cid": "331"
                            },
                            {
                                "id": "2438",
                                "name": "进贤县",
                                "cid": "331"
                            },
                            {
                                "id": "2439",
                                "name": "新建县",
                                "cid": "331"
                            },
                            {
                                "id": "2440",
                                "name": "青山湖区",
                                "cid": "331"
                            },
                            {
                                "id": "2441",
                                "name": "湾里区",
                                "cid": "331"
                            },
                            {
                                "id": "2442",
                                "name": "西湖区",
                                "cid": "331"
                            },
                            {
                                "id": "2443",
                                "name": "东湖区",
                                "cid": "331"
                            },
                            {
                                "id": "2444",
                                "name": "青云谱区",
                                "cid": "331"
                            }
                        ]
                    },
                    {
                        "id": "332",
                        "name": "新余市",
                        "pid": "26",
                        "children": [
                            {
                                "id": "2445",
                                "name": "分宜县",
                                "cid": "332"
                            },
                            {
                                "id": "2446",
                                "name": "渝水区",
                                "cid": "332"
                            }
                        ]
                    },
                    {
                        "id": "333",
                        "name": "景德镇市",
                        "pid": "26",
                        "children": [
                            {
                                "id": "2447",
                                "name": "乐平市",
                                "cid": "333"
                            },
                            {
                                "id": "2448",
                                "name": "浮梁县",
                                "cid": "333"
                            },
                            {
                                "id": "2449",
                                "name": "昌江区",
                                "cid": "333"
                            },
                            {
                                "id": "2450",
                                "name": "珠山区",
                                "cid": "333"
                            }
                        ]
                    },
                    {
                        "id": "334",
                        "name": "抚州市",
                        "pid": "26",
                        "children": [
                            {
                                "id": "2451",
                                "name": "金溪县",
                                "cid": "334"
                            },
                            {
                                "id": "2452",
                                "name": "乐安县",
                                "cid": "334"
                            },
                            {
                                "id": "2453",
                                "name": "东乡县",
                                "cid": "334"
                            },
                            {
                                "id": "2454",
                                "name": "宜黄县",
                                "cid": "334"
                            },
                            {
                                "id": "2455",
                                "name": "广昌县",
                                "cid": "334"
                            },
                            {
                                "id": "2456",
                                "name": "资溪县",
                                "cid": "334"
                            },
                            {
                                "id": "2457",
                                "name": "临川区",
                                "cid": "334"
                            },
                            {
                                "id": "2458",
                                "name": "崇仁县",
                                "cid": "334"
                            },
                            {
                                "id": "2459",
                                "name": "南城县",
                                "cid": "334"
                            },
                            {
                                "id": "2460",
                                "name": "黎川县",
                                "cid": "334"
                            },
                            {
                                "id": "2461",
                                "name": "南丰县",
                                "cid": "334"
                            }
                        ]
                    },
                    {
                        "id": "335",
                        "name": "宜春市",
                        "pid": "26",
                        "children": [
                            {
                                "id": "2462",
                                "name": "靖安县",
                                "cid": "335"
                            },
                            {
                                "id": "2463",
                                "name": "高安市",
                                "cid": "335"
                            },
                            {
                                "id": "2464",
                                "name": "奉新县",
                                "cid": "335"
                            },
                            {
                                "id": "2465",
                                "name": "丰城市",
                                "cid": "335"
                            },
                            {
                                "id": "2466",
                                "name": "上高县",
                                "cid": "335"
                            },
                            {
                                "id": "2467",
                                "name": "樟树市",
                                "cid": "335"
                            },
                            {
                                "id": "2468",
                                "name": "宜丰县",
                                "cid": "335"
                            },
                            {
                                "id": "2469",
                                "name": "万载县",
                                "cid": "335"
                            },
                            {
                                "id": "2470",
                                "name": "袁州区",
                                "cid": "335"
                            },
                            {
                                "id": "2471",
                                "name": "铜鼓县",
                                "cid": "335"
                            }
                        ]
                    },
                    {
                        "id": "336",
                        "name": "鹰潭市",
                        "pid": "26",
                        "children": [
                            {
                                "id": "2472",
                                "name": "月湖区",
                                "cid": "336"
                            },
                            {
                                "id": "2473",
                                "name": "余江县",
                                "cid": "336"
                            },
                            {
                                "id": "2474",
                                "name": "贵溪市",
                                "cid": "336"
                            }
                        ]
                    },
                    {
                        "id": "337",
                        "name": "吉安市",
                        "pid": "26",
                        "children": [
                            {
                                "id": "2475",
                                "name": "峡江县",
                                "cid": "337"
                            },
                            {
                                "id": "2476",
                                "name": "安福县",
                                "cid": "337"
                            },
                            {
                                "id": "2477",
                                "name": "永丰县",
                                "cid": "337"
                            },
                            {
                                "id": "2478",
                                "name": "吉安县",
                                "cid": "337"
                            },
                            {
                                "id": "2479",
                                "name": "万安县",
                                "cid": "337"
                            },
                            {
                                "id": "2480",
                                "name": "吉水县",
                                "cid": "337"
                            },
                            {
                                "id": "2481",
                                "name": "井冈山市",
                                "cid": "337"
                            },
                            {
                                "id": "2482",
                                "name": "新干县",
                                "cid": "337"
                            },
                            {
                                "id": "2483",
                                "name": "泰和县",
                                "cid": "337"
                            },
                            {
                                "id": "2484",
                                "name": "遂川县",
                                "cid": "337"
                            },
                            {
                                "id": "2485",
                                "name": "永新县",
                                "cid": "337"
                            },
                            {
                                "id": "2486",
                                "name": "青原区",
                                "cid": "337"
                            },
                            {
                                "id": "2487",
                                "name": "吉州区",
                                "cid": "337"
                            }
                        ]
                    },
                    {
                        "id": "338",
                        "name": "九江市",
                        "pid": "26",
                        "children": [
                            {
                                "id": "2488",
                                "name": "都昌县",
                                "cid": "338"
                            },
                            {
                                "id": "2489",
                                "name": "瑞昌市",
                                "cid": "338"
                            },
                            {
                                "id": "2490",
                                "name": "星子县",
                                "cid": "338"
                            },
                            {
                                "id": "2491",
                                "name": "武宁县",
                                "cid": "338"
                            },
                            {
                                "id": "2492",
                                "name": "彭泽县",
                                "cid": "338"
                            },
                            {
                                "id": "2493",
                                "name": "德安县",
                                "cid": "338"
                            },
                            {
                                "id": "2494",
                                "name": "湖口县",
                                "cid": "338"
                            },
                            {
                                "id": "2495",
                                "name": "永修县",
                                "cid": "338"
                            },
                            {
                                "id": "2496",
                                "name": "九江县",
                                "cid": "338"
                            },
                            {
                                "id": "2497",
                                "name": "修水县",
                                "cid": "338"
                            },
                            {
                                "id": "2498",
                                "name": "浔阳区",
                                "cid": "338"
                            },
                            {
                                "id": "2499",
                                "name": "庐山区",
                                "cid": "338"
                            }
                        ]
                    },
                    {
                        "id": "339",
                        "name": "萍乡市",
                        "pid": "26",
                        "children": [
                            {
                                "id": "2500",
                                "name": "上栗县",
                                "cid": "339"
                            },
                            {
                                "id": "2501",
                                "name": "芦溪县",
                                "cid": "339"
                            },
                            {
                                "id": "2502",
                                "name": "莲花县",
                                "cid": "339"
                            },
                            {
                                "id": "2503",
                                "name": "安源区",
                                "cid": "339"
                            },
                            {
                                "id": "2504",
                                "name": "湘东区",
                                "cid": "339"
                            }
                        ]
                    },
                    {
                        "id": "340",
                        "name": "上饶市",
                        "pid": "26",
                        "children": [
                            {
                                "id": "2505",
                                "name": "信州区",
                                "cid": "340"
                            },
                            {
                                "id": "2506",
                                "name": "万年县",
                                "cid": "340"
                            },
                            {
                                "id": "2507",
                                "name": "横峰县",
                                "cid": "340"
                            },
                            {
                                "id": "2508",
                                "name": "婺源县",
                                "cid": "340"
                            },
                            {
                                "id": "2509",
                                "name": "余干县",
                                "cid": "340"
                            },
                            {
                                "id": "2510",
                                "name": "弋阳县",
                                "cid": "340"
                            },
                            {
                                "id": "2511",
                                "name": "上饶县",
                                "cid": "340"
                            },
                            {
                                "id": "2512",
                                "name": "铅山县",
                                "cid": "340"
                            },
                            {
                                "id": "2513",
                                "name": "玉山县",
                                "cid": "340"
                            },
                            {
                                "id": "2514",
                                "name": "鄱阳县",
                                "cid": "340"
                            },
                            {
                                "id": "2515",
                                "name": "广丰县",
                                "cid": "340"
                            },
                            {
                                "id": "2516",
                                "name": "德兴市",
                                "cid": "340"
                            }
                        ]
                    },
                    {
                        "id": "341",
                        "name": "赣州市",
                        "pid": "26",
                        "children": [
                            {
                                "id": "2517",
                                "name": "于都县",
                                "cid": "341"
                            },
                            {
                                "id": "2518",
                                "name": "章贡区",
                                "cid": "341"
                            },
                            {
                                "id": "2519",
                                "name": "安远县",
                                "cid": "341"
                            },
                            {
                                "id": "2520",
                                "name": "瑞金市",
                                "cid": "341"
                            },
                            {
                                "id": "2521",
                                "name": "大余县",
                                "cid": "341"
                            },
                            {
                                "id": "2522",
                                "name": "宁都县",
                                "cid": "341"
                            },
                            {
                                "id": "2523",
                                "name": "赣县",
                                "cid": "341"
                            },
                            {
                                "id": "2524",
                                "name": "上犹县",
                                "cid": "341"
                            },
                            {
                                "id": "2525",
                                "name": "兴国县",
                                "cid": "341"
                            },
                            {
                                "id": "2526",
                                "name": "会昌县",
                                "cid": "341"
                            },
                            {
                                "id": "2527",
                                "name": "龙南县",
                                "cid": "341"
                            },
                            {
                                "id": "2528",
                                "name": "南康市",
                                "cid": "341"
                            },
                            {
                                "id": "2529",
                                "name": "石城县",
                                "cid": "341"
                            },
                            {
                                "id": "2530",
                                "name": "信丰县",
                                "cid": "341"
                            },
                            {
                                "id": "2531",
                                "name": "寻乌县",
                                "cid": "341"
                            },
                            {
                                "id": "2532",
                                "name": "全南县",
                                "cid": "341"
                            },
                            {
                                "id": "2533",
                                "name": "崇义县",
                                "cid": "341"
                            },
                            {
                                "id": "2534",
                                "name": "定南县",
                                "cid": "341"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "20",
                "name": "河北省",
                "children": [
                    {
                        "id": "251",
                        "name": "秦皇岛市",
                        "pid": "20",
                        "children": [
                            {
                                "id": "1671",
                                "name": "抚宁县",
                                "cid": "251"
                            },
                            {
                                "id": "1672",
                                "name": "卢龙县",
                                "cid": "251"
                            },
                            {
                                "id": "1673",
                                "name": "青龙满族自治县",
                                "cid": "251"
                            },
                            {
                                "id": "1674",
                                "name": "昌黎县",
                                "cid": "251"
                            },
                            {
                                "id": "1675",
                                "name": "山海关区",
                                "cid": "251"
                            },
                            {
                                "id": "1676",
                                "name": "海港区",
                                "cid": "251"
                            },
                            {
                                "id": "1677",
                                "name": "北戴河区",
                                "cid": "251"
                            }
                        ]
                    },
                    {
                        "id": "252",
                        "name": "沧州市",
                        "pid": "20",
                        "children": [
                            {
                                "id": "1678",
                                "name": "沧县",
                                "cid": "252"
                            },
                            {
                                "id": "1679",
                                "name": "海兴县",
                                "cid": "252"
                            },
                            {
                                "id": "1680",
                                "name": "东光县",
                                "cid": "252"
                            },
                            {
                                "id": "1681",
                                "name": "河间市",
                                "cid": "252"
                            },
                            {
                                "id": "1682",
                                "name": "盐山县",
                                "cid": "252"
                            },
                            {
                                "id": "1683",
                                "name": "献县",
                                "cid": "252"
                            },
                            {
                                "id": "1684",
                                "name": "南皮县",
                                "cid": "252"
                            },
                            {
                                "id": "1685",
                                "name": "黄骅市",
                                "cid": "252"
                            },
                            {
                                "id": "1686",
                                "name": "吴桥县",
                                "cid": "252"
                            },
                            {
                                "id": "1687",
                                "name": "任丘市",
                                "cid": "252"
                            },
                            {
                                "id": "1688",
                                "name": "孟村回族自治县",
                                "cid": "252"
                            },
                            {
                                "id": "1689",
                                "name": "肃宁县",
                                "cid": "252"
                            },
                            {
                                "id": "1690",
                                "name": "青县",
                                "cid": "252"
                            },
                            {
                                "id": "1691",
                                "name": "泊头市",
                                "cid": "252"
                            },
                            {
                                "id": "1692",
                                "name": "运河区",
                                "cid": "252"
                            },
                            {
                                "id": "1693",
                                "name": "新华区",
                                "cid": "252"
                            }
                        ]
                    },
                    {
                        "id": "253",
                        "name": "石家庄市",
                        "pid": "20",
                        "children": [
                            {
                                "id": "1694",
                                "name": "正定县",
                                "cid": "253"
                            },
                            {
                                "id": "1695",
                                "name": "井陉县",
                                "cid": "253"
                            },
                            {
                                "id": "1696",
                                "name": "高邑县",
                                "cid": "253"
                            },
                            {
                                "id": "1697",
                                "name": "深泽县",
                                "cid": "253"
                            },
                            {
                                "id": "1698",
                                "name": "平山县",
                                "cid": "253"
                            },
                            {
                                "id": "1699",
                                "name": "井陉矿区",
                                "cid": "253"
                            },
                            {
                                "id": "1700",
                                "name": "藁城市",
                                "cid": "253"
                            },
                            {
                                "id": "1701",
                                "name": "元氏县",
                                "cid": "253"
                            },
                            {
                                "id": "1702",
                                "name": "无极县",
                                "cid": "253"
                            },
                            {
                                "id": "1703",
                                "name": "行唐县",
                                "cid": "253"
                            },
                            {
                                "id": "1704",
                                "name": "鹿泉市",
                                "cid": "253"
                            },
                            {
                                "id": "1705",
                                "name": "赵县",
                                "cid": "253"
                            },
                            {
                                "id": "1706",
                                "name": "赞皇县",
                                "cid": "253"
                            },
                            {
                                "id": "1707",
                                "name": "灵寿县",
                                "cid": "253"
                            },
                            {
                                "id": "1708",
                                "name": "辛集市",
                                "cid": "253"
                            },
                            {
                                "id": "1709",
                                "name": "栾城县",
                                "cid": "253"
                            },
                            {
                                "id": "1710",
                                "name": "新乐市",
                                "cid": "253"
                            },
                            {
                                "id": "1711",
                                "name": "晋州市",
                                "cid": "253"
                            },
                            {
                                "id": "1712",
                                "name": "新华区",
                                "cid": "253"
                            },
                            {
                                "id": "1713",
                                "name": "桥东区",
                                "cid": "253"
                            },
                            {
                                "id": "1714",
                                "name": "长安区",
                                "cid": "253"
                            },
                            {
                                "id": "1715",
                                "name": "桥西区",
                                "cid": "253"
                            },
                            {
                                "id": "1716",
                                "name": "裕华区",
                                "cid": "253"
                            }
                        ]
                    },
                    {
                        "id": "254",
                        "name": "邯郸市",
                        "pid": "20",
                        "children": [
                            {
                                "id": "1717",
                                "name": "邱县",
                                "cid": "254"
                            },
                            {
                                "id": "1718",
                                "name": "武安市",
                                "cid": "254"
                            },
                            {
                                "id": "1719",
                                "name": "大名县",
                                "cid": "254"
                            },
                            {
                                "id": "1720",
                                "name": "成安县",
                                "cid": "254"
                            },
                            {
                                "id": "1721",
                                "name": "广平县",
                                "cid": "254"
                            },
                            {
                                "id": "1722",
                                "name": "临漳县",
                                "cid": "254"
                            },
                            {
                                "id": "1723",
                                "name": "邯郸县",
                                "cid": "254"
                            },
                            {
                                "id": "1724",
                                "name": "曲周县",
                                "cid": "254"
                            },
                            {
                                "id": "1725",
                                "name": "魏县",
                                "cid": "254"
                            },
                            {
                                "id": "1726",
                                "name": "磁县",
                                "cid": "254"
                            },
                            {
                                "id": "1727",
                                "name": "永年县",
                                "cid": "254"
                            },
                            {
                                "id": "1728",
                                "name": "涉县",
                                "cid": "254"
                            },
                            {
                                "id": "1729",
                                "name": "馆陶县",
                                "cid": "254"
                            },
                            {
                                "id": "1730",
                                "name": "峰峰矿区",
                                "cid": "254"
                            },
                            {
                                "id": "1731",
                                "name": "肥乡县",
                                "cid": "254"
                            },
                            {
                                "id": "1732",
                                "name": "鸡泽县",
                                "cid": "254"
                            },
                            {
                                "id": "1733",
                                "name": "丛台区",
                                "cid": "254"
                            },
                            {
                                "id": "1734",
                                "name": "复兴区",
                                "cid": "254"
                            },
                            {
                                "id": "1735",
                                "name": "邯山区",
                                "cid": "254"
                            }
                        ]
                    },
                    {
                        "id": "255",
                        "name": "廊坊市",
                        "pid": "20",
                        "children": [
                            {
                                "id": "1736",
                                "name": "永清县",
                                "cid": "255"
                            },
                            {
                                "id": "1737",
                                "name": "文安县",
                                "cid": "255"
                            },
                            {
                                "id": "1738",
                                "name": "大厂回族自治县",
                                "cid": "255"
                            },
                            {
                                "id": "1739",
                                "name": "大城县",
                                "cid": "255"
                            },
                            {
                                "id": "1740",
                                "name": "香河县",
                                "cid": "255"
                            },
                            {
                                "id": "1741",
                                "name": "固安县",
                                "cid": "255"
                            },
                            {
                                "id": "1742",
                                "name": "三河市",
                                "cid": "255"
                            },
                            {
                                "id": "1743",
                                "name": "霸州市",
                                "cid": "255"
                            },
                            {
                                "id": "1744",
                                "name": "广阳区",
                                "cid": "255"
                            },
                            {
                                "id": "1745",
                                "name": "安次区",
                                "cid": "255"
                            }
                        ]
                    },
                    {
                        "id": "256",
                        "name": "承德市",
                        "pid": "20",
                        "children": [
                            {
                                "id": "1746",
                                "name": "围场满族蒙古族自治县",
                                "cid": "256"
                            },
                            {
                                "id": "1747",
                                "name": "隆化县",
                                "cid": "256"
                            },
                            {
                                "id": "1748",
                                "name": "承德县",
                                "cid": "256"
                            },
                            {
                                "id": "1749",
                                "name": "宽城满族自治县",
                                "cid": "256"
                            },
                            {
                                "id": "1750",
                                "name": "鹰手营子矿区",
                                "cid": "256"
                            },
                            {
                                "id": "1751",
                                "name": "丰宁满族自治县",
                                "cid": "256"
                            },
                            {
                                "id": "1752",
                                "name": "滦平县",
                                "cid": "256"
                            },
                            {
                                "id": "1753",
                                "name": "平泉县",
                                "cid": "256"
                            },
                            {
                                "id": "1754",
                                "name": "兴隆县",
                                "cid": "256"
                            },
                            {
                                "id": "1755",
                                "name": "双桥区",
                                "cid": "256"
                            },
                            {
                                "id": "1756",
                                "name": "双滦区",
                                "cid": "256"
                            }
                        ]
                    },
                    {
                        "id": "257",
                        "name": "衡水市",
                        "pid": "20",
                        "children": [
                            {
                                "id": "1757",
                                "name": "深州市",
                                "cid": "257"
                            },
                            {
                                "id": "1758",
                                "name": "枣强县",
                                "cid": "257"
                            },
                            {
                                "id": "1759",
                                "name": "阜城县",
                                "cid": "257"
                            },
                            {
                                "id": "1760",
                                "name": "桃城区",
                                "cid": "257"
                            },
                            {
                                "id": "1761",
                                "name": "饶阳县",
                                "cid": "257"
                            },
                            {
                                "id": "1762",
                                "name": "故城县",
                                "cid": "257"
                            },
                            {
                                "id": "1763",
                                "name": "武邑县",
                                "cid": "257"
                            },
                            {
                                "id": "1764",
                                "name": "冀州市",
                                "cid": "257"
                            },
                            {
                                "id": "1765",
                                "name": "武强县",
                                "cid": "257"
                            },
                            {
                                "id": "1766",
                                "name": "景县",
                                "cid": "257"
                            },
                            {
                                "id": "1767",
                                "name": "安平县",
                                "cid": "257"
                            }
                        ]
                    },
                    {
                        "id": "258",
                        "name": "张家口市",
                        "pid": "20",
                        "children": [
                            {
                                "id": "1768",
                                "name": "康保县",
                                "cid": "258"
                            },
                            {
                                "id": "1769",
                                "name": "沽源县",
                                "cid": "258"
                            },
                            {
                                "id": "1770",
                                "name": "张北县",
                                "cid": "258"
                            },
                            {
                                "id": "1771",
                                "name": "怀安县",
                                "cid": "258"
                            },
                            {
                                "id": "1772",
                                "name": "蔚县",
                                "cid": "258"
                            },
                            {
                                "id": "1773",
                                "name": "下花园区",
                                "cid": "258"
                            },
                            {
                                "id": "1774",
                                "name": "尚义县",
                                "cid": "258"
                            },
                            {
                                "id": "1775",
                                "name": "阳原县",
                                "cid": "258"
                            },
                            {
                                "id": "1776",
                                "name": "崇礼县",
                                "cid": "258"
                            },
                            {
                                "id": "1777",
                                "name": "涿鹿县",
                                "cid": "258"
                            },
                            {
                                "id": "1778",
                                "name": "宣化县",
                                "cid": "258"
                            },
                            {
                                "id": "1779",
                                "name": "万全县",
                                "cid": "258"
                            },
                            {
                                "id": "1780",
                                "name": "赤城县",
                                "cid": "258"
                            },
                            {
                                "id": "1781",
                                "name": "怀来县",
                                "cid": "258"
                            },
                            {
                                "id": "1782",
                                "name": "桥西区",
                                "cid": "258"
                            },
                            {
                                "id": "1783",
                                "name": "桥东区",
                                "cid": "258"
                            },
                            {
                                "id": "1784",
                                "name": "宣化区",
                                "cid": "258"
                            }
                        ]
                    },
                    {
                        "id": "259",
                        "name": "唐山市",
                        "pid": "20",
                        "children": [
                            {
                                "id": "1785",
                                "name": "迁安市",
                                "cid": "259"
                            },
                            {
                                "id": "1786",
                                "name": "乐亭县",
                                "cid": "259"
                            },
                            {
                                "id": "1787",
                                "name": "唐海县",
                                "cid": "259"
                            },
                            {
                                "id": "1788",
                                "name": "滦县",
                                "cid": "259"
                            },
                            {
                                "id": "1789",
                                "name": "遵化市",
                                "cid": "259"
                            },
                            {
                                "id": "1790",
                                "name": "迁西县",
                                "cid": "259"
                            },
                            {
                                "id": "1791",
                                "name": "玉田县",
                                "cid": "259"
                            },
                            {
                                "id": "1792",
                                "name": "滦南县",
                                "cid": "259"
                            },
                            {
                                "id": "1793",
                                "name": "开平区",
                                "cid": "259"
                            },
                            {
                                "id": "1794",
                                "name": "路北区",
                                "cid": "259"
                            },
                            {
                                "id": "1795",
                                "name": "古冶区",
                                "cid": "259"
                            },
                            {
                                "id": "1796",
                                "name": "路南区",
                                "cid": "259"
                            },
                            {
                                "id": "1797",
                                "name": "丰润区",
                                "cid": "259"
                            },
                            {
                                "id": "1798",
                                "name": "丰南区",
                                "cid": "259"
                            }
                        ]
                    },
                    {
                        "id": "260",
                        "name": "邢台市",
                        "pid": "20",
                        "children": [
                            {
                                "id": "1799",
                                "name": "宁晋县",
                                "cid": "260"
                            },
                            {
                                "id": "1800",
                                "name": "内邱县",
                                "cid": "260"
                            },
                            {
                                "id": "1801",
                                "name": "清河县",
                                "cid": "260"
                            },
                            {
                                "id": "1802",
                                "name": "南和县",
                                "cid": "260"
                            },
                            {
                                "id": "1803",
                                "name": "新河县",
                                "cid": "260"
                            },
                            {
                                "id": "1804",
                                "name": "隆尧县",
                                "cid": "260"
                            },
                            {
                                "id": "1805",
                                "name": "威县",
                                "cid": "260"
                            },
                            {
                                "id": "1806",
                                "name": "平乡县",
                                "cid": "260"
                            },
                            {
                                "id": "1807",
                                "name": "沙河市",
                                "cid": "260"
                            },
                            {
                                "id": "1808",
                                "name": "邢台县",
                                "cid": "260"
                            },
                            {
                                "id": "1809",
                                "name": "临西县",
                                "cid": "260"
                            },
                            {
                                "id": "1810",
                                "name": "巨鹿县",
                                "cid": "260"
                            },
                            {
                                "id": "1811",
                                "name": "临城县",
                                "cid": "260"
                            },
                            {
                                "id": "1812",
                                "name": "南宫市",
                                "cid": "260"
                            },
                            {
                                "id": "1813",
                                "name": "任县",
                                "cid": "260"
                            },
                            {
                                "id": "1814",
                                "name": "柏乡县",
                                "cid": "260"
                            },
                            {
                                "id": "1815",
                                "name": "广宗县",
                                "cid": "260"
                            },
                            {
                                "id": "1816",
                                "name": "桥东区",
                                "cid": "260"
                            },
                            {
                                "id": "1817",
                                "name": "桥西区",
                                "cid": "260"
                            }
                        ]
                    },
                    {
                        "id": "261",
                        "name": "保定市",
                        "pid": "20",
                        "children": [
                            {
                                "id": "1818",
                                "name": "高碑店市",
                                "cid": "261"
                            },
                            {
                                "id": "1819",
                                "name": "安新县",
                                "cid": "261"
                            },
                            {
                                "id": "1820",
                                "name": "满城县",
                                "cid": "261"
                            },
                            {
                                "id": "1821",
                                "name": "阜平县",
                                "cid": "261"
                            },
                            {
                                "id": "1822",
                                "name": "蠡县",
                                "cid": "261"
                            },
                            {
                                "id": "1823",
                                "name": "定州市",
                                "cid": "261"
                            },
                            {
                                "id": "1824",
                                "name": "涞源县",
                                "cid": "261"
                            },
                            {
                                "id": "1825",
                                "name": "雄县",
                                "cid": "261"
                            },
                            {
                                "id": "1826",
                                "name": "定兴县",
                                "cid": "261"
                            },
                            {
                                "id": "1827",
                                "name": "清苑县",
                                "cid": "261"
                            },
                            {
                                "id": "1828",
                                "name": "曲阳县",
                                "cid": "261"
                            },
                            {
                                "id": "1829",
                                "name": "容城县",
                                "cid": "261"
                            },
                            {
                                "id": "1830",
                                "name": "易县",
                                "cid": "261"
                            },
                            {
                                "id": "1831",
                                "name": "高阳县",
                                "cid": "261"
                            },
                            {
                                "id": "1832",
                                "name": "安国市",
                                "cid": "261"
                            },
                            {
                                "id": "1833",
                                "name": "涿州市",
                                "cid": "261"
                            },
                            {
                                "id": "1834",
                                "name": "徐水县",
                                "cid": "261"
                            },
                            {
                                "id": "1835",
                                "name": "顺平县",
                                "cid": "261"
                            },
                            {
                                "id": "1836",
                                "name": "博野县",
                                "cid": "261"
                            },
                            {
                                "id": "1837",
                                "name": "涞水县",
                                "cid": "261"
                            },
                            {
                                "id": "1838",
                                "name": "唐县",
                                "cid": "261"
                            },
                            {
                                "id": "1839",
                                "name": "望都县",
                                "cid": "261"
                            },
                            {
                                "id": "1840",
                                "name": "新市区",
                                "cid": "261"
                            },
                            {
                                "id": "1841",
                                "name": "北市区",
                                "cid": "261"
                            },
                            {
                                "id": "1842",
                                "name": "南市区",
                                "cid": "261"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "17",
                "name": "内蒙古自治区",
                "children": [
                    {
                        "id": "213",
                        "name": "呼伦贝尔市",
                        "pid": "17",
                        "children": [
                            {
                                "id": "1377",
                                "name": "牙克石市",
                                "cid": "213"
                            },
                            {
                                "id": "1378",
                                "name": "陈巴尔虎旗",
                                "cid": "213"
                            },
                            {
                                "id": "1379",
                                "name": "新巴尔虎左旗",
                                "cid": "213"
                            },
                            {
                                "id": "1380",
                                "name": "满洲里市",
                                "cid": "213"
                            },
                            {
                                "id": "1381",
                                "name": "新巴尔虎右旗",
                                "cid": "213"
                            },
                            {
                                "id": "1382",
                                "name": "海拉尔区",
                                "cid": "213"
                            },
                            {
                                "id": "1383",
                                "name": "鄂温克族自治旗",
                                "cid": "213"
                            },
                            {
                                "id": "1384",
                                "name": "额尔古纳市",
                                "cid": "213"
                            },
                            {
                                "id": "1385",
                                "name": "根河市",
                                "cid": "213"
                            },
                            {
                                "id": "1386",
                                "name": "鄂伦春自治旗",
                                "cid": "213"
                            },
                            {
                                "id": "1387",
                                "name": "阿荣旗",
                                "cid": "213"
                            },
                            {
                                "id": "1388",
                                "name": "扎兰屯市",
                                "cid": "213"
                            },
                            {
                                "id": "1389",
                                "name": "莫力达瓦达斡尔族自治旗",
                                "cid": "213"
                            }
                        ]
                    },
                    {
                        "id": "214",
                        "name": "兴安盟",
                        "pid": "17",
                        "children": [
                            {
                                "id": "1390",
                                "name": "阿尔山市",
                                "cid": "214"
                            },
                            {
                                "id": "1391",
                                "name": "扎赉特旗",
                                "cid": "214"
                            },
                            {
                                "id": "1392",
                                "name": "科尔沁右翼前旗",
                                "cid": "214"
                            },
                            {
                                "id": "1393",
                                "name": "突泉县",
                                "cid": "214"
                            },
                            {
                                "id": "1394",
                                "name": "乌兰浩特市",
                                "cid": "214"
                            },
                            {
                                "id": "1395",
                                "name": "科尔沁右翼中旗",
                                "cid": "214"
                            }
                        ]
                    },
                    {
                        "id": "215",
                        "name": "锡林郭勒盟",
                        "pid": "17",
                        "children": [
                            {
                                "id": "1396",
                                "name": "东乌珠穆沁旗",
                                "cid": "215"
                            },
                            {
                                "id": "1397",
                                "name": "西乌珠穆沁旗",
                                "cid": "215"
                            },
                            {
                                "id": "1398",
                                "name": "锡林浩特市",
                                "cid": "215"
                            },
                            {
                                "id": "1399",
                                "name": "阿巴嘎旗",
                                "cid": "215"
                            },
                            {
                                "id": "1400",
                                "name": "苏尼特左旗",
                                "cid": "215"
                            },
                            {
                                "id": "1401",
                                "name": "苏尼特右旗",
                                "cid": "215"
                            },
                            {
                                "id": "1402",
                                "name": "二连浩特市",
                                "cid": "215"
                            },
                            {
                                "id": "1403",
                                "name": "多伦县",
                                "cid": "215"
                            },
                            {
                                "id": "1404",
                                "name": "正镶白旗",
                                "cid": "215"
                            },
                            {
                                "id": "1405",
                                "name": "镶黄旗",
                                "cid": "215"
                            },
                            {
                                "id": "1406",
                                "name": "正蓝旗",
                                "cid": "215"
                            },
                            {
                                "id": "1407",
                                "name": "太仆寺旗",
                                "cid": "215"
                            }
                        ]
                    },
                    {
                        "id": "216",
                        "name": "通辽市",
                        "pid": "17",
                        "children": [
                            {
                                "id": "1408",
                                "name": "扎鲁特旗",
                                "cid": "216"
                            },
                            {
                                "id": "1409",
                                "name": "科尔沁区",
                                "cid": "216"
                            },
                            {
                                "id": "1410",
                                "name": "开鲁县",
                                "cid": "216"
                            },
                            {
                                "id": "1411",
                                "name": "霍林郭勒市",
                                "cid": "216"
                            },
                            {
                                "id": "1412",
                                "name": "科尔沁左翼后旗",
                                "cid": "216"
                            },
                            {
                                "id": "1413",
                                "name": "科尔沁左翼中旗",
                                "cid": "216"
                            },
                            {
                                "id": "1414",
                                "name": "库伦旗",
                                "cid": "216"
                            },
                            {
                                "id": "1415",
                                "name": "奈曼旗",
                                "cid": "216"
                            }
                        ]
                    },
                    {
                        "id": "217",
                        "name": "乌海市",
                        "pid": "17",
                        "children": [
                            {
                                "id": "1416",
                                "name": "海南区",
                                "cid": "217"
                            },
                            {
                                "id": "1417",
                                "name": "海勃湾区",
                                "cid": "217"
                            },
                            {
                                "id": "1418",
                                "name": "乌达区",
                                "cid": "217"
                            }
                        ]
                    },
                    {
                        "id": "218",
                        "name": "乌兰察布市",
                        "pid": "17",
                        "children": [
                            {
                                "id": "1419",
                                "name": "四子王旗",
                                "cid": "218"
                            },
                            {
                                "id": "1420",
                                "name": "察哈尔右翼后旗",
                                "cid": "218"
                            },
                            {
                                "id": "1421",
                                "name": "察哈尔右翼中旗",
                                "cid": "218"
                            },
                            {
                                "id": "1422",
                                "name": "化德县",
                                "cid": "218"
                            },
                            {
                                "id": "1423",
                                "name": "卓资县",
                                "cid": "218"
                            },
                            {
                                "id": "1424",
                                "name": "集宁区",
                                "cid": "218"
                            },
                            {
                                "id": "1425",
                                "name": "兴和县",
                                "cid": "218"
                            },
                            {
                                "id": "1426",
                                "name": "察哈尔右翼前旗",
                                "cid": "218"
                            },
                            {
                                "id": "1427",
                                "name": "商都县",
                                "cid": "218"
                            },
                            {
                                "id": "1428",
                                "name": "凉城县",
                                "cid": "218"
                            },
                            {
                                "id": "1429",
                                "name": "丰镇市",
                                "cid": "218"
                            }
                        ]
                    },
                    {
                        "id": "219",
                        "name": "巴彦淖尔市",
                        "pid": "17",
                        "children": [
                            {
                                "id": "1430",
                                "name": "乌拉特中旗",
                                "cid": "219"
                            },
                            {
                                "id": "1431",
                                "name": "乌拉特后旗",
                                "cid": "219"
                            },
                            {
                                "id": "1432",
                                "name": "五原县",
                                "cid": "219"
                            },
                            {
                                "id": "1433",
                                "name": "乌拉特前旗",
                                "cid": "219"
                            },
                            {
                                "id": "1434",
                                "name": "临河区",
                                "cid": "219"
                            },
                            {
                                "id": "1435",
                                "name": "杭锦后旗",
                                "cid": "219"
                            },
                            {
                                "id": "1436",
                                "name": "磴口县",
                                "cid": "219"
                            }
                        ]
                    },
                    {
                        "id": "220",
                        "name": "包头市",
                        "pid": "17",
                        "children": [
                            {
                                "id": "1437",
                                "name": "达尔罕茂明安联合旗",
                                "cid": "220"
                            },
                            {
                                "id": "1438",
                                "name": "白云鄂博矿区",
                                "cid": "220"
                            },
                            {
                                "id": "1439",
                                "name": "固阳县",
                                "cid": "220"
                            },
                            {
                                "id": "1440",
                                "name": "土默特右旗",
                                "cid": "220"
                            },
                            {
                                "id": "1441",
                                "name": "石拐区",
                                "cid": "220"
                            },
                            {
                                "id": "1442",
                                "name": "九原区",
                                "cid": "220"
                            },
                            {
                                "id": "1443",
                                "name": "东河区",
                                "cid": "220"
                            },
                            {
                                "id": "1444",
                                "name": "昆都仑区",
                                "cid": "220"
                            },
                            {
                                "id": "1445",
                                "name": "青山区",
                                "cid": "220"
                            }
                        ]
                    },
                    {
                        "id": "221",
                        "name": "阿拉善盟",
                        "pid": "17",
                        "children": [
                            {
                                "id": "1446",
                                "name": "阿拉善右旗",
                                "cid": "221"
                            },
                            {
                                "id": "1447",
                                "name": "额济纳旗",
                                "cid": "221"
                            },
                            {
                                "id": "1448",
                                "name": "阿拉善左旗",
                                "cid": "221"
                            }
                        ]
                    },
                    {
                        "id": "222",
                        "name": "鄂尔多斯市",
                        "pid": "17",
                        "children": [
                            {
                                "id": "1449",
                                "name": "达拉特旗",
                                "cid": "222"
                            },
                            {
                                "id": "1450",
                                "name": "鄂托克旗",
                                "cid": "222"
                            },
                            {
                                "id": "1451",
                                "name": "伊金霍洛旗",
                                "cid": "222"
                            },
                            {
                                "id": "1452",
                                "name": "东胜区",
                                "cid": "222"
                            },
                            {
                                "id": "1453",
                                "name": "鄂托克前旗",
                                "cid": "222"
                            },
                            {
                                "id": "1454",
                                "name": "杭锦旗",
                                "cid": "222"
                            },
                            {
                                "id": "1455",
                                "name": "准格尔旗",
                                "cid": "222"
                            },
                            {
                                "id": "1456",
                                "name": "乌审旗",
                                "cid": "222"
                            }
                        ]
                    },
                    {
                        "id": "223",
                        "name": "赤峰市",
                        "pid": "17",
                        "children": [
                            {
                                "id": "1457",
                                "name": "阿鲁科尔沁旗",
                                "cid": "223"
                            },
                            {
                                "id": "1458",
                                "name": "巴林左旗",
                                "cid": "223"
                            },
                            {
                                "id": "1459",
                                "name": "巴林右旗",
                                "cid": "223"
                            },
                            {
                                "id": "1460",
                                "name": "林西县",
                                "cid": "223"
                            },
                            {
                                "id": "1461",
                                "name": "克什克腾旗",
                                "cid": "223"
                            },
                            {
                                "id": "1462",
                                "name": "喀喇沁旗",
                                "cid": "223"
                            },
                            {
                                "id": "1463",
                                "name": "翁牛特旗",
                                "cid": "223"
                            },
                            {
                                "id": "1464",
                                "name": "敖汉旗",
                                "cid": "223"
                            },
                            {
                                "id": "1465",
                                "name": "宁城县",
                                "cid": "223"
                            },
                            {
                                "id": "1466",
                                "name": "松山区",
                                "cid": "223"
                            },
                            {
                                "id": "1467",
                                "name": "元宝山区",
                                "cid": "223"
                            },
                            {
                                "id": "1468",
                                "name": "红山区",
                                "cid": "223"
                            }
                        ]
                    },
                    {
                        "id": "224",
                        "name": "呼和浩特市",
                        "pid": "17",
                        "children": [
                            {
                                "id": "1469",
                                "name": "土默特左旗",
                                "cid": "224"
                            },
                            {
                                "id": "1470",
                                "name": "武川县",
                                "cid": "224"
                            },
                            {
                                "id": "1471",
                                "name": "托克托县",
                                "cid": "224"
                            },
                            {
                                "id": "1472",
                                "name": "清水河县",
                                "cid": "224"
                            },
                            {
                                "id": "1473",
                                "name": "和林格尔县",
                                "cid": "224"
                            },
                            {
                                "id": "1474",
                                "name": "赛罕区",
                                "cid": "224"
                            },
                            {
                                "id": "1475",
                                "name": "玉泉区",
                                "cid": "224"
                            },
                            {
                                "id": "1476",
                                "name": "新城区",
                                "cid": "224"
                            },
                            {
                                "id": "1477",
                                "name": "回民区",
                                "cid": "224"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "1",
                "name": "黑龙江省",
                "children": [
                    {
                        "id": "1",
                        "name": "大兴安岭地区",
                        "pid": "1",
                        "children": [
                            {
                                "id": "1",
                                "name": "塔河县",
                                "cid": "1"
                            },
                            {
                                "id": "2",
                                "name": "漠河县",
                                "cid": "1"
                            },
                            {
                                "id": "3",
                                "name": "呼玛县",
                                "cid": "1"
                            }
                        ]
                    },
                    {
                        "id": "2",
                        "name": "黑河市",
                        "pid": "1",
                        "children": [
                            {
                                "id": "4",
                                "name": "爱辉区",
                                "cid": "2"
                            },
                            {
                                "id": "5",
                                "name": "嫩江县",
                                "cid": "2"
                            },
                            {
                                "id": "6",
                                "name": "逊克县",
                                "cid": "2"
                            },
                            {
                                "id": "7",
                                "name": "孙吴县",
                                "cid": "2"
                            },
                            {
                                "id": "8",
                                "name": "五大连池市",
                                "cid": "2"
                            },
                            {
                                "id": "9",
                                "name": "北安市",
                                "cid": "2"
                            }
                        ]
                    },
                    {
                        "id": "3",
                        "name": "伊春市",
                        "pid": "1",
                        "children": [
                            {
                                "id": "10",
                                "name": "嘉荫县",
                                "cid": "3"
                            },
                            {
                                "id": "11",
                                "name": "铁力市",
                                "cid": "3"
                            },
                            {
                                "id": "12",
                                "name": "乌伊岭区",
                                "cid": "3"
                            },
                            {
                                "id": "13",
                                "name": "汤旺河区",
                                "cid": "3"
                            },
                            {
                                "id": "14",
                                "name": "新青区",
                                "cid": "3"
                            },
                            {
                                "id": "15",
                                "name": "红星区",
                                "cid": "3"
                            },
                            {
                                "id": "16",
                                "name": "美溪区",
                                "cid": "3"
                            },
                            {
                                "id": "17",
                                "name": "五营区",
                                "cid": "3"
                            },
                            {
                                "id": "18",
                                "name": "友好区",
                                "cid": "3"
                            },
                            {
                                "id": "19",
                                "name": "金山屯区",
                                "cid": "3"
                            },
                            {
                                "id": "20",
                                "name": "南岔区",
                                "cid": "3"
                            },
                            {
                                "id": "21",
                                "name": "乌马河区",
                                "cid": "3"
                            },
                            {
                                "id": "22",
                                "name": "翠峦区",
                                "cid": "3"
                            },
                            {
                                "id": "23",
                                "name": "上甘岭区",
                                "cid": "3"
                            },
                            {
                                "id": "24",
                                "name": "带岭区",
                                "cid": "3"
                            },
                            {
                                "id": "25",
                                "name": "西林区",
                                "cid": "3"
                            },
                            {
                                "id": "26",
                                "name": "伊春区",
                                "cid": "3"
                            }
                        ]
                    },
                    {
                        "id": "4",
                        "name": "齐齐哈尔市",
                        "pid": "1",
                        "children": [
                            {
                                "id": "27",
                                "name": "讷河市",
                                "cid": "4"
                            },
                            {
                                "id": "28",
                                "name": "克东县",
                                "cid": "4"
                            },
                            {
                                "id": "29",
                                "name": "克山县",
                                "cid": "4"
                            },
                            {
                                "id": "30",
                                "name": "依安县",
                                "cid": "4"
                            },
                            {
                                "id": "31",
                                "name": "富裕县",
                                "cid": "4"
                            },
                            {
                                "id": "32",
                                "name": "拜泉县",
                                "cid": "4"
                            },
                            {
                                "id": "33",
                                "name": "龙江县",
                                "cid": "4"
                            },
                            {
                                "id": "34",
                                "name": "甘南县",
                                "cid": "4"
                            },
                            {
                                "id": "35",
                                "name": "碾子山区",
                                "cid": "4"
                            },
                            {
                                "id": "36",
                                "name": "泰来县",
                                "cid": "4"
                            },
                            {
                                "id": "37",
                                "name": "昂昂溪区",
                                "cid": "4"
                            },
                            {
                                "id": "38",
                                "name": "铁锋区",
                                "cid": "4"
                            },
                            {
                                "id": "39",
                                "name": "龙沙区",
                                "cid": "4"
                            },
                            {
                                "id": "40",
                                "name": "梅里斯达斡尔族区",
                                "cid": "4"
                            },
                            {
                                "id": "41",
                                "name": "富拉尔基区",
                                "cid": "4"
                            },
                            {
                                "id": "42",
                                "name": "建华区",
                                "cid": "4"
                            }
                        ]
                    },
                    {
                        "id": "5",
                        "name": "佳木斯市",
                        "pid": "1",
                        "children": [
                            {
                                "id": "43",
                                "name": "同江市",
                                "cid": "5"
                            },
                            {
                                "id": "44",
                                "name": "富锦市",
                                "cid": "5"
                            },
                            {
                                "id": "45",
                                "name": "桦川县",
                                "cid": "5"
                            },
                            {
                                "id": "46",
                                "name": "汤原县",
                                "cid": "5"
                            },
                            {
                                "id": "47",
                                "name": "市辖区",
                                "cid": "5"
                            },
                            {
                                "id": "48",
                                "name": "桦南县",
                                "cid": "5"
                            },
                            {
                                "id": "49",
                                "name": "抚远县",
                                "cid": "5"
                            }
                        ]
                    },
                    {
                        "id": "6",
                        "name": "鹤岗市",
                        "pid": "1",
                        "children": [
                            {
                                "id": "50",
                                "name": "萝北县",
                                "cid": "6"
                            },
                            {
                                "id": "51",
                                "name": "绥滨县",
                                "cid": "6"
                            },
                            {
                                "id": "52",
                                "name": "东山区",
                                "cid": "6"
                            },
                            {
                                "id": "53",
                                "name": "兴山区",
                                "cid": "6"
                            },
                            {
                                "id": "54",
                                "name": "向阳区",
                                "cid": "6"
                            },
                            {
                                "id": "55",
                                "name": "工农区",
                                "cid": "6"
                            },
                            {
                                "id": "56",
                                "name": "南山区",
                                "cid": "6"
                            },
                            {
                                "id": "57",
                                "name": "兴安区",
                                "cid": "6"
                            }
                        ]
                    },
                    {
                        "id": "7",
                        "name": "绥化市",
                        "pid": "1",
                        "children": [
                            {
                                "id": "58",
                                "name": "庆安县",
                                "cid": "7"
                            },
                            {
                                "id": "59",
                                "name": "绥棱县",
                                "cid": "7"
                            },
                            {
                                "id": "60",
                                "name": "海伦市",
                                "cid": "7"
                            },
                            {
                                "id": "61",
                                "name": "明水县",
                                "cid": "7"
                            },
                            {
                                "id": "62",
                                "name": "北林区",
                                "cid": "7"
                            },
                            {
                                "id": "63",
                                "name": "望奎县",
                                "cid": "7"
                            },
                            {
                                "id": "64",
                                "name": "兰西县",
                                "cid": "7"
                            },
                            {
                                "id": "65",
                                "name": "青冈县",
                                "cid": "7"
                            },
                            {
                                "id": "66",
                                "name": "安达市",
                                "cid": "7"
                            },
                            {
                                "id": "67",
                                "name": "肇东市",
                                "cid": "7"
                            }
                        ]
                    },
                    {
                        "id": "8",
                        "name": "双鸭山市",
                        "pid": "1",
                        "children": [
                            {
                                "id": "68",
                                "name": "饶河县",
                                "cid": "8"
                            },
                            {
                                "id": "69",
                                "name": "宝清县",
                                "cid": "8"
                            },
                            {
                                "id": "70",
                                "name": "集贤县",
                                "cid": "8"
                            },
                            {
                                "id": "71",
                                "name": "友谊县",
                                "cid": "8"
                            },
                            {
                                "id": "72",
                                "name": "四方台区",
                                "cid": "8"
                            },
                            {
                                "id": "73",
                                "name": "尖山区",
                                "cid": "8"
                            },
                            {
                                "id": "74",
                                "name": "岭东区",
                                "cid": "8"
                            },
                            {
                                "id": "75",
                                "name": "宝山区",
                                "cid": "8"
                            }
                        ]
                    },
                    {
                        "id": "9",
                        "name": "鸡西市",
                        "pid": "1",
                        "children": [
                            {
                                "id": "76",
                                "name": "虎林市",
                                "cid": "9"
                            },
                            {
                                "id": "77",
                                "name": "密山市",
                                "cid": "9"
                            },
                            {
                                "id": "78",
                                "name": "鸡东县",
                                "cid": "9"
                            },
                            {
                                "id": "79",
                                "name": "滴道区",
                                "cid": "9"
                            },
                            {
                                "id": "80",
                                "name": "城子河区",
                                "cid": "9"
                            },
                            {
                                "id": "81",
                                "name": "鸡冠区",
                                "cid": "9"
                            },
                            {
                                "id": "82",
                                "name": "恒山区",
                                "cid": "9"
                            },
                            {
                                "id": "83",
                                "name": "麻山区",
                                "cid": "9"
                            },
                            {
                                "id": "84",
                                "name": "梨树区",
                                "cid": "9"
                            }
                        ]
                    },
                    {
                        "id": "10",
                        "name": "七台河市",
                        "pid": "1",
                        "children": [
                            {
                                "id": "85",
                                "name": "勃利县",
                                "cid": "10"
                            },
                            {
                                "id": "86",
                                "name": "茄子河区",
                                "cid": "10"
                            },
                            {
                                "id": "87",
                                "name": "桃山区",
                                "cid": "10"
                            },
                            {
                                "id": "88",
                                "name": "新兴区",
                                "cid": "10"
                            }
                        ]
                    },
                    {
                        "id": "11",
                        "name": "哈尔滨市",
                        "pid": "1",
                        "children": [
                            {
                                "id": "89",
                                "name": "依兰县",
                                "cid": "11"
                            },
                            {
                                "id": "90",
                                "name": "通河县",
                                "cid": "11"
                            },
                            {
                                "id": "91",
                                "name": "木兰县",
                                "cid": "11"
                            },
                            {
                                "id": "92",
                                "name": "巴彦县",
                                "cid": "11"
                            },
                            {
                                "id": "93",
                                "name": "市辖区",
                                "cid": "11"
                            },
                            {
                                "id": "94",
                                "name": "方正县",
                                "cid": "11"
                            },
                            {
                                "id": "95",
                                "name": "宾县",
                                "cid": "11"
                            },
                            {
                                "id": "96",
                                "name": "延寿县",
                                "cid": "11"
                            },
                            {
                                "id": "97",
                                "name": "双城市",
                                "cid": "11"
                            },
                            {
                                "id": "98",
                                "name": "尚志市",
                                "cid": "11"
                            },
                            {
                                "id": "99",
                                "name": "五常市",
                                "cid": "11"
                            }
                        ]
                    },
                    {
                        "id": "12",
                        "name": "牡丹江市",
                        "pid": "1",
                        "children": [
                            {
                                "id": "100",
                                "name": "林口县",
                                "cid": "12"
                            },
                            {
                                "id": "101",
                                "name": "绥芬河市",
                                "cid": "12"
                            },
                            {
                                "id": "102",
                                "name": "穆棱市",
                                "cid": "12"
                            },
                            {
                                "id": "103",
                                "name": "东宁县",
                                "cid": "12"
                            },
                            {
                                "id": "104",
                                "name": "海林市",
                                "cid": "12"
                            },
                            {
                                "id": "105",
                                "name": "宁安市",
                                "cid": "12"
                            },
                            {
                                "id": "106",
                                "name": "阳明区",
                                "cid": "12"
                            },
                            {
                                "id": "107",
                                "name": "东安区",
                                "cid": "12"
                            },
                            {
                                "id": "108",
                                "name": "西安区",
                                "cid": "12"
                            },
                            {
                                "id": "109",
                                "name": "爱民区",
                                "cid": "12"
                            }
                        ]
                    },
                    {
                        "id": "13",
                        "name": "大庆市",
                        "pid": "1",
                        "children": [
                            {
                                "id": "110",
                                "name": "林甸县",
                                "cid": "13"
                            },
                            {
                                "id": "111",
                                "name": "肇州县",
                                "cid": "13"
                            },
                            {
                                "id": "112",
                                "name": "杜尔伯特蒙古族自治县",
                                "cid": "13"
                            },
                            {
                                "id": "113",
                                "name": "肇源县",
                                "cid": "13"
                            },
                            {
                                "id": "114",
                                "name": "红岗区",
                                "cid": "13"
                            },
                            {
                                "id": "115",
                                "name": "让胡路区",
                                "cid": "13"
                            },
                            {
                                "id": "116",
                                "name": "萨尔图区",
                                "cid": "13"
                            },
                            {
                                "id": "117",
                                "name": "龙凤区",
                                "cid": "13"
                            },
                            {
                                "id": "118",
                                "name": "大同区",
                                "cid": "13"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "13",
                "name": "江苏省",
                "children": [
                    {
                        "id": "160",
                        "name": "镇江市",
                        "pid": "13",
                        "children": [
                            {
                                "id": "1145",
                                "name": "句容市",
                                "cid": "160"
                            },
                            {
                                "id": "1146",
                                "name": "丹阳市",
                                "cid": "160"
                            },
                            {
                                "id": "1147",
                                "name": "丹徒区",
                                "cid": "160"
                            },
                            {
                                "id": "1148",
                                "name": "润州区",
                                "cid": "160"
                            },
                            {
                                "id": "1149",
                                "name": "京口区",
                                "cid": "160"
                            },
                            {
                                "id": "1150",
                                "name": "扬中市",
                                "cid": "160"
                            }
                        ]
                    },
                    {
                        "id": "161",
                        "name": "南通市",
                        "pid": "13",
                        "children": [
                            {
                                "id": "1151",
                                "name": "如东县",
                                "cid": "161"
                            },
                            {
                                "id": "1152",
                                "name": "港闸区",
                                "cid": "161"
                            },
                            {
                                "id": "1153",
                                "name": "启东市",
                                "cid": "161"
                            },
                            {
                                "id": "1154",
                                "name": "海安县",
                                "cid": "161"
                            },
                            {
                                "id": "1155",
                                "name": "如皋市",
                                "cid": "161"
                            },
                            {
                                "id": "1156",
                                "name": "海门市",
                                "cid": "161"
                            },
                            {
                                "id": "1157",
                                "name": "崇川区",
                                "cid": "161"
                            },
                            {
                                "id": "1158",
                                "name": "通州区",
                                "cid": "161"
                            }
                        ]
                    },
                    {
                        "id": "162",
                        "name": "淮安市",
                        "pid": "13",
                        "children": [
                            {
                                "id": "1159",
                                "name": "楚州区",
                                "cid": "162"
                            },
                            {
                                "id": "1160",
                                "name": "清河区",
                                "cid": "162"
                            },
                            {
                                "id": "1161",
                                "name": "盱眙县",
                                "cid": "162"
                            },
                            {
                                "id": "1162",
                                "name": "淮阴区",
                                "cid": "162"
                            },
                            {
                                "id": "1163",
                                "name": "涟水县",
                                "cid": "162"
                            },
                            {
                                "id": "1164",
                                "name": "洪泽县",
                                "cid": "162"
                            },
                            {
                                "id": "1165",
                                "name": "金湖县",
                                "cid": "162"
                            },
                            {
                                "id": "1166",
                                "name": "清浦区",
                                "cid": "162"
                            }
                        ]
                    },
                    {
                        "id": "163",
                        "name": "盐城市",
                        "pid": "13",
                        "children": [
                            {
                                "id": "1167",
                                "name": "滨海县",
                                "cid": "163"
                            },
                            {
                                "id": "1168",
                                "name": "东台市",
                                "cid": "163"
                            },
                            {
                                "id": "1169",
                                "name": "阜宁县",
                                "cid": "163"
                            },
                            {
                                "id": "1170",
                                "name": "大丰市",
                                "cid": "163"
                            },
                            {
                                "id": "1171",
                                "name": "建湖县",
                                "cid": "163"
                            },
                            {
                                "id": "1172",
                                "name": "射阳县",
                                "cid": "163"
                            },
                            {
                                "id": "1173",
                                "name": "响水县",
                                "cid": "163"
                            },
                            {
                                "id": "1174",
                                "name": "亭湖区",
                                "cid": "163"
                            },
                            {
                                "id": "1175",
                                "name": "盐都区",
                                "cid": "163"
                            }
                        ]
                    },
                    {
                        "id": "164",
                        "name": "苏州市",
                        "pid": "13",
                        "children": [
                            {
                                "id": "1176",
                                "name": "相城区",
                                "cid": "164"
                            },
                            {
                                "id": "1177",
                                "name": "沧浪区",
                                "cid": "164"
                            },
                            {
                                "id": "1178",
                                "name": "虎丘区",
                                "cid": "164"
                            },
                            {
                                "id": "1179",
                                "name": "平江区",
                                "cid": "164"
                            },
                            {
                                "id": "1180",
                                "name": "太仓市",
                                "cid": "164"
                            },
                            {
                                "id": "1181",
                                "name": "常熟市",
                                "cid": "164"
                            },
                            {
                                "id": "1182",
                                "name": "金阊区",
                                "cid": "164"
                            },
                            {
                                "id": "1183",
                                "name": "吴江市",
                                "cid": "164"
                            },
                            {
                                "id": "1184",
                                "name": "昆山市",
                                "cid": "164"
                            },
                            {
                                "id": "1185",
                                "name": "张家港市",
                                "cid": "164"
                            },
                            {
                                "id": "1186",
                                "name": "吴中区",
                                "cid": "164"
                            }
                        ]
                    },
                    {
                        "id": "165",
                        "name": "泰州市",
                        "pid": "13",
                        "children": [
                            {
                                "id": "1187",
                                "name": "兴化市",
                                "cid": "165"
                            },
                            {
                                "id": "1188",
                                "name": "靖江市",
                                "cid": "165"
                            },
                            {
                                "id": "1189",
                                "name": "海陵区",
                                "cid": "165"
                            },
                            {
                                "id": "1190",
                                "name": "高港区",
                                "cid": "165"
                            },
                            {
                                "id": "1191",
                                "name": "姜堰市",
                                "cid": "165"
                            },
                            {
                                "id": "1192",
                                "name": "泰兴市",
                                "cid": "165"
                            }
                        ]
                    },
                    {
                        "id": "166",
                        "name": "宿迁市",
                        "pid": "13",
                        "children": [
                            {
                                "id": "1193",
                                "name": "泗洪县",
                                "cid": "166"
                            },
                            {
                                "id": "1194",
                                "name": "沭阳县",
                                "cid": "166"
                            },
                            {
                                "id": "1195",
                                "name": "泗阳县",
                                "cid": "166"
                            },
                            {
                                "id": "1196",
                                "name": "宿豫区",
                                "cid": "166"
                            },
                            {
                                "id": "1197",
                                "name": "宿城区",
                                "cid": "166"
                            }
                        ]
                    },
                    {
                        "id": "167",
                        "name": "南京市",
                        "pid": "13",
                        "children": [
                            {
                                "id": "1198",
                                "name": "高淳县",
                                "cid": "167"
                            },
                            {
                                "id": "1199",
                                "name": "浦口区",
                                "cid": "167"
                            },
                            {
                                "id": "1200",
                                "name": "玄武区",
                                "cid": "167"
                            },
                            {
                                "id": "1201",
                                "name": "六合区",
                                "cid": "167"
                            },
                            {
                                "id": "1202",
                                "name": "雨花台区",
                                "cid": "167"
                            },
                            {
                                "id": "1203",
                                "name": "下关区",
                                "cid": "167"
                            },
                            {
                                "id": "1204",
                                "name": "溧水县",
                                "cid": "167"
                            },
                            {
                                "id": "1205",
                                "name": "建邺区",
                                "cid": "167"
                            },
                            {
                                "id": "1206",
                                "name": "秦淮区",
                                "cid": "167"
                            },
                            {
                                "id": "1207",
                                "name": "鼓楼区",
                                "cid": "167"
                            },
                            {
                                "id": "1208",
                                "name": "栖霞区",
                                "cid": "167"
                            },
                            {
                                "id": "1209",
                                "name": "白下区",
                                "cid": "167"
                            },
                            {
                                "id": "1210",
                                "name": "江宁区",
                                "cid": "167"
                            }
                        ]
                    },
                    {
                        "id": "168",
                        "name": "徐州市",
                        "pid": "13",
                        "children": [
                            {
                                "id": "1211",
                                "name": "邳州市",
                                "cid": "168"
                            },
                            {
                                "id": "1212",
                                "name": "丰县",
                                "cid": "168"
                            },
                            {
                                "id": "1213",
                                "name": "九里区",
                                "cid": "168"
                            },
                            {
                                "id": "1214",
                                "name": "睢宁县",
                                "cid": "168"
                            },
                            {
                                "id": "1215",
                                "name": "沛县",
                                "cid": "168"
                            },
                            {
                                "id": "1216",
                                "name": "贾汪区",
                                "cid": "168"
                            },
                            {
                                "id": "1217",
                                "name": "泉山区",
                                "cid": "168"
                            },
                            {
                                "id": "1218",
                                "name": "铜山县",
                                "cid": "168"
                            },
                            {
                                "id": "1219",
                                "name": "新沂市",
                                "cid": "168"
                            },
                            {
                                "id": "1220",
                                "name": "鼓楼区",
                                "cid": "168"
                            },
                            {
                                "id": "1221",
                                "name": "云龙区",
                                "cid": "168"
                            }
                        ]
                    },
                    {
                        "id": "169",
                        "name": "无锡市",
                        "pid": "13",
                        "children": [
                            {
                                "id": "1222",
                                "name": "宜兴市",
                                "cid": "169"
                            },
                            {
                                "id": "1223",
                                "name": "北塘区",
                                "cid": "169"
                            },
                            {
                                "id": "1224",
                                "name": "锡山区",
                                "cid": "169"
                            },
                            {
                                "id": "1225",
                                "name": "滨湖区",
                                "cid": "169"
                            },
                            {
                                "id": "1226",
                                "name": "崇安区",
                                "cid": "169"
                            },
                            {
                                "id": "1227",
                                "name": "南长区",
                                "cid": "169"
                            },
                            {
                                "id": "1228",
                                "name": "江阴市",
                                "cid": "169"
                            },
                            {
                                "id": "1229",
                                "name": "惠山区",
                                "cid": "169"
                            }
                        ]
                    },
                    {
                        "id": "170",
                        "name": "扬州市",
                        "pid": "13",
                        "children": [
                            {
                                "id": "1230",
                                "name": "维扬区",
                                "cid": "170"
                            },
                            {
                                "id": "1231",
                                "name": "宝应县",
                                "cid": "170"
                            },
                            {
                                "id": "1232",
                                "name": "江都市",
                                "cid": "170"
                            },
                            {
                                "id": "1233",
                                "name": "高邮市",
                                "cid": "170"
                            },
                            {
                                "id": "1234",
                                "name": "广陵区",
                                "cid": "170"
                            },
                            {
                                "id": "1235",
                                "name": "仪征市",
                                "cid": "170"
                            },
                            {
                                "id": "1236",
                                "name": "邗江区",
                                "cid": "170"
                            }
                        ]
                    },
                    {
                        "id": "171",
                        "name": "连云港市",
                        "pid": "13",
                        "children": [
                            {
                                "id": "1237",
                                "name": "连云区",
                                "cid": "171"
                            },
                            {
                                "id": "1238",
                                "name": "海州区",
                                "cid": "171"
                            },
                            {
                                "id": "1239",
                                "name": "灌南县",
                                "cid": "171"
                            },
                            {
                                "id": "1240",
                                "name": "赣榆县",
                                "cid": "171"
                            },
                            {
                                "id": "1241",
                                "name": "灌云县",
                                "cid": "171"
                            },
                            {
                                "id": "1242",
                                "name": "新浦区",
                                "cid": "171"
                            },
                            {
                                "id": "1243",
                                "name": "东海县",
                                "cid": "171"
                            }
                        ]
                    },
                    {
                        "id": "172",
                        "name": "常州市",
                        "pid": "13",
                        "children": [
                            {
                                "id": "1244",
                                "name": "戚墅堰区",
                                "cid": "172"
                            },
                            {
                                "id": "1245",
                                "name": "溧阳市",
                                "cid": "172"
                            },
                            {
                                "id": "1246",
                                "name": "钟楼区",
                                "cid": "172"
                            },
                            {
                                "id": "1247",
                                "name": "金坛市",
                                "cid": "172"
                            },
                            {
                                "id": "1248",
                                "name": "新北区",
                                "cid": "172"
                            },
                            {
                                "id": "1249",
                                "name": "武进区",
                                "cid": "172"
                            },
                            {
                                "id": "1250",
                                "name": "天宁区",
                                "cid": "172"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "21",
                "name": "湖南省",
                "children": [
                    {
                        "id": "262",
                        "name": "长沙市",
                        "pid": "21",
                        "children": [
                            {
                                "id": "1843",
                                "name": "宁乡县",
                                "cid": "262"
                            },
                            {
                                "id": "1844",
                                "name": "长沙县",
                                "cid": "262"
                            },
                            {
                                "id": "1845",
                                "name": "望城县",
                                "cid": "262"
                            },
                            {
                                "id": "1846",
                                "name": "浏阳市",
                                "cid": "262"
                            },
                            {
                                "id": "1847",
                                "name": "开福区",
                                "cid": "262"
                            },
                            {
                                "id": "1848",
                                "name": "芙蓉区",
                                "cid": "262"
                            },
                            {
                                "id": "1849",
                                "name": "岳麓区",
                                "cid": "262"
                            },
                            {
                                "id": "1850",
                                "name": "雨花区",
                                "cid": "262"
                            },
                            {
                                "id": "1851",
                                "name": "天心区",
                                "cid": "262"
                            }
                        ]
                    },
                    {
                        "id": "263",
                        "name": "衡阳市",
                        "pid": "21",
                        "children": [
                            {
                                "id": "1852",
                                "name": "衡山县",
                                "cid": "263"
                            },
                            {
                                "id": "1853",
                                "name": "耒阳市",
                                "cid": "263"
                            },
                            {
                                "id": "1854",
                                "name": "衡南县",
                                "cid": "263"
                            },
                            {
                                "id": "1855",
                                "name": "南岳区",
                                "cid": "263"
                            },
                            {
                                "id": "1856",
                                "name": "衡东县",
                                "cid": "263"
                            },
                            {
                                "id": "1857",
                                "name": "常宁市",
                                "cid": "263"
                            },
                            {
                                "id": "1858",
                                "name": "祁东县",
                                "cid": "263"
                            },
                            {
                                "id": "1859",
                                "name": "衡阳县",
                                "cid": "263"
                            },
                            {
                                "id": "1860",
                                "name": "石鼓区",
                                "cid": "263"
                            },
                            {
                                "id": "1861",
                                "name": "蒸湘区",
                                "cid": "263"
                            },
                            {
                                "id": "1862",
                                "name": "珠晖区",
                                "cid": "263"
                            },
                            {
                                "id": "1863",
                                "name": "雁峰区",
                                "cid": "263"
                            }
                        ]
                    },
                    {
                        "id": "264",
                        "name": "常德市",
                        "pid": "21",
                        "children": [
                            {
                                "id": "1864",
                                "name": "石门县",
                                "cid": "264"
                            },
                            {
                                "id": "1865",
                                "name": "津市市",
                                "cid": "264"
                            },
                            {
                                "id": "1866",
                                "name": "汉寿县",
                                "cid": "264"
                            },
                            {
                                "id": "1867",
                                "name": "澧县",
                                "cid": "264"
                            },
                            {
                                "id": "1868",
                                "name": "临澧县",
                                "cid": "264"
                            },
                            {
                                "id": "1869",
                                "name": "安乡县",
                                "cid": "264"
                            },
                            {
                                "id": "1870",
                                "name": "桃源县",
                                "cid": "264"
                            },
                            {
                                "id": "1871",
                                "name": "武陵区",
                                "cid": "264"
                            },
                            {
                                "id": "1872",
                                "name": "鼎城区",
                                "cid": "264"
                            }
                        ]
                    },
                    {
                        "id": "265",
                        "name": "岳阳市",
                        "pid": "21",
                        "children": [
                            {
                                "id": "1873",
                                "name": "平江县",
                                "cid": "265"
                            },
                            {
                                "id": "1874",
                                "name": "湘阴县",
                                "cid": "265"
                            },
                            {
                                "id": "1875",
                                "name": "岳阳县",
                                "cid": "265"
                            },
                            {
                                "id": "1876",
                                "name": "华容县",
                                "cid": "265"
                            },
                            {
                                "id": "1877",
                                "name": "汨罗市",
                                "cid": "265"
                            },
                            {
                                "id": "1878",
                                "name": "临湘市",
                                "cid": "265"
                            },
                            {
                                "id": "1879",
                                "name": "云溪区",
                                "cid": "265"
                            },
                            {
                                "id": "1880",
                                "name": "君山区",
                                "cid": "265"
                            },
                            {
                                "id": "1881",
                                "name": "岳阳楼区",
                                "cid": "265"
                            }
                        ]
                    },
                    {
                        "id": "266",
                        "name": "娄底市",
                        "pid": "21",
                        "children": [
                            {
                                "id": "1882",
                                "name": "冷水江市",
                                "cid": "266"
                            },
                            {
                                "id": "1883",
                                "name": "双峰县",
                                "cid": "266"
                            },
                            {
                                "id": "1884",
                                "name": "涟源市",
                                "cid": "266"
                            },
                            {
                                "id": "1885",
                                "name": "新化县",
                                "cid": "266"
                            },
                            {
                                "id": "1886",
                                "name": "娄星区",
                                "cid": "266"
                            }
                        ]
                    },
                    {
                        "id": "267",
                        "name": "株洲市",
                        "pid": "21",
                        "children": [
                            {
                                "id": "1887",
                                "name": "攸县",
                                "cid": "267"
                            },
                            {
                                "id": "1888",
                                "name": "炎陵县",
                                "cid": "267"
                            },
                            {
                                "id": "1889",
                                "name": "株洲县",
                                "cid": "267"
                            },
                            {
                                "id": "1890",
                                "name": "茶陵县",
                                "cid": "267"
                            },
                            {
                                "id": "1891",
                                "name": "醴陵市",
                                "cid": "267"
                            },
                            {
                                "id": "1892",
                                "name": "石峰区",
                                "cid": "267"
                            },
                            {
                                "id": "1893",
                                "name": "荷塘区",
                                "cid": "267"
                            },
                            {
                                "id": "1894",
                                "name": "天元区",
                                "cid": "267"
                            },
                            {
                                "id": "1895",
                                "name": "芦淞区",
                                "cid": "267"
                            }
                        ]
                    },
                    {
                        "id": "268",
                        "name": "益阳市",
                        "pid": "21",
                        "children": [
                            {
                                "id": "1896",
                                "name": "安化县",
                                "cid": "268"
                            },
                            {
                                "id": "1897",
                                "name": "桃江县",
                                "cid": "268"
                            },
                            {
                                "id": "1898",
                                "name": "南县",
                                "cid": "268"
                            },
                            {
                                "id": "1899",
                                "name": "沅江市",
                                "cid": "268"
                            },
                            {
                                "id": "1900",
                                "name": "资阳区",
                                "cid": "268"
                            },
                            {
                                "id": "1901",
                                "name": "赫山区",
                                "cid": "268"
                            }
                        ]
                    },
                    {
                        "id": "269",
                        "name": "邵阳市",
                        "pid": "21",
                        "children": [
                            {
                                "id": "1902",
                                "name": "邵东县",
                                "cid": "269"
                            },
                            {
                                "id": "1903",
                                "name": "城步苗族自治县",
                                "cid": "269"
                            },
                            {
                                "id": "1904",
                                "name": "隆回县",
                                "cid": "269"
                            },
                            {
                                "id": "1905",
                                "name": "武冈市",
                                "cid": "269"
                            },
                            {
                                "id": "1906",
                                "name": "新邵县",
                                "cid": "269"
                            },
                            {
                                "id": "1907",
                                "name": "邵阳县",
                                "cid": "269"
                            },
                            {
                                "id": "1908",
                                "name": "绥宁县",
                                "cid": "269"
                            },
                            {
                                "id": "1909",
                                "name": "洞口县",
                                "cid": "269"
                            },
                            {
                                "id": "1910",
                                "name": "新宁县",
                                "cid": "269"
                            },
                            {
                                "id": "1911",
                                "name": "北塔区",
                                "cid": "269"
                            },
                            {
                                "id": "1912",
                                "name": "双清区",
                                "cid": "269"
                            },
                            {
                                "id": "1913",
                                "name": "大祥区",
                                "cid": "269"
                            }
                        ]
                    },
                    {
                        "id": "270",
                        "name": "湘西土家族苗族自治州",
                        "pid": "21",
                        "children": [
                            {
                                "id": "1914",
                                "name": "吉首市",
                                "cid": "270"
                            },
                            {
                                "id": "1915",
                                "name": "凤凰县",
                                "cid": "270"
                            },
                            {
                                "id": "1916",
                                "name": "古丈县",
                                "cid": "270"
                            },
                            {
                                "id": "1917",
                                "name": "泸溪县",
                                "cid": "270"
                            },
                            {
                                "id": "1918",
                                "name": "永顺县",
                                "cid": "270"
                            },
                            {
                                "id": "1919",
                                "name": "花垣县",
                                "cid": "270"
                            },
                            {
                                "id": "1920",
                                "name": "龙山县",
                                "cid": "270"
                            },
                            {
                                "id": "1921",
                                "name": "保靖县",
                                "cid": "270"
                            }
                        ]
                    },
                    {
                        "id": "271",
                        "name": "郴州市",
                        "pid": "21",
                        "children": [
                            {
                                "id": "1922",
                                "name": "嘉禾县",
                                "cid": "271"
                            },
                            {
                                "id": "1923",
                                "name": "永兴县",
                                "cid": "271"
                            },
                            {
                                "id": "1924",
                                "name": "桂东县",
                                "cid": "271"
                            },
                            {
                                "id": "1925",
                                "name": "临武县",
                                "cid": "271"
                            },
                            {
                                "id": "1926",
                                "name": "安仁县",
                                "cid": "271"
                            },
                            {
                                "id": "1927",
                                "name": "桂阳县",
                                "cid": "271"
                            },
                            {
                                "id": "1928",
                                "name": "汝城县",
                                "cid": "271"
                            },
                            {
                                "id": "1929",
                                "name": "宜章县",
                                "cid": "271"
                            },
                            {
                                "id": "1930",
                                "name": "资兴市",
                                "cid": "271"
                            },
                            {
                                "id": "1931",
                                "name": "苏仙区",
                                "cid": "271"
                            },
                            {
                                "id": "1932",
                                "name": "北湖区",
                                "cid": "271"
                            }
                        ]
                    },
                    {
                        "id": "272",
                        "name": "张家界市",
                        "pid": "21",
                        "children": [
                            {
                                "id": "1933",
                                "name": "慈利县",
                                "cid": "272"
                            },
                            {
                                "id": "1934",
                                "name": "桑植县",
                                "cid": "272"
                            },
                            {
                                "id": "1935",
                                "name": "武陵源区",
                                "cid": "272"
                            },
                            {
                                "id": "1936",
                                "name": "永定区",
                                "cid": "272"
                            }
                        ]
                    },
                    {
                        "id": "273",
                        "name": "湘潭市",
                        "pid": "21",
                        "children": [
                            {
                                "id": "1937",
                                "name": "韶山市",
                                "cid": "273"
                            },
                            {
                                "id": "1938",
                                "name": "湘潭县",
                                "cid": "273"
                            },
                            {
                                "id": "1939",
                                "name": "湘乡市",
                                "cid": "273"
                            },
                            {
                                "id": "1940",
                                "name": "岳塘区",
                                "cid": "273"
                            },
                            {
                                "id": "1941",
                                "name": "雨湖区",
                                "cid": "273"
                            }
                        ]
                    },
                    {
                        "id": "274",
                        "name": "永州市",
                        "pid": "21",
                        "children": [
                            {
                                "id": "1942",
                                "name": "祁阳县",
                                "cid": "274"
                            },
                            {
                                "id": "1943",
                                "name": "东安县",
                                "cid": "274"
                            },
                            {
                                "id": "1944",
                                "name": "道县",
                                "cid": "274"
                            },
                            {
                                "id": "1945",
                                "name": "新田县",
                                "cid": "274"
                            },
                            {
                                "id": "1946",
                                "name": "江永县",
                                "cid": "274"
                            },
                            {
                                "id": "1947",
                                "name": "双牌县",
                                "cid": "274"
                            },
                            {
                                "id": "1948",
                                "name": "江华瑶族自治县",
                                "cid": "274"
                            },
                            {
                                "id": "1949",
                                "name": "蓝山县",
                                "cid": "274"
                            },
                            {
                                "id": "1950",
                                "name": "宁远县",
                                "cid": "274"
                            },
                            {
                                "id": "1951",
                                "name": "冷水滩区",
                                "cid": "274"
                            },
                            {
                                "id": "1952",
                                "name": "零陵区",
                                "cid": "274"
                            }
                        ]
                    },
                    {
                        "id": "275",
                        "name": "怀化市",
                        "pid": "21",
                        "children": [
                            {
                                "id": "1953",
                                "name": "沅陵县",
                                "cid": "275"
                            },
                            {
                                "id": "1954",
                                "name": "麻阳苗族自治县",
                                "cid": "275"
                            },
                            {
                                "id": "1955",
                                "name": "洪江市",
                                "cid": "275"
                            },
                            {
                                "id": "1956",
                                "name": "靖州苗族侗族自治县",
                                "cid": "275"
                            },
                            {
                                "id": "1957",
                                "name": "芷江侗族自治县",
                                "cid": "275"
                            },
                            {
                                "id": "1958",
                                "name": "通道侗族自治县",
                                "cid": "275"
                            },
                            {
                                "id": "1959",
                                "name": "溆浦县",
                                "cid": "275"
                            },
                            {
                                "id": "1960",
                                "name": "会同县",
                                "cid": "275"
                            },
                            {
                                "id": "1961",
                                "name": "鹤城区",
                                "cid": "275"
                            },
                            {
                                "id": "1962",
                                "name": "中方县",
                                "cid": "275"
                            },
                            {
                                "id": "1963",
                                "name": "辰溪县",
                                "cid": "275"
                            },
                            {
                                "id": "1964",
                                "name": "新晃侗族自治县",
                                "cid": "275"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "14",
                "name": "辽宁省",
                "children": [
                    {
                        "id": "173",
                        "name": "沈阳市",
                        "pid": "14",
                        "children": [
                            {
                                "id": "1251",
                                "name": "康平县",
                                "cid": "173"
                            },
                            {
                                "id": "1252",
                                "name": "沈北新区",
                                "cid": "173"
                            },
                            {
                                "id": "1253",
                                "name": "新民市",
                                "cid": "173"
                            },
                            {
                                "id": "1254",
                                "name": "于洪区",
                                "cid": "173"
                            },
                            {
                                "id": "1255",
                                "name": "法库县",
                                "cid": "173"
                            },
                            {
                                "id": "1256",
                                "name": "东陵区",
                                "cid": "173"
                            },
                            {
                                "id": "1257",
                                "name": "铁西区",
                                "cid": "173"
                            },
                            {
                                "id": "1258",
                                "name": "皇姑区",
                                "cid": "173"
                            },
                            {
                                "id": "1259",
                                "name": "和平区",
                                "cid": "173"
                            },
                            {
                                "id": "1260",
                                "name": "沈河区",
                                "cid": "173"
                            },
                            {
                                "id": "1261",
                                "name": "大东区",
                                "cid": "173"
                            },
                            {
                                "id": "1262",
                                "name": "辽中县",
                                "cid": "173"
                            },
                            {
                                "id": "1263",
                                "name": "苏家屯区",
                                "cid": "173"
                            }
                        ]
                    },
                    {
                        "id": "174",
                        "name": "阜新市",
                        "pid": "14",
                        "children": [
                            {
                                "id": "1264",
                                "name": "彰武县",
                                "cid": "174"
                            },
                            {
                                "id": "1265",
                                "name": "阜新蒙古族自治县",
                                "cid": "174"
                            },
                            {
                                "id": "1266",
                                "name": "清河门区",
                                "cid": "174"
                            },
                            {
                                "id": "1267",
                                "name": "海州区",
                                "cid": "174"
                            },
                            {
                                "id": "1268",
                                "name": "细河区",
                                "cid": "174"
                            },
                            {
                                "id": "1269",
                                "name": "太平区",
                                "cid": "174"
                            },
                            {
                                "id": "1270",
                                "name": "新邱区",
                                "cid": "174"
                            }
                        ]
                    },
                    {
                        "id": "175",
                        "name": "铁岭市",
                        "pid": "14",
                        "children": [
                            {
                                "id": "1271",
                                "name": "铁岭县",
                                "cid": "175"
                            },
                            {
                                "id": "1272",
                                "name": "清河区",
                                "cid": "175"
                            },
                            {
                                "id": "1273",
                                "name": "调兵山市",
                                "cid": "175"
                            },
                            {
                                "id": "1274",
                                "name": "昌图县",
                                "cid": "175"
                            },
                            {
                                "id": "1275",
                                "name": "西丰县",
                                "cid": "175"
                            },
                            {
                                "id": "1276",
                                "name": "开原市",
                                "cid": "175"
                            },
                            {
                                "id": "1277",
                                "name": "银州区",
                                "cid": "175"
                            }
                        ]
                    },
                    {
                        "id": "176",
                        "name": "锦州市",
                        "pid": "14",
                        "children": [
                            {
                                "id": "1278",
                                "name": "义县",
                                "cid": "176"
                            },
                            {
                                "id": "1279",
                                "name": "黑山县",
                                "cid": "176"
                            },
                            {
                                "id": "1280",
                                "name": "凌海市",
                                "cid": "176"
                            },
                            {
                                "id": "1281",
                                "name": "北镇市",
                                "cid": "176"
                            },
                            {
                                "id": "1282",
                                "name": "太和区",
                                "cid": "176"
                            },
                            {
                                "id": "1283",
                                "name": "古塔区",
                                "cid": "176"
                            },
                            {
                                "id": "1284",
                                "name": "凌河区",
                                "cid": "176"
                            }
                        ]
                    },
                    {
                        "id": "177",
                        "name": "大连市",
                        "pid": "14",
                        "children": [
                            {
                                "id": "1285",
                                "name": "长海县",
                                "cid": "177"
                            },
                            {
                                "id": "1286",
                                "name": "庄河市",
                                "cid": "177"
                            },
                            {
                                "id": "1287",
                                "name": "瓦房店市",
                                "cid": "177"
                            },
                            {
                                "id": "1288",
                                "name": "普兰店市",
                                "cid": "177"
                            },
                            {
                                "id": "1289",
                                "name": "金州区",
                                "cid": "177"
                            },
                            {
                                "id": "1290",
                                "name": "甘井子区",
                                "cid": "177"
                            },
                            {
                                "id": "1291",
                                "name": "西岗区",
                                "cid": "177"
                            },
                            {
                                "id": "1292",
                                "name": "中山区",
                                "cid": "177"
                            },
                            {
                                "id": "1293",
                                "name": "沙河口区",
                                "cid": "177"
                            },
                            {
                                "id": "1294",
                                "name": "旅顺口区",
                                "cid": "177"
                            }
                        ]
                    },
                    {
                        "id": "178",
                        "name": "抚顺市",
                        "pid": "14",
                        "children": [
                            {
                                "id": "1295",
                                "name": "清原满族自治县",
                                "cid": "178"
                            },
                            {
                                "id": "1296",
                                "name": "抚顺县",
                                "cid": "178"
                            },
                            {
                                "id": "1297",
                                "name": "新宾满族自治县",
                                "cid": "178"
                            },
                            {
                                "id": "1298",
                                "name": "顺城区",
                                "cid": "178"
                            },
                            {
                                "id": "1299",
                                "name": "东洲区",
                                "cid": "178"
                            },
                            {
                                "id": "1300",
                                "name": "新抚区",
                                "cid": "178"
                            },
                            {
                                "id": "1301",
                                "name": "望花区",
                                "cid": "178"
                            }
                        ]
                    },
                    {
                        "id": "179",
                        "name": "本溪市",
                        "pid": "14",
                        "children": [
                            {
                                "id": "1302",
                                "name": "本溪满族自治县",
                                "cid": "179"
                            },
                            {
                                "id": "1303",
                                "name": "桓仁满族自治县",
                                "cid": "179"
                            },
                            {
                                "id": "1304",
                                "name": "明山区",
                                "cid": "179"
                            },
                            {
                                "id": "1305",
                                "name": "平山区",
                                "cid": "179"
                            },
                            {
                                "id": "1306",
                                "name": "溪湖区",
                                "cid": "179"
                            },
                            {
                                "id": "1307",
                                "name": "南芬区",
                                "cid": "179"
                            }
                        ]
                    },
                    {
                        "id": "180",
                        "name": "盘锦市",
                        "pid": "14",
                        "children": [
                            {
                                "id": "1308",
                                "name": "大洼县",
                                "cid": "180"
                            },
                            {
                                "id": "1309",
                                "name": "盘山县",
                                "cid": "180"
                            },
                            {
                                "id": "1310",
                                "name": "兴隆台区",
                                "cid": "180"
                            },
                            {
                                "id": "1311",
                                "name": "双台子区",
                                "cid": "180"
                            }
                        ]
                    },
                    {
                        "id": "181",
                        "name": "朝阳市",
                        "pid": "14",
                        "children": [
                            {
                                "id": "1312",
                                "name": "建平县",
                                "cid": "181"
                            },
                            {
                                "id": "1313",
                                "name": "喀喇沁左翼蒙古族自治县",
                                "cid": "181"
                            },
                            {
                                "id": "1314",
                                "name": "朝阳县",
                                "cid": "181"
                            },
                            {
                                "id": "1315",
                                "name": "北票市",
                                "cid": "181"
                            },
                            {
                                "id": "1316",
                                "name": "凌源市",
                                "cid": "181"
                            },
                            {
                                "id": "1317",
                                "name": "龙城区",
                                "cid": "181"
                            },
                            {
                                "id": "1318",
                                "name": "双塔区",
                                "cid": "181"
                            }
                        ]
                    },
                    {
                        "id": "182",
                        "name": "营口市",
                        "pid": "14",
                        "children": [
                            {
                                "id": "1319",
                                "name": "盖州市",
                                "cid": "182"
                            },
                            {
                                "id": "1320",
                                "name": "鲅鱼圈区",
                                "cid": "182"
                            },
                            {
                                "id": "1321",
                                "name": "大石桥市",
                                "cid": "182"
                            },
                            {
                                "id": "1322",
                                "name": "西市区",
                                "cid": "182"
                            },
                            {
                                "id": "1323",
                                "name": "老边区",
                                "cid": "182"
                            },
                            {
                                "id": "1324",
                                "name": "站前区",
                                "cid": "182"
                            }
                        ]
                    },
                    {
                        "id": "183",
                        "name": "丹东市",
                        "pid": "14",
                        "children": [
                            {
                                "id": "1325",
                                "name": "东港市",
                                "cid": "183"
                            },
                            {
                                "id": "1326",
                                "name": "凤城市",
                                "cid": "183"
                            },
                            {
                                "id": "1327",
                                "name": "宽甸满族自治县",
                                "cid": "183"
                            },
                            {
                                "id": "1328",
                                "name": "振安区",
                                "cid": "183"
                            },
                            {
                                "id": "1329",
                                "name": "元宝区",
                                "cid": "183"
                            },
                            {
                                "id": "1330",
                                "name": "振兴区",
                                "cid": "183"
                            }
                        ]
                    },
                    {
                        "id": "184",
                        "name": "葫芦岛市",
                        "pid": "14",
                        "children": [
                            {
                                "id": "1331",
                                "name": "兴城市",
                                "cid": "184"
                            },
                            {
                                "id": "1332",
                                "name": "绥中县",
                                "cid": "184"
                            },
                            {
                                "id": "1333",
                                "name": "建昌县",
                                "cid": "184"
                            },
                            {
                                "id": "1334",
                                "name": "连山区",
                                "cid": "184"
                            },
                            {
                                "id": "1335",
                                "name": "龙港区",
                                "cid": "184"
                            },
                            {
                                "id": "1336",
                                "name": "南票区",
                                "cid": "184"
                            }
                        ]
                    },
                    {
                        "id": "185",
                        "name": "鞍山市",
                        "pid": "14",
                        "children": [
                            {
                                "id": "1337",
                                "name": "海城市",
                                "cid": "185"
                            },
                            {
                                "id": "1338",
                                "name": "台安县",
                                "cid": "185"
                            },
                            {
                                "id": "1339",
                                "name": "岫岩满族自治县",
                                "cid": "185"
                            },
                            {
                                "id": "1340",
                                "name": "千山区",
                                "cid": "185"
                            },
                            {
                                "id": "1341",
                                "name": "立山区",
                                "cid": "185"
                            },
                            {
                                "id": "1342",
                                "name": "铁西区",
                                "cid": "185"
                            },
                            {
                                "id": "1343",
                                "name": "铁东区",
                                "cid": "185"
                            }
                        ]
                    },
                    {
                        "id": "186",
                        "name": "辽阳市",
                        "pid": "14",
                        "children": [
                            {
                                "id": "1344",
                                "name": "弓长岭区",
                                "cid": "186"
                            },
                            {
                                "id": "1345",
                                "name": "灯塔市",
                                "cid": "186"
                            },
                            {
                                "id": "1346",
                                "name": "辽阳县",
                                "cid": "186"
                            },
                            {
                                "id": "1347",
                                "name": "太子河区",
                                "cid": "186"
                            },
                            {
                                "id": "1348",
                                "name": "白塔区",
                                "cid": "186"
                            },
                            {
                                "id": "1349",
                                "name": "文圣区",
                                "cid": "186"
                            },
                            {
                                "id": "1350",
                                "name": "宏伟区",
                                "cid": "186"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "2",
                "name": "甘肃省",
                "children": [
                    {
                        "id": "14",
                        "name": "嘉峪关市",
                        "pid": "2",
                        "children": [
                            {
                                "id": "119",
                                "name": "市辖区",
                                "cid": "14"
                            }
                        ]
                    },
                    {
                        "id": "15",
                        "name": "金昌市",
                        "pid": "2",
                        "children": [
                            {
                                "id": "120",
                                "name": "金川区",
                                "cid": "15"
                            },
                            {
                                "id": "121",
                                "name": "永昌县",
                                "cid": "15"
                            }
                        ]
                    },
                    {
                        "id": "16",
                        "name": "白银市",
                        "pid": "2",
                        "children": [
                            {
                                "id": "122",
                                "name": "靖远县",
                                "cid": "16"
                            },
                            {
                                "id": "123",
                                "name": "景泰县",
                                "cid": "16"
                            },
                            {
                                "id": "124",
                                "name": "平川区",
                                "cid": "16"
                            },
                            {
                                "id": "125",
                                "name": "会宁县",
                                "cid": "16"
                            },
                            {
                                "id": "126",
                                "name": "白银区",
                                "cid": "16"
                            }
                        ]
                    },
                    {
                        "id": "17",
                        "name": "兰州市",
                        "pid": "2",
                        "children": [
                            {
                                "id": "127",
                                "name": "榆中县",
                                "cid": "17"
                            },
                            {
                                "id": "128",
                                "name": "皋兰县",
                                "cid": "17"
                            },
                            {
                                "id": "129",
                                "name": "永登县",
                                "cid": "17"
                            },
                            {
                                "id": "130",
                                "name": "西固区",
                                "cid": "17"
                            },
                            {
                                "id": "131",
                                "name": "安宁区",
                                "cid": "17"
                            },
                            {
                                "id": "132",
                                "name": "七里河区",
                                "cid": "17"
                            },
                            {
                                "id": "133",
                                "name": "城关区",
                                "cid": "17"
                            },
                            {
                                "id": "134",
                                "name": "红古区",
                                "cid": "17"
                            }
                        ]
                    },
                    {
                        "id": "18",
                        "name": "酒泉市",
                        "pid": "2",
                        "children": [
                            {
                                "id": "135",
                                "name": "肃州区",
                                "cid": "18"
                            },
                            {
                                "id": "136",
                                "name": "肃北蒙古族自治县",
                                "cid": "18"
                            },
                            {
                                "id": "137",
                                "name": "瓜州县",
                                "cid": "18"
                            },
                            {
                                "id": "138",
                                "name": "玉门市",
                                "cid": "18"
                            },
                            {
                                "id": "139",
                                "name": "敦煌市",
                                "cid": "18"
                            },
                            {
                                "id": "140",
                                "name": "金塔县",
                                "cid": "18"
                            },
                            {
                                "id": "141",
                                "name": "阿克塞哈萨克族自治县",
                                "cid": "18"
                            }
                        ]
                    },
                    {
                        "id": "19",
                        "name": "张掖市",
                        "pid": "2",
                        "children": [
                            {
                                "id": "142",
                                "name": "临泽县",
                                "cid": "19"
                            },
                            {
                                "id": "143",
                                "name": "高台县",
                                "cid": "19"
                            },
                            {
                                "id": "144",
                                "name": "山丹县",
                                "cid": "19"
                            },
                            {
                                "id": "145",
                                "name": "民乐县",
                                "cid": "19"
                            },
                            {
                                "id": "146",
                                "name": "甘州区",
                                "cid": "19"
                            },
                            {
                                "id": "147",
                                "name": "肃南裕固族自治县",
                                "cid": "19"
                            }
                        ]
                    },
                    {
                        "id": "20",
                        "name": "武威市",
                        "pid": "2",
                        "children": [
                            {
                                "id": "148",
                                "name": "民勤县",
                                "cid": "20"
                            },
                            {
                                "id": "149",
                                "name": "凉州区",
                                "cid": "20"
                            },
                            {
                                "id": "150",
                                "name": "古浪县",
                                "cid": "20"
                            },
                            {
                                "id": "151",
                                "name": "天祝藏族自治县",
                                "cid": "20"
                            }
                        ]
                    },
                    {
                        "id": "21",
                        "name": "庆阳市",
                        "pid": "2",
                        "children": [
                            {
                                "id": "152",
                                "name": "庆城县",
                                "cid": "21"
                            },
                            {
                                "id": "153",
                                "name": "西峰区",
                                "cid": "21"
                            },
                            {
                                "id": "154",
                                "name": "镇原县",
                                "cid": "21"
                            },
                            {
                                "id": "155",
                                "name": "环县",
                                "cid": "21"
                            },
                            {
                                "id": "156",
                                "name": "宁县",
                                "cid": "21"
                            },
                            {
                                "id": "157",
                                "name": "华池县",
                                "cid": "21"
                            },
                            {
                                "id": "158",
                                "name": "正宁县",
                                "cid": "21"
                            },
                            {
                                "id": "159",
                                "name": "合水县",
                                "cid": "21"
                            }
                        ]
                    },
                    {
                        "id": "22",
                        "name": "定西市",
                        "pid": "2",
                        "children": [
                            {
                                "id": "160",
                                "name": "渭源县",
                                "cid": "22"
                            },
                            {
                                "id": "161",
                                "name": "临洮县",
                                "cid": "22"
                            },
                            {
                                "id": "162",
                                "name": "漳县",
                                "cid": "22"
                            },
                            {
                                "id": "163",
                                "name": "岷县",
                                "cid": "22"
                            },
                            {
                                "id": "164",
                                "name": "通渭县",
                                "cid": "22"
                            },
                            {
                                "id": "165",
                                "name": "安定区",
                                "cid": "22"
                            },
                            {
                                "id": "166",
                                "name": "陇西县",
                                "cid": "22"
                            }
                        ]
                    },
                    {
                        "id": "23",
                        "name": "临夏回族自治州",
                        "pid": "2",
                        "children": [
                            {
                                "id": "167",
                                "name": "广河县",
                                "cid": "23"
                            },
                            {
                                "id": "168",
                                "name": "东乡族自治县",
                                "cid": "23"
                            },
                            {
                                "id": "169",
                                "name": "康乐县",
                                "cid": "23"
                            },
                            {
                                "id": "170",
                                "name": "和政县",
                                "cid": "23"
                            },
                            {
                                "id": "171",
                                "name": "临夏市",
                                "cid": "23"
                            },
                            {
                                "id": "172",
                                "name": "永靖县",
                                "cid": "23"
                            },
                            {
                                "id": "173",
                                "name": "临夏县",
                                "cid": "23"
                            },
                            {
                                "id": "174",
                                "name": "积石山县",
                                "cid": "23"
                            }
                        ]
                    },
                    {
                        "id": "24",
                        "name": "天水市",
                        "pid": "2",
                        "children": [
                            {
                                "id": "175",
                                "name": "武山县",
                                "cid": "24"
                            },
                            {
                                "id": "176",
                                "name": "秦安县",
                                "cid": "24"
                            },
                            {
                                "id": "177",
                                "name": "甘谷县",
                                "cid": "24"
                            },
                            {
                                "id": "178",
                                "name": "清水县",
                                "cid": "24"
                            },
                            {
                                "id": "179",
                                "name": "张家川回族自治县",
                                "cid": "24"
                            },
                            {
                                "id": "180",
                                "name": "秦州区",
                                "cid": "24"
                            },
                            {
                                "id": "181",
                                "name": "麦积区",
                                "cid": "24"
                            }
                        ]
                    },
                    {
                        "id": "25",
                        "name": "甘南藏族自治州",
                        "pid": "2",
                        "children": [
                            {
                                "id": "182",
                                "name": "临潭县",
                                "cid": "25"
                            },
                            {
                                "id": "183",
                                "name": "合作市",
                                "cid": "25"
                            },
                            {
                                "id": "184",
                                "name": "夏河县",
                                "cid": "25"
                            },
                            {
                                "id": "185",
                                "name": "卓尼县",
                                "cid": "25"
                            },
                            {
                                "id": "186",
                                "name": "迭部县",
                                "cid": "25"
                            },
                            {
                                "id": "187",
                                "name": "玛曲县",
                                "cid": "25"
                            },
                            {
                                "id": "188",
                                "name": "舟曲县",
                                "cid": "25"
                            },
                            {
                                "id": "189",
                                "name": "碌曲县",
                                "cid": "25"
                            }
                        ]
                    },
                    {
                        "id": "26",
                        "name": "陇南市",
                        "pid": "2",
                        "children": [
                            {
                                "id": "190",
                                "name": "宕昌县",
                                "cid": "26"
                            },
                            {
                                "id": "191",
                                "name": "西和县",
                                "cid": "26"
                            },
                            {
                                "id": "192",
                                "name": "礼县",
                                "cid": "26"
                            },
                            {
                                "id": "193",
                                "name": "成县",
                                "cid": "26"
                            },
                            {
                                "id": "194",
                                "name": "武都区",
                                "cid": "26"
                            },
                            {
                                "id": "195",
                                "name": "文县",
                                "cid": "26"
                            },
                            {
                                "id": "196",
                                "name": "徽县",
                                "cid": "26"
                            },
                            {
                                "id": "197",
                                "name": "两当县",
                                "cid": "26"
                            },
                            {
                                "id": "198",
                                "name": "康县",
                                "cid": "26"
                            }
                        ]
                    },
                    {
                        "id": "27",
                        "name": "平凉市",
                        "pid": "2",
                        "children": [
                            {
                                "id": "199",
                                "name": "崆峒区",
                                "cid": "27"
                            },
                            {
                                "id": "200",
                                "name": "崇信县",
                                "cid": "27"
                            },
                            {
                                "id": "201",
                                "name": "庄浪县",
                                "cid": "27"
                            },
                            {
                                "id": "202",
                                "name": "灵台县",
                                "cid": "27"
                            },
                            {
                                "id": "203",
                                "name": "静宁县",
                                "cid": "27"
                            },
                            {
                                "id": "204",
                                "name": "泾川县",
                                "cid": "27"
                            },
                            {
                                "id": "205",
                                "name": "华亭县",
                                "cid": "27"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "12",
                "name": "广西壮族自治区",
                "children": [
                    {
                        "id": "146",
                        "name": "桂林市",
                        "pid": "12",
                        "children": [
                            {
                                "id": "1036",
                                "name": "兴安县",
                                "cid": "146"
                            },
                            {
                                "id": "1037",
                                "name": "阳朔县",
                                "cid": "146"
                            },
                            {
                                "id": "1038",
                                "name": "灵川县",
                                "cid": "146"
                            },
                            {
                                "id": "1039",
                                "name": "荔浦县",
                                "cid": "146"
                            },
                            {
                                "id": "1040",
                                "name": "临桂县",
                                "cid": "146"
                            },
                            {
                                "id": "1041",
                                "name": "平乐县",
                                "cid": "146"
                            },
                            {
                                "id": "1042",
                                "name": "灌阳县",
                                "cid": "146"
                            },
                            {
                                "id": "1043",
                                "name": "资源县",
                                "cid": "146"
                            },
                            {
                                "id": "1044",
                                "name": "永福县",
                                "cid": "146"
                            },
                            {
                                "id": "1045",
                                "name": "全州县",
                                "cid": "146"
                            },
                            {
                                "id": "1046",
                                "name": "恭城瑶族自治县",
                                "cid": "146"
                            },
                            {
                                "id": "1047",
                                "name": "龙胜各族自治县",
                                "cid": "146"
                            },
                            {
                                "id": "1048",
                                "name": "叠彩区",
                                "cid": "146"
                            },
                            {
                                "id": "1049",
                                "name": "秀峰区",
                                "cid": "146"
                            },
                            {
                                "id": "1050",
                                "name": "象山区",
                                "cid": "146"
                            },
                            {
                                "id": "1051",
                                "name": "七星区",
                                "cid": "146"
                            },
                            {
                                "id": "1052",
                                "name": "雁山区",
                                "cid": "146"
                            }
                        ]
                    },
                    {
                        "id": "147",
                        "name": "河池市",
                        "pid": "12",
                        "children": [
                            {
                                "id": "1053",
                                "name": "南丹县",
                                "cid": "147"
                            },
                            {
                                "id": "1054",
                                "name": "都安瑶族自治县",
                                "cid": "147"
                            },
                            {
                                "id": "1055",
                                "name": "天峨县",
                                "cid": "147"
                            },
                            {
                                "id": "1056",
                                "name": "金城江区",
                                "cid": "147"
                            },
                            {
                                "id": "1057",
                                "name": "巴马瑶族自治县",
                                "cid": "147"
                            },
                            {
                                "id": "1058",
                                "name": "东兰县",
                                "cid": "147"
                            },
                            {
                                "id": "1059",
                                "name": "环江毛南族自治县",
                                "cid": "147"
                            },
                            {
                                "id": "1060",
                                "name": "凤山县",
                                "cid": "147"
                            },
                            {
                                "id": "1061",
                                "name": "宜州市",
                                "cid": "147"
                            },
                            {
                                "id": "1062",
                                "name": "大化瑶族自治县",
                                "cid": "147"
                            },
                            {
                                "id": "1063",
                                "name": "罗城仫佬族自治县",
                                "cid": "147"
                            }
                        ]
                    },
                    {
                        "id": "148",
                        "name": "崇左市",
                        "pid": "12",
                        "children": [
                            {
                                "id": "1064",
                                "name": "龙州县",
                                "cid": "148"
                            },
                            {
                                "id": "1065",
                                "name": "宁明县",
                                "cid": "148"
                            },
                            {
                                "id": "1066",
                                "name": "天等县",
                                "cid": "148"
                            },
                            {
                                "id": "1067",
                                "name": "凭祥市",
                                "cid": "148"
                            },
                            {
                                "id": "1068",
                                "name": "扶绥县",
                                "cid": "148"
                            },
                            {
                                "id": "1069",
                                "name": "大新县",
                                "cid": "148"
                            },
                            {
                                "id": "1070",
                                "name": "江州区",
                                "cid": "148"
                            }
                        ]
                    },
                    {
                        "id": "149",
                        "name": "钦州市",
                        "pid": "12",
                        "children": [
                            {
                                "id": "1071",
                                "name": "灵山县",
                                "cid": "149"
                            },
                            {
                                "id": "1072",
                                "name": "浦北县",
                                "cid": "149"
                            },
                            {
                                "id": "1073",
                                "name": "钦南区",
                                "cid": "149"
                            },
                            {
                                "id": "1074",
                                "name": "钦北区",
                                "cid": "149"
                            }
                        ]
                    },
                    {
                        "id": "150",
                        "name": "来宾市",
                        "pid": "12",
                        "children": [
                            {
                                "id": "1075",
                                "name": "金秀瑶族自治县",
                                "cid": "150"
                            },
                            {
                                "id": "1076",
                                "name": "兴宾区",
                                "cid": "150"
                            },
                            {
                                "id": "1077",
                                "name": "忻城县",
                                "cid": "150"
                            },
                            {
                                "id": "1078",
                                "name": "武宣县",
                                "cid": "150"
                            },
                            {
                                "id": "1079",
                                "name": "合山市",
                                "cid": "150"
                            },
                            {
                                "id": "1080",
                                "name": "象州县",
                                "cid": "150"
                            }
                        ]
                    },
                    {
                        "id": "151",
                        "name": "百色市",
                        "pid": "12",
                        "children": [
                            {
                                "id": "1081",
                                "name": "乐业县",
                                "cid": "151"
                            },
                            {
                                "id": "1082",
                                "name": "隆林各族自治县",
                                "cid": "151"
                            },
                            {
                                "id": "1083",
                                "name": "田东县",
                                "cid": "151"
                            },
                            {
                                "id": "1084",
                                "name": "靖西县",
                                "cid": "151"
                            },
                            {
                                "id": "1085",
                                "name": "田林县",
                                "cid": "151"
                            },
                            {
                                "id": "1086",
                                "name": "德保县",
                                "cid": "151"
                            },
                            {
                                "id": "1087",
                                "name": "那坡县",
                                "cid": "151"
                            },
                            {
                                "id": "1088",
                                "name": "西林县",
                                "cid": "151"
                            },
                            {
                                "id": "1089",
                                "name": "田阳县",
                                "cid": "151"
                            },
                            {
                                "id": "1090",
                                "name": "平果县",
                                "cid": "151"
                            },
                            {
                                "id": "1091",
                                "name": "右江区",
                                "cid": "151"
                            },
                            {
                                "id": "1092",
                                "name": "凌云县",
                                "cid": "151"
                            }
                        ]
                    },
                    {
                        "id": "152",
                        "name": "防城港市",
                        "pid": "12",
                        "children": [
                            {
                                "id": "1093",
                                "name": "上思县",
                                "cid": "152"
                            },
                            {
                                "id": "1094",
                                "name": "东兴市",
                                "cid": "152"
                            },
                            {
                                "id": "1095",
                                "name": "防城区",
                                "cid": "152"
                            },
                            {
                                "id": "1096",
                                "name": "港口区",
                                "cid": "152"
                            }
                        ]
                    },
                    {
                        "id": "153",
                        "name": "贺州市",
                        "pid": "12",
                        "children": [
                            {
                                "id": "1097",
                                "name": "昭平县",
                                "cid": "153"
                            },
                            {
                                "id": "1098",
                                "name": "富川瑶族自治县",
                                "cid": "153"
                            },
                            {
                                "id": "1099",
                                "name": "钟山县",
                                "cid": "153"
                            },
                            {
                                "id": "1100",
                                "name": "八步区",
                                "cid": "153"
                            }
                        ]
                    },
                    {
                        "id": "154",
                        "name": "南宁市",
                        "pid": "12",
                        "children": [
                            {
                                "id": "1101",
                                "name": "武鸣县",
                                "cid": "154"
                            },
                            {
                                "id": "1102",
                                "name": "宾阳县",
                                "cid": "154"
                            },
                            {
                                "id": "1103",
                                "name": "隆安县",
                                "cid": "154"
                            },
                            {
                                "id": "1104",
                                "name": "马山县",
                                "cid": "154"
                            },
                            {
                                "id": "1105",
                                "name": "横县",
                                "cid": "154"
                            },
                            {
                                "id": "1106",
                                "name": "上林县",
                                "cid": "154"
                            },
                            {
                                "id": "1107",
                                "name": "西乡塘区",
                                "cid": "154"
                            },
                            {
                                "id": "1108",
                                "name": "邕宁区",
                                "cid": "154"
                            },
                            {
                                "id": "1109",
                                "name": "良庆区",
                                "cid": "154"
                            },
                            {
                                "id": "1110",
                                "name": "江南区",
                                "cid": "154"
                            },
                            {
                                "id": "1111",
                                "name": "青秀区",
                                "cid": "154"
                            },
                            {
                                "id": "1112",
                                "name": "兴宁区",
                                "cid": "154"
                            }
                        ]
                    },
                    {
                        "id": "155",
                        "name": "北海市",
                        "pid": "12",
                        "children": [
                            {
                                "id": "1113",
                                "name": "合浦县",
                                "cid": "155"
                            },
                            {
                                "id": "1114",
                                "name": "银海区",
                                "cid": "155"
                            },
                            {
                                "id": "1115",
                                "name": "海城区",
                                "cid": "155"
                            },
                            {
                                "id": "1116",
                                "name": "铁山港区",
                                "cid": "155"
                            }
                        ]
                    },
                    {
                        "id": "156",
                        "name": "梧州市",
                        "pid": "12",
                        "children": [
                            {
                                "id": "1117",
                                "name": "藤县",
                                "cid": "156"
                            },
                            {
                                "id": "1118",
                                "name": "蒙山县",
                                "cid": "156"
                            },
                            {
                                "id": "1119",
                                "name": "苍梧县",
                                "cid": "156"
                            },
                            {
                                "id": "1120",
                                "name": "岑溪市",
                                "cid": "156"
                            },
                            {
                                "id": "1121",
                                "name": "长洲区",
                                "cid": "156"
                            },
                            {
                                "id": "1122",
                                "name": "蝶山区",
                                "cid": "156"
                            },
                            {
                                "id": "1123",
                                "name": "万秀区",
                                "cid": "156"
                            }
                        ]
                    },
                    {
                        "id": "157",
                        "name": "柳州市",
                        "pid": "12",
                        "children": [
                            {
                                "id": "1124",
                                "name": "柳城县",
                                "cid": "157"
                            },
                            {
                                "id": "1125",
                                "name": "三江侗族自治县",
                                "cid": "157"
                            },
                            {
                                "id": "1126",
                                "name": "融水苗族自治县",
                                "cid": "157"
                            },
                            {
                                "id": "1127",
                                "name": "柳江县",
                                "cid": "157"
                            },
                            {
                                "id": "1128",
                                "name": "融安县",
                                "cid": "157"
                            },
                            {
                                "id": "1129",
                                "name": "鹿寨县",
                                "cid": "157"
                            },
                            {
                                "id": "1130",
                                "name": "柳北区",
                                "cid": "157"
                            },
                            {
                                "id": "1131",
                                "name": "柳南区",
                                "cid": "157"
                            },
                            {
                                "id": "1132",
                                "name": "城中区",
                                "cid": "157"
                            },
                            {
                                "id": "1133",
                                "name": "鱼峰区",
                                "cid": "157"
                            }
                        ]
                    },
                    {
                        "id": "158",
                        "name": "贵港市",
                        "pid": "12",
                        "children": [
                            {
                                "id": "1134",
                                "name": "平南县",
                                "cid": "158"
                            },
                            {
                                "id": "1135",
                                "name": "桂平市",
                                "cid": "158"
                            },
                            {
                                "id": "1136",
                                "name": "覃塘区",
                                "cid": "158"
                            },
                            {
                                "id": "1137",
                                "name": "港南区",
                                "cid": "158"
                            },
                            {
                                "id": "1138",
                                "name": "港北区",
                                "cid": "158"
                            }
                        ]
                    },
                    {
                        "id": "159",
                        "name": "玉林市",
                        "pid": "12",
                        "children": [
                            {
                                "id": "1139",
                                "name": "兴业县",
                                "cid": "159"
                            },
                            {
                                "id": "1140",
                                "name": "容县",
                                "cid": "159"
                            },
                            {
                                "id": "1141",
                                "name": "博白县",
                                "cid": "159"
                            },
                            {
                                "id": "1142",
                                "name": "玉州区",
                                "cid": "159"
                            },
                            {
                                "id": "1143",
                                "name": "陆川县",
                                "cid": "159"
                            },
                            {
                                "id": "1144",
                                "name": "北流市",
                                "cid": "159"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "23",
                "name": "云南省",
                "children": [
                    {
                        "id": "286",
                        "name": "昆明市",
                        "pid": "23",
                        "children": [
                            {
                                "id": "2072",
                                "name": "寻甸回族彝族自治县",
                                "cid": "286"
                            },
                            {
                                "id": "2073",
                                "name": "宜良县",
                                "cid": "286"
                            },
                            {
                                "id": "2074",
                                "name": "呈贡县",
                                "cid": "286"
                            },
                            {
                                "id": "2075",
                                "name": "嵩明县",
                                "cid": "286"
                            },
                            {
                                "id": "2076",
                                "name": "富民县",
                                "cid": "286"
                            },
                            {
                                "id": "2077",
                                "name": "安宁市",
                                "cid": "286"
                            },
                            {
                                "id": "2078",
                                "name": "石林彝族自治县",
                                "cid": "286"
                            },
                            {
                                "id": "2079",
                                "name": "晋宁县",
                                "cid": "286"
                            },
                            {
                                "id": "2080",
                                "name": "东川区",
                                "cid": "286"
                            },
                            {
                                "id": "2081",
                                "name": "禄劝彝族苗族自治县",
                                "cid": "286"
                            },
                            {
                                "id": "2082",
                                "name": "官渡区",
                                "cid": "286"
                            },
                            {
                                "id": "2083",
                                "name": "西山区",
                                "cid": "286"
                            },
                            {
                                "id": "2084",
                                "name": "盘龙区",
                                "cid": "286"
                            },
                            {
                                "id": "2085",
                                "name": "五华区",
                                "cid": "286"
                            }
                        ]
                    },
                    {
                        "id": "287",
                        "name": "楚雄彝族自治州",
                        "pid": "23",
                        "children": [
                            {
                                "id": "2086",
                                "name": "大姚县",
                                "cid": "287"
                            },
                            {
                                "id": "2087",
                                "name": "禄丰县",
                                "cid": "287"
                            },
                            {
                                "id": "2088",
                                "name": "双柏县",
                                "cid": "287"
                            },
                            {
                                "id": "2089",
                                "name": "楚雄市",
                                "cid": "287"
                            },
                            {
                                "id": "2090",
                                "name": "牟定县",
                                "cid": "287"
                            },
                            {
                                "id": "2091",
                                "name": "南华县",
                                "cid": "287"
                            },
                            {
                                "id": "2092",
                                "name": "姚安县",
                                "cid": "287"
                            },
                            {
                                "id": "2093",
                                "name": "永仁县",
                                "cid": "287"
                            },
                            {
                                "id": "2094",
                                "name": "武定县",
                                "cid": "287"
                            },
                            {
                                "id": "2095",
                                "name": "元谋县",
                                "cid": "287"
                            }
                        ]
                    },
                    {
                        "id": "288",
                        "name": "玉溪市",
                        "pid": "23",
                        "children": [
                            {
                                "id": "2096",
                                "name": "澄江县",
                                "cid": "288"
                            },
                            {
                                "id": "2097",
                                "name": "易门县",
                                "cid": "288"
                            },
                            {
                                "id": "2098",
                                "name": "华宁县",
                                "cid": "288"
                            },
                            {
                                "id": "2099",
                                "name": "红塔区",
                                "cid": "288"
                            },
                            {
                                "id": "2100",
                                "name": "峨山彝族自治县",
                                "cid": "288"
                            },
                            {
                                "id": "2101",
                                "name": "新平彝族傣族自治县",
                                "cid": "288"
                            },
                            {
                                "id": "2102",
                                "name": "元江县",
                                "cid": "288"
                            },
                            {
                                "id": "2103",
                                "name": "江川县",
                                "cid": "288"
                            },
                            {
                                "id": "2104",
                                "name": "通海县",
                                "cid": "288"
                            }
                        ]
                    },
                    {
                        "id": "289",
                        "name": "红河哈尼族彝族自治州",
                        "pid": "23",
                        "children": [
                            {
                                "id": "2105",
                                "name": "泸西县",
                                "cid": "289"
                            },
                            {
                                "id": "2106",
                                "name": "弥勒县",
                                "cid": "289"
                            },
                            {
                                "id": "2107",
                                "name": "开远市",
                                "cid": "289"
                            },
                            {
                                "id": "2108",
                                "name": "建水县",
                                "cid": "289"
                            },
                            {
                                "id": "2109",
                                "name": "个旧市",
                                "cid": "289"
                            },
                            {
                                "id": "2110",
                                "name": "石屏县",
                                "cid": "289"
                            },
                            {
                                "id": "2111",
                                "name": "红河县",
                                "cid": "289"
                            },
                            {
                                "id": "2112",
                                "name": "河口瑶族自治县",
                                "cid": "289"
                            },
                            {
                                "id": "2113",
                                "name": "屏边苗族自治县",
                                "cid": "289"
                            },
                            {
                                "id": "2114",
                                "name": "蒙自县",
                                "cid": "289"
                            },
                            {
                                "id": "2115",
                                "name": "金平苗族瑶族傣族自治县",
                                "cid": "289"
                            },
                            {
                                "id": "2116",
                                "name": "元阳县",
                                "cid": "289"
                            },
                            {
                                "id": "2117",
                                "name": "绿春县",
                                "cid": "289"
                            }
                        ]
                    },
                    {
                        "id": "290",
                        "name": "普洱市",
                        "pid": "23",
                        "children": [
                            {
                                "id": "2118",
                                "name": "墨江哈尼族自治县",
                                "cid": "290"
                            },
                            {
                                "id": "2119",
                                "name": "江城哈尼族彝族自治县",
                                "cid": "290"
                            },
                            {
                                "id": "2120",
                                "name": "思茅区",
                                "cid": "290"
                            },
                            {
                                "id": "2121",
                                "name": "澜沧拉祜族自治县",
                                "cid": "290"
                            },
                            {
                                "id": "2122",
                                "name": "宁洱哈尼族彝族自治县",
                                "cid": "290"
                            },
                            {
                                "id": "2123",
                                "name": "景谷傣族彝族自治县",
                                "cid": "290"
                            },
                            {
                                "id": "2124",
                                "name": "镇沅县",
                                "cid": "290"
                            },
                            {
                                "id": "2125",
                                "name": "景东彝族自治县",
                                "cid": "290"
                            },
                            {
                                "id": "2126",
                                "name": "西盟佤族自治县",
                                "cid": "290"
                            },
                            {
                                "id": "2127",
                                "name": "孟连县",
                                "cid": "290"
                            }
                        ]
                    },
                    {
                        "id": "291",
                        "name": "西双版纳傣族自治州",
                        "pid": "23",
                        "children": [
                            {
                                "id": "2128",
                                "name": "勐腊县",
                                "cid": "291"
                            },
                            {
                                "id": "2129",
                                "name": "勐海县",
                                "cid": "291"
                            },
                            {
                                "id": "2130",
                                "name": "景洪市",
                                "cid": "291"
                            }
                        ]
                    },
                    {
                        "id": "292",
                        "name": "临沧市",
                        "pid": "23",
                        "children": [
                            {
                                "id": "2131",
                                "name": "沧源佤族自治县",
                                "cid": "292"
                            },
                            {
                                "id": "2132",
                                "name": "云县",
                                "cid": "292"
                            },
                            {
                                "id": "2133",
                                "name": "临翔区",
                                "cid": "292"
                            },
                            {
                                "id": "2134",
                                "name": "凤庆县",
                                "cid": "292"
                            },
                            {
                                "id": "2135",
                                "name": "镇康县",
                                "cid": "292"
                            },
                            {
                                "id": "2136",
                                "name": "永德县",
                                "cid": "292"
                            },
                            {
                                "id": "2137",
                                "name": "双江县",
                                "cid": "292"
                            },
                            {
                                "id": "2138",
                                "name": "耿马傣族佤族自治县",
                                "cid": "292"
                            }
                        ]
                    },
                    {
                        "id": "293",
                        "name": "大理白族自治州",
                        "pid": "23",
                        "children": [
                            {
                                "id": "2139",
                                "name": "南涧彝族自治县",
                                "cid": "293"
                            },
                            {
                                "id": "2140",
                                "name": "弥渡县",
                                "cid": "293"
                            },
                            {
                                "id": "2141",
                                "name": "祥云县",
                                "cid": "293"
                            },
                            {
                                "id": "2142",
                                "name": "漾濞彝族自治县",
                                "cid": "293"
                            },
                            {
                                "id": "2143",
                                "name": "永平县",
                                "cid": "293"
                            },
                            {
                                "id": "2144",
                                "name": "大理市",
                                "cid": "293"
                            },
                            {
                                "id": "2145",
                                "name": "巍山彝族回族自治县",
                                "cid": "293"
                            },
                            {
                                "id": "2146",
                                "name": "宾川县",
                                "cid": "293"
                            },
                            {
                                "id": "2147",
                                "name": "洱源县",
                                "cid": "293"
                            },
                            {
                                "id": "2148",
                                "name": "鹤庆县",
                                "cid": "293"
                            },
                            {
                                "id": "2149",
                                "name": "云龙县",
                                "cid": "293"
                            },
                            {
                                "id": "2150",
                                "name": "剑川县",
                                "cid": "293"
                            }
                        ]
                    },
                    {
                        "id": "294",
                        "name": "保山市",
                        "pid": "23",
                        "children": [
                            {
                                "id": "2151",
                                "name": "隆阳区",
                                "cid": "294"
                            },
                            {
                                "id": "2152",
                                "name": "施甸县",
                                "cid": "294"
                            },
                            {
                                "id": "2153",
                                "name": "龙陵县",
                                "cid": "294"
                            },
                            {
                                "id": "2154",
                                "name": "腾冲县",
                                "cid": "294"
                            },
                            {
                                "id": "2155",
                                "name": "昌宁县",
                                "cid": "294"
                            }
                        ]
                    },
                    {
                        "id": "295",
                        "name": "怒江傈僳族自治州",
                        "pid": "23",
                        "children": [
                            {
                                "id": "2156",
                                "name": "泸水县",
                                "cid": "295"
                            },
                            {
                                "id": "2157",
                                "name": "福贡县",
                                "cid": "295"
                            },
                            {
                                "id": "2158",
                                "name": "兰坪白族普米族自治县",
                                "cid": "295"
                            },
                            {
                                "id": "2159",
                                "name": "贡山独龙族怒族自治县",
                                "cid": "295"
                            }
                        ]
                    },
                    {
                        "id": "296",
                        "name": "丽江市",
                        "pid": "23",
                        "children": [
                            {
                                "id": "2160",
                                "name": "永胜县",
                                "cid": "296"
                            },
                            {
                                "id": "2161",
                                "name": "古城区",
                                "cid": "296"
                            },
                            {
                                "id": "2162",
                                "name": "宁蒗彝族自治县",
                                "cid": "296"
                            },
                            {
                                "id": "2163",
                                "name": "华坪县",
                                "cid": "296"
                            },
                            {
                                "id": "2164",
                                "name": "玉龙纳西族自治县",
                                "cid": "296"
                            }
                        ]
                    },
                    {
                        "id": "297",
                        "name": "迪庆藏族自治州",
                        "pid": "23",
                        "children": [
                            {
                                "id": "2165",
                                "name": "维西傈僳族自治县",
                                "cid": "297"
                            },
                            {
                                "id": "2166",
                                "name": "德钦县",
                                "cid": "297"
                            },
                            {
                                "id": "2167",
                                "name": "香格里拉县",
                                "cid": "297"
                            }
                        ]
                    },
                    {
                        "id": "298",
                        "name": "德宏傣族景颇族自治州",
                        "pid": "23",
                        "children": [
                            {
                                "id": "2168",
                                "name": "盈江县",
                                "cid": "298"
                            },
                            {
                                "id": "2169",
                                "name": "陇川县",
                                "cid": "298"
                            },
                            {
                                "id": "2170",
                                "name": "梁河县",
                                "cid": "298"
                            },
                            {
                                "id": "2171",
                                "name": "瑞丽市",
                                "cid": "298"
                            },
                            {
                                "id": "2172",
                                "name": "潞西市",
                                "cid": "298"
                            }
                        ]
                    },
                    {
                        "id": "299",
                        "name": "文山壮族苗族自治州",
                        "pid": "23",
                        "children": [
                            {
                                "id": "2173",
                                "name": "砚山县",
                                "cid": "299"
                            },
                            {
                                "id": "2174",
                                "name": "文山县",
                                "cid": "299"
                            },
                            {
                                "id": "2175",
                                "name": "麻栗坡县",
                                "cid": "299"
                            },
                            {
                                "id": "2176",
                                "name": "西畴县",
                                "cid": "299"
                            },
                            {
                                "id": "2177",
                                "name": "马关县",
                                "cid": "299"
                            },
                            {
                                "id": "2178",
                                "name": "丘北县",
                                "cid": "299"
                            },
                            {
                                "id": "2179",
                                "name": "广南县",
                                "cid": "299"
                            },
                            {
                                "id": "2180",
                                "name": "富宁县",
                                "cid": "299"
                            }
                        ]
                    },
                    {
                        "id": "300",
                        "name": "曲靖市",
                        "pid": "23",
                        "children": [
                            {
                                "id": "2181",
                                "name": "沾益县",
                                "cid": "300"
                            },
                            {
                                "id": "2182",
                                "name": "陆良县",
                                "cid": "300"
                            },
                            {
                                "id": "2183",
                                "name": "马龙县",
                                "cid": "300"
                            },
                            {
                                "id": "2184",
                                "name": "麒麟区",
                                "cid": "300"
                            },
                            {
                                "id": "2185",
                                "name": "罗平县",
                                "cid": "300"
                            },
                            {
                                "id": "2186",
                                "name": "师宗县",
                                "cid": "300"
                            },
                            {
                                "id": "2187",
                                "name": "会泽县",
                                "cid": "300"
                            },
                            {
                                "id": "2188",
                                "name": "宣威市",
                                "cid": "300"
                            },
                            {
                                "id": "2189",
                                "name": "富源县",
                                "cid": "300"
                            }
                        ]
                    },
                    {
                        "id": "301",
                        "name": "昭通市",
                        "pid": "23",
                        "children": [
                            {
                                "id": "2190",
                                "name": "大关县",
                                "cid": "301"
                            },
                            {
                                "id": "2191",
                                "name": "镇雄县",
                                "cid": "301"
                            },
                            {
                                "id": "2192",
                                "name": "昭阳区",
                                "cid": "301"
                            },
                            {
                                "id": "2193",
                                "name": "彝良县",
                                "cid": "301"
                            },
                            {
                                "id": "2194",
                                "name": "鲁甸县",
                                "cid": "301"
                            },
                            {
                                "id": "2195",
                                "name": "威信县",
                                "cid": "301"
                            },
                            {
                                "id": "2196",
                                "name": "盐津县",
                                "cid": "301"
                            },
                            {
                                "id": "2197",
                                "name": "永善县",
                                "cid": "301"
                            },
                            {
                                "id": "2198",
                                "name": "巧家县",
                                "cid": "301"
                            },
                            {
                                "id": "2199",
                                "name": "绥江县",
                                "cid": "301"
                            },
                            {
                                "id": "2200",
                                "name": "水富县",
                                "cid": "301"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "4",
                "name": "山东省",
                "children": [
                    {
                        "id": "50",
                        "name": "莱芜市",
                        "pid": "4",
                        "children": [
                            {
                                "id": "330",
                                "name": "钢城区",
                                "cid": "50"
                            },
                            {
                                "id": "331",
                                "name": "莱城区",
                                "cid": "50"
                            }
                        ]
                    },
                    {
                        "id": "51",
                        "name": "枣庄市",
                        "pid": "4",
                        "children": [
                            {
                                "id": "332",
                                "name": "滕州市",
                                "cid": "51"
                            },
                            {
                                "id": "333",
                                "name": "山亭区",
                                "cid": "51"
                            },
                            {
                                "id": "334",
                                "name": "市中区",
                                "cid": "51"
                            },
                            {
                                "id": "335",
                                "name": "薛城区",
                                "cid": "51"
                            },
                            {
                                "id": "336",
                                "name": "峄城区",
                                "cid": "51"
                            },
                            {
                                "id": "337",
                                "name": "台儿庄区",
                                "cid": "51"
                            }
                        ]
                    },
                    {
                        "id": "52",
                        "name": "日照市",
                        "pid": "4",
                        "children": [
                            {
                                "id": "338",
                                "name": "五莲县",
                                "cid": "52"
                            },
                            {
                                "id": "339",
                                "name": "莒县",
                                "cid": "52"
                            },
                            {
                                "id": "340",
                                "name": "东港区",
                                "cid": "52"
                            },
                            {
                                "id": "341",
                                "name": "岚山区",
                                "cid": "52"
                            }
                        ]
                    },
                    {
                        "id": "53",
                        "name": "东营市",
                        "pid": "4",
                        "children": [
                            {
                                "id": "342",
                                "name": "垦利县",
                                "cid": "53"
                            },
                            {
                                "id": "343",
                                "name": "广饶县",
                                "cid": "53"
                            },
                            {
                                "id": "344",
                                "name": "利津县",
                                "cid": "53"
                            },
                            {
                                "id": "345",
                                "name": "东营区",
                                "cid": "53"
                            },
                            {
                                "id": "346",
                                "name": "河口区",
                                "cid": "53"
                            }
                        ]
                    },
                    {
                        "id": "54",
                        "name": "威海市",
                        "pid": "4",
                        "children": [
                            {
                                "id": "347",
                                "name": "乳山市",
                                "cid": "54"
                            },
                            {
                                "id": "348",
                                "name": "环翠区",
                                "cid": "54"
                            },
                            {
                                "id": "349",
                                "name": "文登市",
                                "cid": "54"
                            },
                            {
                                "id": "350",
                                "name": "荣成市",
                                "cid": "54"
                            }
                        ]
                    },
                    {
                        "id": "55",
                        "name": "临沂市",
                        "pid": "4",
                        "children": [
                            {
                                "id": "351",
                                "name": "蒙阴县",
                                "cid": "55"
                            },
                            {
                                "id": "352",
                                "name": "费县",
                                "cid": "55"
                            },
                            {
                                "id": "353",
                                "name": "郯城县",
                                "cid": "55"
                            },
                            {
                                "id": "354",
                                "name": "沂南县",
                                "cid": "55"
                            },
                            {
                                "id": "355",
                                "name": "平邑县",
                                "cid": "55"
                            },
                            {
                                "id": "356",
                                "name": "临沭县",
                                "cid": "55"
                            },
                            {
                                "id": "357",
                                "name": "苍山县",
                                "cid": "55"
                            },
                            {
                                "id": "358",
                                "name": "沂水县",
                                "cid": "55"
                            },
                            {
                                "id": "359",
                                "name": "莒南县",
                                "cid": "55"
                            },
                            {
                                "id": "360",
                                "name": "罗庄区",
                                "cid": "55"
                            },
                            {
                                "id": "361",
                                "name": "河东区",
                                "cid": "55"
                            },
                            {
                                "id": "362",
                                "name": "兰山区",
                                "cid": "55"
                            }
                        ]
                    },
                    {
                        "id": "56",
                        "name": "滨州市",
                        "pid": "4",
                        "children": [
                            {
                                "id": "363",
                                "name": "惠民县",
                                "cid": "56"
                            },
                            {
                                "id": "364",
                                "name": "沾化县",
                                "cid": "56"
                            },
                            {
                                "id": "365",
                                "name": "博兴县",
                                "cid": "56"
                            },
                            {
                                "id": "366",
                                "name": "邹平县",
                                "cid": "56"
                            },
                            {
                                "id": "367",
                                "name": "阳信县",
                                "cid": "56"
                            },
                            {
                                "id": "368",
                                "name": "滨城区",
                                "cid": "56"
                            },
                            {
                                "id": "369",
                                "name": "无棣县",
                                "cid": "56"
                            }
                        ]
                    },
                    {
                        "id": "57",
                        "name": "青岛市",
                        "pid": "4",
                        "children": [
                            {
                                "id": "370",
                                "name": "平度市",
                                "cid": "57"
                            },
                            {
                                "id": "371",
                                "name": "黄岛区",
                                "cid": "57"
                            },
                            {
                                "id": "372",
                                "name": "胶南市",
                                "cid": "57"
                            },
                            {
                                "id": "373",
                                "name": "市南区",
                                "cid": "57"
                            },
                            {
                                "id": "374",
                                "name": "莱西市",
                                "cid": "57"
                            },
                            {
                                "id": "375",
                                "name": "李沧区",
                                "cid": "57"
                            },
                            {
                                "id": "376",
                                "name": "即墨市",
                                "cid": "57"
                            },
                            {
                                "id": "377",
                                "name": "四方区",
                                "cid": "57"
                            },
                            {
                                "id": "378",
                                "name": "崂山区",
                                "cid": "57"
                            },
                            {
                                "id": "379",
                                "name": "胶州市",
                                "cid": "57"
                            },
                            {
                                "id": "380",
                                "name": "市北区",
                                "cid": "57"
                            },
                            {
                                "id": "381",
                                "name": "城阳区",
                                "cid": "57"
                            }
                        ]
                    },
                    {
                        "id": "58",
                        "name": "济宁市",
                        "pid": "4",
                        "children": [
                            {
                                "id": "382",
                                "name": "邹城市",
                                "cid": "58"
                            },
                            {
                                "id": "383",
                                "name": "嘉祥县",
                                "cid": "58"
                            },
                            {
                                "id": "384",
                                "name": "泗水县",
                                "cid": "58"
                            },
                            {
                                "id": "385",
                                "name": "汶上县",
                                "cid": "58"
                            },
                            {
                                "id": "386",
                                "name": "曲阜市",
                                "cid": "58"
                            },
                            {
                                "id": "387",
                                "name": "梁山县",
                                "cid": "58"
                            },
                            {
                                "id": "388",
                                "name": "兖州市",
                                "cid": "58"
                            },
                            {
                                "id": "389",
                                "name": "鱼台县",
                                "cid": "58"
                            },
                            {
                                "id": "390",
                                "name": "微山县",
                                "cid": "58"
                            },
                            {
                                "id": "391",
                                "name": "金乡县",
                                "cid": "58"
                            },
                            {
                                "id": "392",
                                "name": "任城区",
                                "cid": "58"
                            },
                            {
                                "id": "393",
                                "name": "市中区",
                                "cid": "58"
                            }
                        ]
                    },
                    {
                        "id": "59",
                        "name": "潍坊市",
                        "pid": "4",
                        "children": [
                            {
                                "id": "394",
                                "name": "安丘市",
                                "cid": "59"
                            },
                            {
                                "id": "395",
                                "name": "寿光市",
                                "cid": "59"
                            },
                            {
                                "id": "396",
                                "name": "临朐县",
                                "cid": "59"
                            },
                            {
                                "id": "397",
                                "name": "昌邑市",
                                "cid": "59"
                            },
                            {
                                "id": "398",
                                "name": "诸城市",
                                "cid": "59"
                            },
                            {
                                "id": "399",
                                "name": "青州市",
                                "cid": "59"
                            },
                            {
                                "id": "400",
                                "name": "昌乐县",
                                "cid": "59"
                            },
                            {
                                "id": "401",
                                "name": "高密市",
                                "cid": "59"
                            },
                            {
                                "id": "402",
                                "name": "潍城区",
                                "cid": "59"
                            },
                            {
                                "id": "403",
                                "name": "奎文区",
                                "cid": "59"
                            },
                            {
                                "id": "404",
                                "name": "坊子区",
                                "cid": "59"
                            },
                            {
                                "id": "405",
                                "name": "寒亭区",
                                "cid": "59"
                            }
                        ]
                    },
                    {
                        "id": "60",
                        "name": "济南市",
                        "pid": "4",
                        "children": [
                            {
                                "id": "406",
                                "name": "平阴县",
                                "cid": "60"
                            },
                            {
                                "id": "407",
                                "name": "历下区",
                                "cid": "60"
                            },
                            {
                                "id": "408",
                                "name": "市中区",
                                "cid": "60"
                            },
                            {
                                "id": "409",
                                "name": "济阳县",
                                "cid": "60"
                            },
                            {
                                "id": "410",
                                "name": "槐荫区",
                                "cid": "60"
                            },
                            {
                                "id": "411",
                                "name": "长清区",
                                "cid": "60"
                            },
                            {
                                "id": "412",
                                "name": "章丘市",
                                "cid": "60"
                            },
                            {
                                "id": "413",
                                "name": "天桥区",
                                "cid": "60"
                            },
                            {
                                "id": "414",
                                "name": "商河县",
                                "cid": "60"
                            },
                            {
                                "id": "415",
                                "name": "历城区",
                                "cid": "60"
                            }
                        ]
                    },
                    {
                        "id": "61",
                        "name": "泰安市",
                        "pid": "4",
                        "children": [
                            {
                                "id": "416",
                                "name": "宁阳县",
                                "cid": "61"
                            },
                            {
                                "id": "417",
                                "name": "新泰市",
                                "cid": "61"
                            },
                            {
                                "id": "418",
                                "name": "东平县",
                                "cid": "61"
                            },
                            {
                                "id": "419",
                                "name": "肥城市",
                                "cid": "61"
                            },
                            {
                                "id": "420",
                                "name": "岱岳区",
                                "cid": "61"
                            },
                            {
                                "id": "421",
                                "name": "泰山区",
                                "cid": "61"
                            }
                        ]
                    },
                    {
                        "id": "62",
                        "name": "烟台市",
                        "pid": "4",
                        "children": [
                            {
                                "id": "422",
                                "name": "莱阳市",
                                "cid": "62"
                            },
                            {
                                "id": "423",
                                "name": "蓬莱市",
                                "cid": "62"
                            },
                            {
                                "id": "424",
                                "name": "海阳市",
                                "cid": "62"
                            },
                            {
                                "id": "425",
                                "name": "长岛县",
                                "cid": "62"
                            },
                            {
                                "id": "426",
                                "name": "龙口市",
                                "cid": "62"
                            },
                            {
                                "id": "427",
                                "name": "莱州市",
                                "cid": "62"
                            },
                            {
                                "id": "428",
                                "name": "栖霞市",
                                "cid": "62"
                            },
                            {
                                "id": "429",
                                "name": "招远市",
                                "cid": "62"
                            },
                            {
                                "id": "430",
                                "name": "莱山区",
                                "cid": "62"
                            },
                            {
                                "id": "431",
                                "name": "福山区",
                                "cid": "62"
                            },
                            {
                                "id": "432",
                                "name": "牟平区",
                                "cid": "62"
                            },
                            {
                                "id": "433",
                                "name": "芝罘区",
                                "cid": "62"
                            }
                        ]
                    },
                    {
                        "id": "63",
                        "name": "菏泽市",
                        "pid": "4",
                        "children": [
                            {
                                "id": "434",
                                "name": "曹县",
                                "cid": "63"
                            },
                            {
                                "id": "435",
                                "name": "鄄城县",
                                "cid": "63"
                            },
                            {
                                "id": "436",
                                "name": "成武县",
                                "cid": "63"
                            },
                            {
                                "id": "437",
                                "name": "郓城县",
                                "cid": "63"
                            },
                            {
                                "id": "438",
                                "name": "定陶县",
                                "cid": "63"
                            },
                            {
                                "id": "439",
                                "name": "东明县",
                                "cid": "63"
                            },
                            {
                                "id": "440",
                                "name": "巨野县",
                                "cid": "63"
                            },
                            {
                                "id": "441",
                                "name": "牡丹区",
                                "cid": "63"
                            },
                            {
                                "id": "442",
                                "name": "单县",
                                "cid": "63"
                            }
                        ]
                    },
                    {
                        "id": "64",
                        "name": "淄博市",
                        "pid": "4",
                        "children": [
                            {
                                "id": "443",
                                "name": "桓台县",
                                "cid": "64"
                            },
                            {
                                "id": "444",
                                "name": "沂源县",
                                "cid": "64"
                            },
                            {
                                "id": "445",
                                "name": "高青县",
                                "cid": "64"
                            },
                            {
                                "id": "446",
                                "name": "博山区",
                                "cid": "64"
                            },
                            {
                                "id": "447",
                                "name": "淄川区",
                                "cid": "64"
                            },
                            {
                                "id": "448",
                                "name": "周村区",
                                "cid": "64"
                            },
                            {
                                "id": "449",
                                "name": "张店区",
                                "cid": "64"
                            },
                            {
                                "id": "450",
                                "name": "临淄区",
                                "cid": "64"
                            }
                        ]
                    },
                    {
                        "id": "65",
                        "name": "聊城市",
                        "pid": "4",
                        "children": [
                            {
                                "id": "451",
                                "name": "阳谷县",
                                "cid": "65"
                            },
                            {
                                "id": "452",
                                "name": "临清市",
                                "cid": "65"
                            },
                            {
                                "id": "453",
                                "name": "东阿县",
                                "cid": "65"
                            },
                            {
                                "id": "454",
                                "name": "高唐县",
                                "cid": "65"
                            },
                            {
                                "id": "455",
                                "name": "冠县",
                                "cid": "65"
                            },
                            {
                                "id": "456",
                                "name": "茌平县",
                                "cid": "65"
                            },
                            {
                                "id": "457",
                                "name": "莘县",
                                "cid": "65"
                            },
                            {
                                "id": "458",
                                "name": "东昌府区",
                                "cid": "65"
                            }
                        ]
                    },
                    {
                        "id": "66",
                        "name": "德州市",
                        "pid": "4",
                        "children": [
                            {
                                "id": "459",
                                "name": "齐河县",
                                "cid": "66"
                            },
                            {
                                "id": "460",
                                "name": "德城区",
                                "cid": "66"
                            },
                            {
                                "id": "461",
                                "name": "平原县",
                                "cid": "66"
                            },
                            {
                                "id": "462",
                                "name": "临邑县",
                                "cid": "66"
                            },
                            {
                                "id": "463",
                                "name": "武城县",
                                "cid": "66"
                            },
                            {
                                "id": "464",
                                "name": "禹城市",
                                "cid": "66"
                            },
                            {
                                "id": "465",
                                "name": "庆云县",
                                "cid": "66"
                            },
                            {
                                "id": "466",
                                "name": "陵县",
                                "cid": "66"
                            },
                            {
                                "id": "467",
                                "name": "乐陵市",
                                "cid": "66"
                            },
                            {
                                "id": "468",
                                "name": "夏津县",
                                "cid": "66"
                            },
                            {
                                "id": "469",
                                "name": "宁津县",
                                "cid": "66"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "10",
                "name": "湖北省",
                "children": [
                    {
                        "id": "120",
                        "name": "鄂州市",
                        "pid": "10",
                        "children": [
                            {
                                "id": "853",
                                "name": "华容区",
                                "cid": "120"
                            },
                            {
                                "id": "854",
                                "name": "梁子湖区",
                                "cid": "120"
                            },
                            {
                                "id": "855",
                                "name": "鄂城区",
                                "cid": "120"
                            }
                        ]
                    },
                    {
                        "id": "121",
                        "name": "襄阳市",
                        "pid": "10",
                        "children": [
                            {
                                "id": "856",
                                "name": "谷城县",
                                "cid": "121"
                            },
                            {
                                "id": "857",
                                "name": "保康县",
                                "cid": "121"
                            },
                            {
                                "id": "858",
                                "name": "宜城市",
                                "cid": "121"
                            },
                            {
                                "id": "859",
                                "name": "南漳县",
                                "cid": "121"
                            },
                            {
                                "id": "860",
                                "name": "枣阳市",
                                "cid": "121"
                            },
                            {
                                "id": "861",
                                "name": "老河口市",
                                "cid": "121"
                            },
                            {
                                "id": "862",
                                "name": "樊城区",
                                "cid": "121"
                            },
                            {
                                "id": "863",
                                "name": "襄城区",
                                "cid": "121"
                            },
                            {
                                "id": "864",
                                "name": "襄阳区",
                                "cid": "121"
                            }
                        ]
                    },
                    {
                        "id": "122",
                        "name": "荆州市",
                        "pid": "10",
                        "children": [
                            {
                                "id": "865",
                                "name": "江陵县",
                                "cid": "122"
                            },
                            {
                                "id": "866",
                                "name": "洪湖市",
                                "cid": "122"
                            },
                            {
                                "id": "867",
                                "name": "监利县",
                                "cid": "122"
                            },
                            {
                                "id": "868",
                                "name": "公安县",
                                "cid": "122"
                            },
                            {
                                "id": "869",
                                "name": "松滋市",
                                "cid": "122"
                            },
                            {
                                "id": "870",
                                "name": "石首市",
                                "cid": "122"
                            },
                            {
                                "id": "871",
                                "name": "沙市区",
                                "cid": "122"
                            },
                            {
                                "id": "872",
                                "name": "荆州区",
                                "cid": "122"
                            }
                        ]
                    },
                    {
                        "id": "123",
                        "name": "十堰市",
                        "pid": "10",
                        "children": [
                            {
                                "id": "873",
                                "name": "郧西县",
                                "cid": "123"
                            },
                            {
                                "id": "874",
                                "name": "竹溪县",
                                "cid": "123"
                            },
                            {
                                "id": "875",
                                "name": "丹江口市",
                                "cid": "123"
                            },
                            {
                                "id": "876",
                                "name": "郧县",
                                "cid": "123"
                            },
                            {
                                "id": "877",
                                "name": "竹山县",
                                "cid": "123"
                            },
                            {
                                "id": "878",
                                "name": "房县",
                                "cid": "123"
                            },
                            {
                                "id": "879",
                                "name": "张湾区",
                                "cid": "123"
                            },
                            {
                                "id": "880",
                                "name": "茅箭区",
                                "cid": "123"
                            }
                        ]
                    },
                    {
                        "id": "124",
                        "name": "荆门市",
                        "pid": "10",
                        "children": [
                            {
                                "id": "881",
                                "name": "京山县",
                                "cid": "124"
                            },
                            {
                                "id": "882",
                                "name": "沙洋县",
                                "cid": "124"
                            },
                            {
                                "id": "883",
                                "name": "钟祥市",
                                "cid": "124"
                            },
                            {
                                "id": "884",
                                "name": "东宝区",
                                "cid": "124"
                            },
                            {
                                "id": "885",
                                "name": "掇刀区",
                                "cid": "124"
                            }
                        ]
                    },
                    {
                        "id": "125",
                        "name": "武汉市",
                        "pid": "10",
                        "children": [
                            {
                                "id": "886",
                                "name": "黄陂区",
                                "cid": "125"
                            },
                            {
                                "id": "887",
                                "name": "江汉区",
                                "cid": "125"
                            },
                            {
                                "id": "888",
                                "name": "新洲区",
                                "cid": "125"
                            },
                            {
                                "id": "889",
                                "name": "江夏区",
                                "cid": "125"
                            },
                            {
                                "id": "890",
                                "name": "江岸区",
                                "cid": "125"
                            },
                            {
                                "id": "891",
                                "name": "东西湖区",
                                "cid": "125"
                            },
                            {
                                "id": "892",
                                "name": "汉南区",
                                "cid": "125"
                            },
                            {
                                "id": "893",
                                "name": "青山区",
                                "cid": "125"
                            },
                            {
                                "id": "894",
                                "name": "洪山区",
                                "cid": "125"
                            },
                            {
                                "id": "895",
                                "name": "蔡甸区",
                                "cid": "125"
                            },
                            {
                                "id": "896",
                                "name": "武昌区",
                                "cid": "125"
                            },
                            {
                                "id": "897",
                                "name": "硚口区",
                                "cid": "125"
                            },
                            {
                                "id": "898",
                                "name": "汉阳区",
                                "cid": "125"
                            }
                        ]
                    },
                    {
                        "id": "126",
                        "name": "宜昌市",
                        "pid": "10",
                        "children": [
                            {
                                "id": "899",
                                "name": "秭归县",
                                "cid": "126"
                            },
                            {
                                "id": "900",
                                "name": "枝江市",
                                "cid": "126"
                            },
                            {
                                "id": "901",
                                "name": "当阳市",
                                "cid": "126"
                            },
                            {
                                "id": "902",
                                "name": "兴山县",
                                "cid": "126"
                            },
                            {
                                "id": "903",
                                "name": "长阳土家族自治县",
                                "cid": "126"
                            },
                            {
                                "id": "904",
                                "name": "宜都市",
                                "cid": "126"
                            },
                            {
                                "id": "905",
                                "name": "远安县",
                                "cid": "126"
                            },
                            {
                                "id": "906",
                                "name": "五峰土家族自治县",
                                "cid": "126"
                            },
                            {
                                "id": "907",
                                "name": "夷陵区",
                                "cid": "126"
                            },
                            {
                                "id": "908",
                                "name": "西陵区",
                                "cid": "126"
                            },
                            {
                                "id": "909",
                                "name": "点军区",
                                "cid": "126"
                            },
                            {
                                "id": "910",
                                "name": "伍家岗区",
                                "cid": "126"
                            },
                            {
                                "id": "911",
                                "name": "猇亭区",
                                "cid": "126"
                            }
                        ]
                    },
                    {
                        "id": "127",
                        "name": "黄冈市",
                        "pid": "10",
                        "children": [
                            {
                                "id": "912",
                                "name": "团风县",
                                "cid": "127"
                            },
                            {
                                "id": "913",
                                "name": "罗田县",
                                "cid": "127"
                            },
                            {
                                "id": "914",
                                "name": "黄梅县",
                                "cid": "127"
                            },
                            {
                                "id": "915",
                                "name": "浠水县",
                                "cid": "127"
                            },
                            {
                                "id": "916",
                                "name": "红安县",
                                "cid": "127"
                            },
                            {
                                "id": "917",
                                "name": "黄州区",
                                "cid": "127"
                            },
                            {
                                "id": "918",
                                "name": "英山县",
                                "cid": "127"
                            },
                            {
                                "id": "919",
                                "name": "麻城市",
                                "cid": "127"
                            },
                            {
                                "id": "920",
                                "name": "蕲春县",
                                "cid": "127"
                            },
                            {
                                "id": "921",
                                "name": "武穴市",
                                "cid": "127"
                            }
                        ]
                    },
                    {
                        "id": "128",
                        "name": "孝感市",
                        "pid": "10",
                        "children": [
                            {
                                "id": "922",
                                "name": "云梦县",
                                "cid": "128"
                            },
                            {
                                "id": "923",
                                "name": "孝南区",
                                "cid": "128"
                            },
                            {
                                "id": "924",
                                "name": "应城市",
                                "cid": "128"
                            },
                            {
                                "id": "925",
                                "name": "大悟县",
                                "cid": "128"
                            },
                            {
                                "id": "926",
                                "name": "孝昌县",
                                "cid": "128"
                            },
                            {
                                "id": "927",
                                "name": "安陆市",
                                "cid": "128"
                            },
                            {
                                "id": "928",
                                "name": "汉川市",
                                "cid": "128"
                            }
                        ]
                    },
                    {
                        "id": "129",
                        "name": "黄石市",
                        "pid": "10",
                        "children": [
                            {
                                "id": "929",
                                "name": "大冶市",
                                "cid": "129"
                            },
                            {
                                "id": "930",
                                "name": "阳新县",
                                "cid": "129"
                            },
                            {
                                "id": "931",
                                "name": "西塞山区",
                                "cid": "129"
                            },
                            {
                                "id": "932",
                                "name": "铁山区",
                                "cid": "129"
                            },
                            {
                                "id": "933",
                                "name": "下陆区",
                                "cid": "129"
                            },
                            {
                                "id": "934",
                                "name": "黄石港区",
                                "cid": "129"
                            }
                        ]
                    },
                    {
                        "id": "130",
                        "name": "咸宁市",
                        "pid": "10",
                        "children": [
                            {
                                "id": "935",
                                "name": "嘉鱼县",
                                "cid": "130"
                            },
                            {
                                "id": "936",
                                "name": "通山县",
                                "cid": "130"
                            },
                            {
                                "id": "937",
                                "name": "咸安区",
                                "cid": "130"
                            },
                            {
                                "id": "938",
                                "name": "通城县",
                                "cid": "130"
                            },
                            {
                                "id": "939",
                                "name": "崇阳县",
                                "cid": "130"
                            },
                            {
                                "id": "940",
                                "name": "赤壁市",
                                "cid": "130"
                            }
                        ]
                    },
                    {
                        "id": "131",
                        "name": "随州市",
                        "pid": "10",
                        "children": [
                            {
                                "id": "941",
                                "name": "广水市",
                                "cid": "131"
                            },
                            {
                                "id": "942",
                                "name": "曾都区",
                                "cid": "131"
                            }
                        ]
                    },
                    {
                        "id": "132",
                        "name": "恩施土家族苗族自治州",
                        "pid": "10",
                        "children": [
                            {
                                "id": "943",
                                "name": "来凤县",
                                "cid": "132"
                            },
                            {
                                "id": "944",
                                "name": "巴东县",
                                "cid": "132"
                            },
                            {
                                "id": "945",
                                "name": "建始县",
                                "cid": "132"
                            },
                            {
                                "id": "946",
                                "name": "恩施市",
                                "cid": "132"
                            },
                            {
                                "id": "947",
                                "name": "咸丰县",
                                "cid": "132"
                            },
                            {
                                "id": "948",
                                "name": "利川市",
                                "cid": "132"
                            },
                            {
                                "id": "949",
                                "name": "宣恩县",
                                "cid": "132"
                            },
                            {
                                "id": "950",
                                "name": "鹤峰县",
                                "cid": "132"
                            }
                        ]
                    },
                    {
                        "id": "133",
                        "name": "潜江市",
                        "pid": "10",
                        "children": []
                    },
                    {
                        "id": "134",
                        "name": "仙桃市",
                        "pid": "10",
                        "children": []
                    },
                    {
                        "id": "135",
                        "name": "天门市",
                        "pid": "10",
                        "children": []
                    },
                    {
                        "id": "136",
                        "name": "神农架林区",
                        "pid": "10",
                        "children": []
                    }
                ]
            },
            {
                "id": "18",
                "name": "安徽省",
                "children": [
                    {
                        "id": "225",
                        "name": "蚌埠市",
                        "pid": "18",
                        "children": [
                            {
                                "id": "1478",
                                "name": "固镇县",
                                "cid": "225"
                            },
                            {
                                "id": "1479",
                                "name": "怀远县",
                                "cid": "225"
                            },
                            {
                                "id": "1480",
                                "name": "五河县",
                                "cid": "225"
                            },
                            {
                                "id": "1481",
                                "name": "淮上区",
                                "cid": "225"
                            },
                            {
                                "id": "1482",
                                "name": "禹会区",
                                "cid": "225"
                            },
                            {
                                "id": "1483",
                                "name": "蚌山区",
                                "cid": "225"
                            },
                            {
                                "id": "1484",
                                "name": "龙子湖区",
                                "cid": "225"
                            }
                        ]
                    },
                    {
                        "id": "226",
                        "name": "合肥市",
                        "pid": "18",
                        "children": [
                            {
                                "id": "1485",
                                "name": "长丰县",
                                "cid": "226"
                            },
                            {
                                "id": "1486",
                                "name": "肥东县",
                                "cid": "226"
                            },
                            {
                                "id": "1487",
                                "name": "肥西县",
                                "cid": "226"
                            },
                            {
                                "id": "1488",
                                "name": "庐阳区",
                                "cid": "226"
                            },
                            {
                                "id": "1489",
                                "name": "瑶海区",
                                "cid": "226"
                            },
                            {
                                "id": "1490",
                                "name": "蜀山区",
                                "cid": "226"
                            },
                            {
                                "id": "1491",
                                "name": "包河区",
                                "cid": "226"
                            }
                        ]
                    },
                    {
                        "id": "227",
                        "name": "阜阳市",
                        "pid": "18",
                        "children": [
                            {
                                "id": "1492",
                                "name": "颍上县",
                                "cid": "227"
                            },
                            {
                                "id": "1493",
                                "name": "太和县",
                                "cid": "227"
                            },
                            {
                                "id": "1494",
                                "name": "界首市",
                                "cid": "227"
                            },
                            {
                                "id": "1495",
                                "name": "阜南县",
                                "cid": "227"
                            },
                            {
                                "id": "1496",
                                "name": "临泉县",
                                "cid": "227"
                            },
                            {
                                "id": "1497",
                                "name": "颍东区",
                                "cid": "227"
                            },
                            {
                                "id": "1498",
                                "name": "颍泉区",
                                "cid": "227"
                            },
                            {
                                "id": "1499",
                                "name": "颍州区",
                                "cid": "227"
                            }
                        ]
                    },
                    {
                        "id": "228",
                        "name": "芜湖市",
                        "pid": "18",
                        "children": [
                            {
                                "id": "1500",
                                "name": "繁昌县",
                                "cid": "228"
                            },
                            {
                                "id": "1501",
                                "name": "芜湖县",
                                "cid": "228"
                            },
                            {
                                "id": "1502",
                                "name": "南陵县",
                                "cid": "228"
                            },
                            {
                                "id": "1503",
                                "name": "弋江区",
                                "cid": "228"
                            },
                            {
                                "id": "1504",
                                "name": "三山区",
                                "cid": "228"
                            },
                            {
                                "id": "1505",
                                "name": "镜湖区",
                                "cid": "228"
                            },
                            {
                                "id": "1506",
                                "name": "鸠江区",
                                "cid": "228"
                            }
                        ]
                    },
                    {
                        "id": "229",
                        "name": "安庆市",
                        "pid": "18",
                        "children": [
                            {
                                "id": "1507",
                                "name": "岳西县",
                                "cid": "229"
                            },
                            {
                                "id": "1508",
                                "name": "宿松县",
                                "cid": "229"
                            },
                            {
                                "id": "1509",
                                "name": "枞阳县",
                                "cid": "229"
                            },
                            {
                                "id": "1510",
                                "name": "怀宁县",
                                "cid": "229"
                            },
                            {
                                "id": "1511",
                                "name": "桐城市",
                                "cid": "229"
                            },
                            {
                                "id": "1512",
                                "name": "太湖县",
                                "cid": "229"
                            },
                            {
                                "id": "1513",
                                "name": "潜山县",
                                "cid": "229"
                            },
                            {
                                "id": "1514",
                                "name": "望江县",
                                "cid": "229"
                            },
                            {
                                "id": "1515",
                                "name": "宜秀区",
                                "cid": "229"
                            },
                            {
                                "id": "1516",
                                "name": "大观区",
                                "cid": "229"
                            },
                            {
                                "id": "1517",
                                "name": "迎江区",
                                "cid": "229"
                            }
                        ]
                    },
                    {
                        "id": "230",
                        "name": "亳州市",
                        "pid": "18",
                        "children": [
                            {
                                "id": "1518",
                                "name": "蒙城县",
                                "cid": "230"
                            },
                            {
                                "id": "1519",
                                "name": "利辛县",
                                "cid": "230"
                            },
                            {
                                "id": "1520",
                                "name": "谯城区",
                                "cid": "230"
                            },
                            {
                                "id": "1521",
                                "name": "涡阳县",
                                "cid": "230"
                            }
                        ]
                    },
                    {
                        "id": "231",
                        "name": "滁州市",
                        "pid": "18",
                        "children": [
                            {
                                "id": "1522",
                                "name": "定远县",
                                "cid": "231"
                            },
                            {
                                "id": "1523",
                                "name": "天长市",
                                "cid": "231"
                            },
                            {
                                "id": "1524",
                                "name": "凤阳县",
                                "cid": "231"
                            },
                            {
                                "id": "1525",
                                "name": "来安县",
                                "cid": "231"
                            },
                            {
                                "id": "1526",
                                "name": "明光市",
                                "cid": "231"
                            },
                            {
                                "id": "1527",
                                "name": "全椒县",
                                "cid": "231"
                            },
                            {
                                "id": "1528",
                                "name": "琅琊区",
                                "cid": "231"
                            },
                            {
                                "id": "1529",
                                "name": "南谯区",
                                "cid": "231"
                            }
                        ]
                    },
                    {
                        "id": "232",
                        "name": "宣城市",
                        "pid": "18",
                        "children": [
                            {
                                "id": "1530",
                                "name": "泾县",
                                "cid": "232"
                            },
                            {
                                "id": "1531",
                                "name": "绩溪县",
                                "cid": "232"
                            },
                            {
                                "id": "1532",
                                "name": "宣州区",
                                "cid": "232"
                            },
                            {
                                "id": "1533",
                                "name": "旌德县",
                                "cid": "232"
                            },
                            {
                                "id": "1534",
                                "name": "郎溪县",
                                "cid": "232"
                            },
                            {
                                "id": "1535",
                                "name": "宁国市",
                                "cid": "232"
                            },
                            {
                                "id": "1536",
                                "name": "广德县",
                                "cid": "232"
                            }
                        ]
                    },
                    {
                        "id": "233",
                        "name": "淮南市",
                        "pid": "18",
                        "children": [
                            {
                                "id": "1537",
                                "name": "凤台县",
                                "cid": "233"
                            },
                            {
                                "id": "1538",
                                "name": "大通区",
                                "cid": "233"
                            },
                            {
                                "id": "1539",
                                "name": "田家庵区",
                                "cid": "233"
                            },
                            {
                                "id": "1540",
                                "name": "谢家集区",
                                "cid": "233"
                            },
                            {
                                "id": "1541",
                                "name": "潘集区",
                                "cid": "233"
                            },
                            {
                                "id": "1542",
                                "name": "八公山区",
                                "cid": "233"
                            }
                        ]
                    },
                    {
                        "id": "234",
                        "name": "巢湖市",
                        "pid": "18",
                        "children": [
                            {
                                "id": "1543",
                                "name": "含山县",
                                "cid": "234"
                            },
                            {
                                "id": "1544",
                                "name": "庐江县",
                                "cid": "234"
                            },
                            {
                                "id": "1545",
                                "name": "和县",
                                "cid": "234"
                            },
                            {
                                "id": "1546",
                                "name": "无为县",
                                "cid": "234"
                            },
                            {
                                "id": "1547",
                                "name": "居巢区",
                                "cid": "234"
                            }
                        ]
                    },
                    {
                        "id": "235",
                        "name": "黄山市",
                        "pid": "18",
                        "children": [
                            {
                                "id": "1548",
                                "name": "黟县",
                                "cid": "235"
                            },
                            {
                                "id": "1549",
                                "name": "歙县",
                                "cid": "235"
                            },
                            {
                                "id": "1550",
                                "name": "休宁县",
                                "cid": "235"
                            },
                            {
                                "id": "1551",
                                "name": "祁门县",
                                "cid": "235"
                            },
                            {
                                "id": "1552",
                                "name": "黄山区",
                                "cid": "235"
                            },
                            {
                                "id": "1553",
                                "name": "徽州区",
                                "cid": "235"
                            },
                            {
                                "id": "1554",
                                "name": "屯溪区",
                                "cid": "235"
                            }
                        ]
                    },
                    {
                        "id": "236",
                        "name": "淮北市",
                        "pid": "18",
                        "children": [
                            {
                                "id": "1555",
                                "name": "濉溪县",
                                "cid": "236"
                            },
                            {
                                "id": "1556",
                                "name": "烈山区",
                                "cid": "236"
                            },
                            {
                                "id": "1557",
                                "name": "杜集区",
                                "cid": "236"
                            },
                            {
                                "id": "1558",
                                "name": "相山区",
                                "cid": "236"
                            }
                        ]
                    },
                    {
                        "id": "237",
                        "name": "六安市",
                        "pid": "18",
                        "children": [
                            {
                                "id": "1559",
                                "name": "霍山县",
                                "cid": "237"
                            },
                            {
                                "id": "1560",
                                "name": "寿县",
                                "cid": "237"
                            },
                            {
                                "id": "1561",
                                "name": "金寨县",
                                "cid": "237"
                            },
                            {
                                "id": "1562",
                                "name": "霍邱县",
                                "cid": "237"
                            },
                            {
                                "id": "1563",
                                "name": "舒城县",
                                "cid": "237"
                            },
                            {
                                "id": "1564",
                                "name": "金安区",
                                "cid": "237"
                            },
                            {
                                "id": "1565",
                                "name": "裕安区",
                                "cid": "237"
                            }
                        ]
                    },
                    {
                        "id": "238",
                        "name": "池州市",
                        "pid": "18",
                        "children": [
                            {
                                "id": "1566",
                                "name": "贵池区",
                                "cid": "238"
                            },
                            {
                                "id": "1567",
                                "name": "东至县",
                                "cid": "238"
                            },
                            {
                                "id": "1568",
                                "name": "青阳县",
                                "cid": "238"
                            },
                            {
                                "id": "1569",
                                "name": "石台县",
                                "cid": "238"
                            }
                        ]
                    },
                    {
                        "id": "239",
                        "name": "铜陵市",
                        "pid": "18",
                        "children": [
                            {
                                "id": "1570",
                                "name": "铜陵县",
                                "cid": "239"
                            },
                            {
                                "id": "1571",
                                "name": "狮子山区",
                                "cid": "239"
                            },
                            {
                                "id": "1572",
                                "name": "铜官山区",
                                "cid": "239"
                            },
                            {
                                "id": "1573",
                                "name": "郊区",
                                "cid": "239"
                            }
                        ]
                    },
                    {
                        "id": "240",
                        "name": "马鞍山市",
                        "pid": "18",
                        "children": [
                            {
                                "id": "1574",
                                "name": "当涂县",
                                "cid": "240"
                            },
                            {
                                "id": "1575",
                                "name": "雨山区",
                                "cid": "240"
                            },
                            {
                                "id": "1576",
                                "name": "金家庄区",
                                "cid": "240"
                            },
                            {
                                "id": "1577",
                                "name": "花山区",
                                "cid": "240"
                            }
                        ]
                    },
                    {
                        "id": "241",
                        "name": "宿州市",
                        "pid": "18",
                        "children": [
                            {
                                "id": "1578",
                                "name": "泗县",
                                "cid": "241"
                            },
                            {
                                "id": "1579",
                                "name": "砀山县",
                                "cid": "241"
                            },
                            {
                                "id": "1580",
                                "name": "灵璧县",
                                "cid": "241"
                            },
                            {
                                "id": "1581",
                                "name": "萧县",
                                "cid": "241"
                            },
                            {
                                "id": "1582",
                                "name": "埇桥区",
                                "cid": "241"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "8",
                "name": "新疆维吾尔自治区",
                "children": [
                    {
                        "id": "95",
                        "name": "和田地区",
                        "pid": "8",
                        "children": [
                            {
                                "id": "686",
                                "name": "民丰县",
                                "cid": "95"
                            },
                            {
                                "id": "687",
                                "name": "策勒县",
                                "cid": "95"
                            },
                            {
                                "id": "688",
                                "name": "皮山县",
                                "cid": "95"
                            },
                            {
                                "id": "689",
                                "name": "洛浦县",
                                "cid": "95"
                            },
                            {
                                "id": "690",
                                "name": "墨玉县",
                                "cid": "95"
                            },
                            {
                                "id": "691",
                                "name": "和田市",
                                "cid": "95"
                            },
                            {
                                "id": "692",
                                "name": "和田县",
                                "cid": "95"
                            },
                            {
                                "id": "693",
                                "name": "于田县",
                                "cid": "95"
                            }
                        ]
                    },
                    {
                        "id": "96",
                        "name": "喀什地区",
                        "pid": "8",
                        "children": [
                            {
                                "id": "694",
                                "name": "塔什库尔干塔吉克自治县",
                                "cid": "96"
                            },
                            {
                                "id": "695",
                                "name": "叶城县",
                                "cid": "96"
                            },
                            {
                                "id": "696",
                                "name": "泽普县",
                                "cid": "96"
                            },
                            {
                                "id": "697",
                                "name": "英吉沙县",
                                "cid": "96"
                            },
                            {
                                "id": "698",
                                "name": "麦盖提县",
                                "cid": "96"
                            },
                            {
                                "id": "699",
                                "name": "巴楚县",
                                "cid": "96"
                            },
                            {
                                "id": "700",
                                "name": "莎车县",
                                "cid": "96"
                            },
                            {
                                "id": "701",
                                "name": "疏勒县",
                                "cid": "96"
                            },
                            {
                                "id": "702",
                                "name": "伽师县",
                                "cid": "96"
                            },
                            {
                                "id": "703",
                                "name": "岳普湖县",
                                "cid": "96"
                            },
                            {
                                "id": "704",
                                "name": "喀什市",
                                "cid": "96"
                            },
                            {
                                "id": "705",
                                "name": "疏附县",
                                "cid": "96"
                            }
                        ]
                    },
                    {
                        "id": "97",
                        "name": "克孜勒苏柯尔克孜自治州",
                        "pid": "8",
                        "children": [
                            {
                                "id": "706",
                                "name": "阿克陶县",
                                "cid": "97"
                            },
                            {
                                "id": "707",
                                "name": "乌恰县",
                                "cid": "97"
                            },
                            {
                                "id": "708",
                                "name": "阿图什市",
                                "cid": "97"
                            },
                            {
                                "id": "709",
                                "name": "阿合奇县",
                                "cid": "97"
                            }
                        ]
                    },
                    {
                        "id": "98",
                        "name": "阿克苏地区",
                        "pid": "8",
                        "children": [
                            {
                                "id": "710",
                                "name": "阿瓦提县",
                                "cid": "98"
                            },
                            {
                                "id": "711",
                                "name": "沙雅县",
                                "cid": "98"
                            },
                            {
                                "id": "712",
                                "name": "柯坪县",
                                "cid": "98"
                            },
                            {
                                "id": "713",
                                "name": "库车县",
                                "cid": "98"
                            },
                            {
                                "id": "714",
                                "name": "乌什县",
                                "cid": "98"
                            },
                            {
                                "id": "715",
                                "name": "新和县",
                                "cid": "98"
                            },
                            {
                                "id": "716",
                                "name": "温宿县",
                                "cid": "98"
                            },
                            {
                                "id": "717",
                                "name": "拜城县",
                                "cid": "98"
                            },
                            {
                                "id": "718",
                                "name": "阿克苏市",
                                "cid": "98"
                            }
                        ]
                    },
                    {
                        "id": "99",
                        "name": "巴音郭楞蒙古自治州",
                        "pid": "8",
                        "children": [
                            {
                                "id": "719",
                                "name": "尉犁县",
                                "cid": "99"
                            },
                            {
                                "id": "720",
                                "name": "库尔勒市",
                                "cid": "99"
                            },
                            {
                                "id": "721",
                                "name": "轮台县",
                                "cid": "99"
                            },
                            {
                                "id": "722",
                                "name": "和硕县",
                                "cid": "99"
                            },
                            {
                                "id": "723",
                                "name": "博湖县",
                                "cid": "99"
                            },
                            {
                                "id": "724",
                                "name": "焉耆回族自治县",
                                "cid": "99"
                            },
                            {
                                "id": "725",
                                "name": "和静县",
                                "cid": "99"
                            },
                            {
                                "id": "726",
                                "name": "若羌县",
                                "cid": "99"
                            },
                            {
                                "id": "727",
                                "name": "且末县",
                                "cid": "99"
                            }
                        ]
                    },
                    {
                        "id": "100",
                        "name": "博尔塔拉蒙古自治州",
                        "pid": "8",
                        "children": [
                            {
                                "id": "728",
                                "name": "温泉县",
                                "cid": "100"
                            },
                            {
                                "id": "729",
                                "name": "精河县",
                                "cid": "100"
                            },
                            {
                                "id": "730",
                                "name": "博乐市",
                                "cid": "100"
                            }
                        ]
                    },
                    {
                        "id": "101",
                        "name": "吐鲁番地区",
                        "pid": "8",
                        "children": [
                            {
                                "id": "731",
                                "name": "鄯善县",
                                "cid": "101"
                            },
                            {
                                "id": "732",
                                "name": "托克逊县",
                                "cid": "101"
                            },
                            {
                                "id": "733",
                                "name": "吐鲁番市",
                                "cid": "101"
                            }
                        ]
                    },
                    {
                        "id": "102",
                        "name": "伊犁哈萨克自治州",
                        "pid": "8",
                        "children": [
                            {
                                "id": "734",
                                "name": "特克斯县",
                                "cid": "102"
                            },
                            {
                                "id": "735",
                                "name": "昭苏县",
                                "cid": "102"
                            },
                            {
                                "id": "736",
                                "name": "巩留县",
                                "cid": "102"
                            },
                            {
                                "id": "737",
                                "name": "新源县",
                                "cid": "102"
                            },
                            {
                                "id": "738",
                                "name": "察布查尔锡伯自治县",
                                "cid": "102"
                            },
                            {
                                "id": "739",
                                "name": "尼勒克县",
                                "cid": "102"
                            },
                            {
                                "id": "740",
                                "name": "伊宁县",
                                "cid": "102"
                            },
                            {
                                "id": "741",
                                "name": "霍城县",
                                "cid": "102"
                            },
                            {
                                "id": "742",
                                "name": "伊宁市",
                                "cid": "102"
                            },
                            {
                                "id": "743",
                                "name": "奎屯市",
                                "cid": "102"
                            }
                        ]
                    },
                    {
                        "id": "103",
                        "name": "哈密地区",
                        "pid": "8",
                        "children": [
                            {
                                "id": "744",
                                "name": "伊吾县",
                                "cid": "103"
                            },
                            {
                                "id": "745",
                                "name": "巴里坤哈萨克自治县",
                                "cid": "103"
                            },
                            {
                                "id": "746",
                                "name": "哈密市",
                                "cid": "103"
                            }
                        ]
                    },
                    {
                        "id": "104",
                        "name": "乌鲁木齐市",
                        "pid": "8",
                        "children": [
                            {
                                "id": "747",
                                "name": "达坂城区",
                                "cid": "104"
                            },
                            {
                                "id": "748",
                                "name": "乌鲁木齐县",
                                "cid": "104"
                            },
                            {
                                "id": "749",
                                "name": "水磨沟区",
                                "cid": "104"
                            },
                            {
                                "id": "750",
                                "name": "米东区",
                                "cid": "104"
                            },
                            {
                                "id": "751",
                                "name": "头屯河区",
                                "cid": "104"
                            },
                            {
                                "id": "752",
                                "name": "新市区",
                                "cid": "104"
                            },
                            {
                                "id": "753",
                                "name": "沙依巴克区",
                                "cid": "104"
                            },
                            {
                                "id": "754",
                                "name": "天山区",
                                "cid": "104"
                            }
                        ]
                    },
                    {
                        "id": "105",
                        "name": "昌吉回族自治州",
                        "pid": "8",
                        "children": [
                            {
                                "id": "755",
                                "name": "呼图壁县",
                                "cid": "105"
                            },
                            {
                                "id": "756",
                                "name": "昌吉市",
                                "cid": "105"
                            },
                            {
                                "id": "757",
                                "name": "木垒哈萨克自治县",
                                "cid": "105"
                            },
                            {
                                "id": "758",
                                "name": "玛纳斯县",
                                "cid": "105"
                            },
                            {
                                "id": "759",
                                "name": "阜康市",
                                "cid": "105"
                            },
                            {
                                "id": "760",
                                "name": "吉木萨尔县",
                                "cid": "105"
                            },
                            {
                                "id": "761",
                                "name": "奇台县",
                                "cid": "105"
                            }
                        ]
                    },
                    {
                        "id": "106",
                        "name": "塔城地区",
                        "pid": "8",
                        "children": [
                            {
                                "id": "762",
                                "name": "沙湾县",
                                "cid": "106"
                            },
                            {
                                "id": "763",
                                "name": "乌苏市",
                                "cid": "106"
                            },
                            {
                                "id": "764",
                                "name": "托里县",
                                "cid": "106"
                            },
                            {
                                "id": "765",
                                "name": "和布克赛尔蒙古自治县",
                                "cid": "106"
                            },
                            {
                                "id": "766",
                                "name": "裕民县",
                                "cid": "106"
                            },
                            {
                                "id": "767",
                                "name": "额敏县",
                                "cid": "106"
                            },
                            {
                                "id": "768",
                                "name": "塔城市",
                                "cid": "106"
                            }
                        ]
                    },
                    {
                        "id": "107",
                        "name": "克拉玛依市",
                        "pid": "8",
                        "children": [
                            {
                                "id": "769",
                                "name": "独山子区",
                                "cid": "107"
                            },
                            {
                                "id": "770",
                                "name": "克拉玛依区",
                                "cid": "107"
                            },
                            {
                                "id": "771",
                                "name": "白碱滩区",
                                "cid": "107"
                            },
                            {
                                "id": "772",
                                "name": "乌尔禾区",
                                "cid": "107"
                            }
                        ]
                    },
                    {
                        "id": "108",
                        "name": "阿勒泰地区",
                        "pid": "8",
                        "children": [
                            {
                                "id": "773",
                                "name": "福海县",
                                "cid": "108"
                            },
                            {
                                "id": "774",
                                "name": "青河县",
                                "cid": "108"
                            },
                            {
                                "id": "775",
                                "name": "富蕴县",
                                "cid": "108"
                            },
                            {
                                "id": "776",
                                "name": "阿勒泰市",
                                "cid": "108"
                            },
                            {
                                "id": "777",
                                "name": "吉木乃县",
                                "cid": "108"
                            },
                            {
                                "id": "778",
                                "name": "布尔津县",
                                "cid": "108"
                            },
                            {
                                "id": "779",
                                "name": "哈巴河县",
                                "cid": "108"
                            }
                        ]
                    },
                    {
                        "id": "109",
                        "name": "阿拉尔市",
                        "pid": "8",
                        "children": []
                    },
                    {
                        "id": "110",
                        "name": "石河子市",
                        "pid": "8",
                        "children": []
                    },
                    {
                        "id": "111",
                        "name": "五家渠市",
                        "pid": "8",
                        "children": []
                    },
                    {
                        "id": "112",
                        "name": "图木舒克市",
                        "pid": "8",
                        "children": []
                    }
                ]
            },
            {
                "id": "25",
                "name": "河南省",
                "children": [
                    {
                        "id": "313",
                        "name": "新乡市",
                        "pid": "25",
                        "children": [
                            {
                                "id": "2291",
                                "name": "延津县",
                                "cid": "313"
                            },
                            {
                                "id": "2292",
                                "name": "辉县市",
                                "cid": "313"
                            },
                            {
                                "id": "2293",
                                "name": "长垣县",
                                "cid": "313"
                            },
                            {
                                "id": "2294",
                                "name": "卫辉市",
                                "cid": "313"
                            },
                            {
                                "id": "2295",
                                "name": "获嘉县",
                                "cid": "313"
                            },
                            {
                                "id": "2296",
                                "name": "原阳县",
                                "cid": "313"
                            },
                            {
                                "id": "2297",
                                "name": "新乡县",
                                "cid": "313"
                            },
                            {
                                "id": "2298",
                                "name": "封丘县",
                                "cid": "313"
                            },
                            {
                                "id": "2299",
                                "name": "凤泉区",
                                "cid": "313"
                            },
                            {
                                "id": "2300",
                                "name": "牧野区",
                                "cid": "313"
                            },
                            {
                                "id": "2301",
                                "name": "红旗区",
                                "cid": "313"
                            },
                            {
                                "id": "2302",
                                "name": "卫滨区",
                                "cid": "313"
                            }
                        ]
                    },
                    {
                        "id": "314",
                        "name": "洛阳市",
                        "pid": "25",
                        "children": [
                            {
                                "id": "2303",
                                "name": "偃师市",
                                "cid": "314"
                            },
                            {
                                "id": "2304",
                                "name": "汝阳县",
                                "cid": "314"
                            },
                            {
                                "id": "2305",
                                "name": "新安县",
                                "cid": "314"
                            },
                            {
                                "id": "2306",
                                "name": "吉利区",
                                "cid": "314"
                            },
                            {
                                "id": "2307",
                                "name": "宜阳县",
                                "cid": "314"
                            },
                            {
                                "id": "2308",
                                "name": "栾川县",
                                "cid": "314"
                            },
                            {
                                "id": "2309",
                                "name": "孟津县",
                                "cid": "314"
                            },
                            {
                                "id": "2310",
                                "name": "嵩县",
                                "cid": "314"
                            },
                            {
                                "id": "2311",
                                "name": "洛宁县",
                                "cid": "314"
                            },
                            {
                                "id": "2312",
                                "name": "伊川县",
                                "cid": "314"
                            },
                            {
                                "id": "2313",
                                "name": "涧西区",
                                "cid": "314"
                            },
                            {
                                "id": "2314",
                                "name": "洛龙区",
                                "cid": "314"
                            },
                            {
                                "id": "2315",
                                "name": "西工区",
                                "cid": "314"
                            },
                            {
                                "id": "2316",
                                "name": "老城区",
                                "cid": "314"
                            },
                            {
                                "id": "2317",
                                "name": "瀍河回族区",
                                "cid": "314"
                            }
                        ]
                    },
                    {
                        "id": "315",
                        "name": "商丘市",
                        "pid": "25",
                        "children": [
                            {
                                "id": "2318",
                                "name": "永城市",
                                "cid": "315"
                            },
                            {
                                "id": "2319",
                                "name": "柘城县",
                                "cid": "315"
                            },
                            {
                                "id": "2320",
                                "name": "夏邑县",
                                "cid": "315"
                            },
                            {
                                "id": "2321",
                                "name": "睢县",
                                "cid": "315"
                            },
                            {
                                "id": "2322",
                                "name": "虞城县",
                                "cid": "315"
                            },
                            {
                                "id": "2323",
                                "name": "宁陵县",
                                "cid": "315"
                            },
                            {
                                "id": "2324",
                                "name": "民权县",
                                "cid": "315"
                            },
                            {
                                "id": "2325",
                                "name": "睢阳区",
                                "cid": "315"
                            },
                            {
                                "id": "2326",
                                "name": "梁园区",
                                "cid": "315"
                            }
                        ]
                    },
                    {
                        "id": "316",
                        "name": "许昌市",
                        "pid": "25",
                        "children": [
                            {
                                "id": "2327",
                                "name": "长葛市",
                                "cid": "316"
                            },
                            {
                                "id": "2328",
                                "name": "魏都区",
                                "cid": "316"
                            },
                            {
                                "id": "2329",
                                "name": "许昌县",
                                "cid": "316"
                            },
                            {
                                "id": "2330",
                                "name": "鄢陵县",
                                "cid": "316"
                            },
                            {
                                "id": "2331",
                                "name": "襄城县",
                                "cid": "316"
                            },
                            {
                                "id": "2332",
                                "name": "禹州市",
                                "cid": "316"
                            }
                        ]
                    },
                    {
                        "id": "317",
                        "name": "濮阳市",
                        "pid": "25",
                        "children": [
                            {
                                "id": "2333",
                                "name": "华龙区",
                                "cid": "317"
                            },
                            {
                                "id": "2334",
                                "name": "南乐县",
                                "cid": "317"
                            },
                            {
                                "id": "2335",
                                "name": "台前县",
                                "cid": "317"
                            },
                            {
                                "id": "2336",
                                "name": "清丰县",
                                "cid": "317"
                            },
                            {
                                "id": "2337",
                                "name": "范县",
                                "cid": "317"
                            },
                            {
                                "id": "2338",
                                "name": "濮阳县",
                                "cid": "317"
                            }
                        ]
                    },
                    {
                        "id": "318",
                        "name": "开封市",
                        "pid": "25",
                        "children": [
                            {
                                "id": "2339",
                                "name": "开封县",
                                "cid": "318"
                            },
                            {
                                "id": "2340",
                                "name": "兰考县",
                                "cid": "318"
                            },
                            {
                                "id": "2341",
                                "name": "通许县",
                                "cid": "318"
                            },
                            {
                                "id": "2342",
                                "name": "杞县",
                                "cid": "318"
                            },
                            {
                                "id": "2343",
                                "name": "尉氏县",
                                "cid": "318"
                            },
                            {
                                "id": "2344",
                                "name": "市辖区",
                                "cid": "318"
                            }
                        ]
                    },
                    {
                        "id": "319",
                        "name": "焦作市",
                        "pid": "25",
                        "children": [
                            {
                                "id": "2345",
                                "name": "温县",
                                "cid": "319"
                            },
                            {
                                "id": "2346",
                                "name": "博爱县",
                                "cid": "319"
                            },
                            {
                                "id": "2347",
                                "name": "沁阳市",
                                "cid": "319"
                            },
                            {
                                "id": "2348",
                                "name": "修武县",
                                "cid": "319"
                            },
                            {
                                "id": "2349",
                                "name": "孟州市",
                                "cid": "319"
                            },
                            {
                                "id": "2350",
                                "name": "武陟县",
                                "cid": "319"
                            },
                            {
                                "id": "2351",
                                "name": "中站区",
                                "cid": "319"
                            },
                            {
                                "id": "2352",
                                "name": "解放区",
                                "cid": "319"
                            },
                            {
                                "id": "2353",
                                "name": "山阳区",
                                "cid": "319"
                            },
                            {
                                "id": "2354",
                                "name": "马村区",
                                "cid": "319"
                            }
                        ]
                    },
                    {
                        "id": "320",
                        "name": "三门峡市",
                        "pid": "25",
                        "children": [
                            {
                                "id": "2355",
                                "name": "渑池县",
                                "cid": "320"
                            },
                            {
                                "id": "2356",
                                "name": "灵宝市",
                                "cid": "320"
                            },
                            {
                                "id": "2357",
                                "name": "卢氏县",
                                "cid": "320"
                            },
                            {
                                "id": "2358",
                                "name": "陕县",
                                "cid": "320"
                            },
                            {
                                "id": "2359",
                                "name": "湖滨区",
                                "cid": "320"
                            },
                            {
                                "id": "2360",
                                "name": "义马市",
                                "cid": "320"
                            }
                        ]
                    },
                    {
                        "id": "321",
                        "name": "平顶山市",
                        "pid": "25",
                        "children": [
                            {
                                "id": "3180",
                                "name": "新华区",
                                "cid": "321"
                            },
                            {
                                "id": "3181",
                                "name": "卫东区",
                                "cid": "321"
                            },
                            {
                                "id": "3182",
                                "name": "石龙区",
                                "cid": "321"
                            },
                            {
                                "id": "3183",
                                "name": "湛河区",
                                "cid": "321"
                            },
                            {
                                "id": "3184",
                                "name": "宝丰县",
                                "cid": "321"
                            },
                            {
                                "id": "3185",
                                "name": "叶县",
                                "cid": "321"
                            },
                            {
                                "id": "3186",
                                "name": "鲁山县",
                                "cid": "321"
                            },
                            {
                                "id": "3187",
                                "name": "郏县",
                                "cid": "321"
                            },
                            {
                                "id": "3188",
                                "name": "舞钢市",
                                "cid": "321"
                            }
                        ]
                    },
                    {
                        "id": "322",
                        "name": "信阳市",
                        "pid": "25",
                        "children": [
                            {
                                "id": "2361",
                                "name": "淮滨县",
                                "cid": "322"
                            },
                            {
                                "id": "2362",
                                "name": "新县",
                                "cid": "322"
                            },
                            {
                                "id": "2363",
                                "name": "息县",
                                "cid": "322"
                            },
                            {
                                "id": "2364",
                                "name": "固始县",
                                "cid": "322"
                            },
                            {
                                "id": "2365",
                                "name": "潢川县",
                                "cid": "322"
                            },
                            {
                                "id": "2366",
                                "name": "罗山县",
                                "cid": "322"
                            },
                            {
                                "id": "2367",
                                "name": "光山县",
                                "cid": "322"
                            },
                            {
                                "id": "2368",
                                "name": "商城县",
                                "cid": "322"
                            },
                            {
                                "id": "2369",
                                "name": "平桥区",
                                "cid": "322"
                            },
                            {
                                "id": "2370",
                                "name": "浉河区",
                                "cid": "322"
                            }
                        ]
                    },
                    {
                        "id": "323",
                        "name": "鹤壁市",
                        "pid": "25",
                        "children": [
                            {
                                "id": "2371",
                                "name": "淇县",
                                "cid": "323"
                            },
                            {
                                "id": "2372",
                                "name": "浚县",
                                "cid": "323"
                            },
                            {
                                "id": "2373",
                                "name": "鹤山区",
                                "cid": "323"
                            },
                            {
                                "id": "2374",
                                "name": "山城区",
                                "cid": "323"
                            },
                            {
                                "id": "2375",
                                "name": "淇滨区",
                                "cid": "323"
                            }
                        ]
                    },
                    {
                        "id": "324",
                        "name": "安阳市",
                        "pid": "25",
                        "children": [
                            {
                                "id": "2376",
                                "name": "滑县",
                                "cid": "324"
                            },
                            {
                                "id": "2377",
                                "name": "汤阴县",
                                "cid": "324"
                            },
                            {
                                "id": "2378",
                                "name": "安阳县",
                                "cid": "324"
                            },
                            {
                                "id": "2379",
                                "name": "林州市",
                                "cid": "324"
                            },
                            {
                                "id": "2380",
                                "name": "内黄县",
                                "cid": "324"
                            },
                            {
                                "id": "2381",
                                "name": "龙安区",
                                "cid": "324"
                            },
                            {
                                "id": "2382",
                                "name": "文峰区",
                                "cid": "324"
                            },
                            {
                                "id": "2383",
                                "name": "殷都区",
                                "cid": "324"
                            },
                            {
                                "id": "2384",
                                "name": "北关区",
                                "cid": "324"
                            }
                        ]
                    },
                    {
                        "id": "325",
                        "name": "郑州市",
                        "pid": "25",
                        "children": [
                            {
                                "id": "2385",
                                "name": "上街区",
                                "cid": "325"
                            },
                            {
                                "id": "2386",
                                "name": "中牟县",
                                "cid": "325"
                            },
                            {
                                "id": "2387",
                                "name": "巩义市",
                                "cid": "325"
                            },
                            {
                                "id": "2388",
                                "name": "荥阳市",
                                "cid": "325"
                            },
                            {
                                "id": "2389",
                                "name": "登封市",
                                "cid": "325"
                            },
                            {
                                "id": "2390",
                                "name": "新密市",
                                "cid": "325"
                            },
                            {
                                "id": "2391",
                                "name": "新郑市",
                                "cid": "325"
                            },
                            {
                                "id": "2392",
                                "name": "金水区",
                                "cid": "325"
                            },
                            {
                                "id": "2393",
                                "name": "管城回族区",
                                "cid": "325"
                            },
                            {
                                "id": "2394",
                                "name": "二七区",
                                "cid": "325"
                            },
                            {
                                "id": "2395",
                                "name": "中原区",
                                "cid": "325"
                            },
                            {
                                "id": "2396",
                                "name": "惠济区",
                                "cid": "325"
                            }
                        ]
                    },
                    {
                        "id": "326",
                        "name": "驻马店市",
                        "pid": "25",
                        "children": [
                            {
                                "id": "2397",
                                "name": "西平县",
                                "cid": "326"
                            },
                            {
                                "id": "2398",
                                "name": "汝南县",
                                "cid": "326"
                            },
                            {
                                "id": "2399",
                                "name": "遂平县",
                                "cid": "326"
                            },
                            {
                                "id": "2400",
                                "name": "确山县",
                                "cid": "326"
                            },
                            {
                                "id": "2401",
                                "name": "驿城区",
                                "cid": "326"
                            },
                            {
                                "id": "2402",
                                "name": "新蔡县",
                                "cid": "326"
                            },
                            {
                                "id": "2403",
                                "name": "上蔡县",
                                "cid": "326"
                            },
                            {
                                "id": "2404",
                                "name": "泌阳县",
                                "cid": "326"
                            },
                            {
                                "id": "2405",
                                "name": "正阳县",
                                "cid": "326"
                            },
                            {
                                "id": "2406",
                                "name": "平舆县",
                                "cid": "326"
                            }
                        ]
                    },
                    {
                        "id": "327",
                        "name": "周口市",
                        "pid": "25",
                        "children": [
                            {
                                "id": "2407",
                                "name": "淮阳县",
                                "cid": "327"
                            },
                            {
                                "id": "2408",
                                "name": "扶沟县",
                                "cid": "327"
                            },
                            {
                                "id": "2409",
                                "name": "太康县",
                                "cid": "327"
                            },
                            {
                                "id": "2410",
                                "name": "项城市",
                                "cid": "327"
                            },
                            {
                                "id": "2411",
                                "name": "川汇区",
                                "cid": "327"
                            },
                            {
                                "id": "2412",
                                "name": "商水县",
                                "cid": "327"
                            },
                            {
                                "id": "2413",
                                "name": "沈丘县",
                                "cid": "327"
                            },
                            {
                                "id": "2414",
                                "name": "西华县",
                                "cid": "327"
                            },
                            {
                                "id": "2415",
                                "name": "鹿邑县",
                                "cid": "327"
                            },
                            {
                                "id": "2416",
                                "name": "郸城县",
                                "cid": "327"
                            }
                        ]
                    },
                    {
                        "id": "328",
                        "name": "南阳市",
                        "pid": "25",
                        "children": [
                            {
                                "id": "2417",
                                "name": "方城县",
                                "cid": "328"
                            },
                            {
                                "id": "2418",
                                "name": "镇平县",
                                "cid": "328"
                            },
                            {
                                "id": "2419",
                                "name": "西峡县",
                                "cid": "328"
                            },
                            {
                                "id": "2420",
                                "name": "桐柏县",
                                "cid": "328"
                            },
                            {
                                "id": "2421",
                                "name": "新野县",
                                "cid": "328"
                            },
                            {
                                "id": "2422",
                                "name": "社旗县",
                                "cid": "328"
                            },
                            {
                                "id": "2423",
                                "name": "南召县",
                                "cid": "328"
                            },
                            {
                                "id": "2424",
                                "name": "邓州市",
                                "cid": "328"
                            },
                            {
                                "id": "2425",
                                "name": "内乡县",
                                "cid": "328"
                            },
                            {
                                "id": "2426",
                                "name": "淅川县",
                                "cid": "328"
                            },
                            {
                                "id": "2427",
                                "name": "唐河县",
                                "cid": "328"
                            },
                            {
                                "id": "2428",
                                "name": "卧龙区",
                                "cid": "328"
                            },
                            {
                                "id": "2429",
                                "name": "宛城区",
                                "cid": "328"
                            }
                        ]
                    },
                    {
                        "id": "329",
                        "name": "漯河市",
                        "pid": "25",
                        "children": [
                            {
                                "id": "2430",
                                "name": "临颍县",
                                "cid": "329"
                            },
                            {
                                "id": "2431",
                                "name": "舞阳县",
                                "cid": "329"
                            },
                            {
                                "id": "2432",
                                "name": "郾城区",
                                "cid": "329"
                            },
                            {
                                "id": "2433",
                                "name": "召陵区",
                                "cid": "329"
                            },
                            {
                                "id": "2434",
                                "name": "源汇区",
                                "cid": "329"
                            }
                        ]
                    },
                    {
                        "id": "330",
                        "name": "济源市",
                        "pid": "25",
                        "children": [
                            {
                                "id": "2435",
                                "name": "市辖区",
                                "cid": "330"
                            }
                        ]
                    },
                    {
                        "id": "499",
                        "name": "荥阳市",
                        "pid": "25",
                        "children": []
                    }
                ]
            },
            {
                "id": "16",
                "name": "海南省",
                "children": [
                    {
                        "id": "192",
                        "name": "三亚市",
                        "pid": "16",
                        "children": [
                            {
                                "id": "1372",
                                "name": "市辖区",
                                "cid": "192"
                            }
                        ]
                    },
                    {
                        "id": "193",
                        "name": "海口市",
                        "pid": "16",
                        "children": [
                            {
                                "id": "1373",
                                "name": "琼山区",
                                "cid": "193"
                            },
                            {
                                "id": "1374",
                                "name": "秀英区",
                                "cid": "193"
                            },
                            {
                                "id": "1375",
                                "name": "龙华区",
                                "cid": "193"
                            },
                            {
                                "id": "1376",
                                "name": "美兰区",
                                "cid": "193"
                            }
                        ]
                    },
                    {
                        "id": "194",
                        "name": "定安县",
                        "pid": "16",
                        "children": []
                    },
                    {
                        "id": "195",
                        "name": "儋州市",
                        "pid": "16",
                        "children": []
                    },
                    {
                        "id": "196",
                        "name": "万宁市",
                        "pid": "16",
                        "children": []
                    },
                    {
                        "id": "197",
                        "name": "保亭黎族苗族自治县",
                        "pid": "16",
                        "children": []
                    },
                    {
                        "id": "198",
                        "name": "西沙群岛",
                        "pid": "16",
                        "children": []
                    },
                    {
                        "id": "199",
                        "name": "中沙群岛",
                        "pid": "16",
                        "children": []
                    },
                    {
                        "id": "200",
                        "name": "南沙群岛",
                        "pid": "16",
                        "children": []
                    },
                    {
                        "id": "201",
                        "name": "屯昌县",
                        "pid": "16",
                        "children": []
                    },
                    {
                        "id": "202",
                        "name": "昌江黎族自治县",
                        "pid": "16",
                        "children": []
                    },
                    {
                        "id": "203",
                        "name": "陵水黎族自治县",
                        "pid": "16",
                        "children": []
                    },
                    {
                        "id": "204",
                        "name": "五指山市",
                        "pid": "16",
                        "children": []
                    },
                    {
                        "id": "205",
                        "name": "琼中黎族苗族自治县",
                        "pid": "16",
                        "children": []
                    },
                    {
                        "id": "206",
                        "name": "乐东黎族自治县",
                        "pid": "16",
                        "children": []
                    },
                    {
                        "id": "207",
                        "name": "临高县",
                        "pid": "16",
                        "children": []
                    },
                    {
                        "id": "208",
                        "name": "琼海市",
                        "pid": "16",
                        "children": []
                    },
                    {
                        "id": "209",
                        "name": "白沙黎族自治县",
                        "pid": "16",
                        "children": []
                    },
                    {
                        "id": "210",
                        "name": "东方市",
                        "pid": "16",
                        "children": []
                    },
                    {
                        "id": "211",
                        "name": "澄迈县",
                        "pid": "16",
                        "children": []
                    },
                    {
                        "id": "212",
                        "name": "文昌市",
                        "pid": "16",
                        "children": []
                    }
                ]
            },
            {
                "id": "27",
                "name": "四川省",
                "children": [
                    {
                        "id": "342",
                        "name": "甘孜藏族自治州",
                        "pid": "27",
                        "children": [
                            {
                                "id": "2535",
                                "name": "色达县",
                                "cid": "342"
                            },
                            {
                                "id": "2536",
                                "name": "甘孜县",
                                "cid": "342"
                            },
                            {
                                "id": "2537",
                                "name": "道孚县",
                                "cid": "342"
                            },
                            {
                                "id": "2538",
                                "name": "炉霍县",
                                "cid": "342"
                            },
                            {
                                "id": "2539",
                                "name": "新龙县",
                                "cid": "342"
                            },
                            {
                                "id": "2540",
                                "name": "康定县",
                                "cid": "342"
                            },
                            {
                                "id": "2541",
                                "name": "丹巴县",
                                "cid": "342"
                            },
                            {
                                "id": "2542",
                                "name": "泸定县",
                                "cid": "342"
                            },
                            {
                                "id": "2543",
                                "name": "雅江县",
                                "cid": "342"
                            },
                            {
                                "id": "2544",
                                "name": "理塘县",
                                "cid": "342"
                            },
                            {
                                "id": "2545",
                                "name": "白玉县",
                                "cid": "342"
                            },
                            {
                                "id": "2546",
                                "name": "九龙县",
                                "cid": "342"
                            },
                            {
                                "id": "2547",
                                "name": "巴塘县",
                                "cid": "342"
                            },
                            {
                                "id": "2548",
                                "name": "得荣县",
                                "cid": "342"
                            },
                            {
                                "id": "2549",
                                "name": "乡城县",
                                "cid": "342"
                            },
                            {
                                "id": "2550",
                                "name": "德格县",
                                "cid": "342"
                            },
                            {
                                "id": "2551",
                                "name": "稻城县",
                                "cid": "342"
                            },
                            {
                                "id": "2552",
                                "name": "石渠县",
                                "cid": "342"
                            }
                        ]
                    },
                    {
                        "id": "343",
                        "name": "德阳市",
                        "pid": "27",
                        "children": [
                            {
                                "id": "2553",
                                "name": "绵竹市",
                                "cid": "343"
                            },
                            {
                                "id": "2554",
                                "name": "中江县",
                                "cid": "343"
                            },
                            {
                                "id": "2555",
                                "name": "罗江县",
                                "cid": "343"
                            },
                            {
                                "id": "2556",
                                "name": "旌阳区",
                                "cid": "343"
                            },
                            {
                                "id": "2557",
                                "name": "广汉市",
                                "cid": "343"
                            },
                            {
                                "id": "2558",
                                "name": "什邡市",
                                "cid": "343"
                            }
                        ]
                    },
                    {
                        "id": "344",
                        "name": "成都市",
                        "pid": "27",
                        "children": [
                            {
                                "id": "2559",
                                "name": "新都区",
                                "cid": "344"
                            },
                            {
                                "id": "2560",
                                "name": "彭州市",
                                "cid": "344"
                            },
                            {
                                "id": "2561",
                                "name": "都江堰市",
                                "cid": "344"
                            },
                            {
                                "id": "2562",
                                "name": "崇州市",
                                "cid": "344"
                            },
                            {
                                "id": "2563",
                                "name": "大邑县",
                                "cid": "344"
                            },
                            {
                                "id": "2564",
                                "name": "金堂县",
                                "cid": "344"
                            },
                            {
                                "id": "2565",
                                "name": "双流县",
                                "cid": "344"
                            },
                            {
                                "id": "2566",
                                "name": "青羊区",
                                "cid": "344"
                            },
                            {
                                "id": "2567",
                                "name": "武侯区",
                                "cid": "344"
                            },
                            {
                                "id": "2568",
                                "name": "温江区",
                                "cid": "344"
                            },
                            {
                                "id": "2569",
                                "name": "新津县",
                                "cid": "344"
                            },
                            {
                                "id": "2570",
                                "name": "邛崃市",
                                "cid": "344"
                            },
                            {
                                "id": "2571",
                                "name": "蒲江县",
                                "cid": "344"
                            },
                            {
                                "id": "2572",
                                "name": "青白江区",
                                "cid": "344"
                            },
                            {
                                "id": "2573",
                                "name": "郫县",
                                "cid": "344"
                            },
                            {
                                "id": "2574",
                                "name": "金牛区",
                                "cid": "344"
                            },
                            {
                                "id": "2575",
                                "name": "成华区",
                                "cid": "344"
                            },
                            {
                                "id": "2576",
                                "name": "龙泉驿区",
                                "cid": "344"
                            },
                            {
                                "id": "2577",
                                "name": "锦江区",
                                "cid": "344"
                            }
                        ]
                    },
                    {
                        "id": "345",
                        "name": "雅安市",
                        "pid": "27",
                        "children": [
                            {
                                "id": "2578",
                                "name": "芦山县",
                                "cid": "345"
                            },
                            {
                                "id": "2579",
                                "name": "名山县",
                                "cid": "345"
                            },
                            {
                                "id": "2580",
                                "name": "雨城区",
                                "cid": "345"
                            },
                            {
                                "id": "2581",
                                "name": "宝兴县",
                                "cid": "345"
                            },
                            {
                                "id": "2582",
                                "name": "天全县",
                                "cid": "345"
                            },
                            {
                                "id": "2583",
                                "name": "荥经县",
                                "cid": "345"
                            },
                            {
                                "id": "2584",
                                "name": "汉源县",
                                "cid": "345"
                            },
                            {
                                "id": "2585",
                                "name": "石棉县",
                                "cid": "345"
                            }
                        ]
                    },
                    {
                        "id": "346",
                        "name": "眉山市",
                        "pid": "27",
                        "children": [
                            {
                                "id": "2586",
                                "name": "仁寿县",
                                "cid": "346"
                            },
                            {
                                "id": "2587",
                                "name": "青神县",
                                "cid": "346"
                            },
                            {
                                "id": "2588",
                                "name": "东坡区",
                                "cid": "346"
                            },
                            {
                                "id": "2589",
                                "name": "洪雅县",
                                "cid": "346"
                            },
                            {
                                "id": "2590",
                                "name": "丹棱县",
                                "cid": "346"
                            },
                            {
                                "id": "2591",
                                "name": "彭山县",
                                "cid": "346"
                            }
                        ]
                    },
                    {
                        "id": "347",
                        "name": "自贡市",
                        "pid": "27",
                        "children": [
                            {
                                "id": "2592",
                                "name": "富顺县",
                                "cid": "347"
                            },
                            {
                                "id": "2593",
                                "name": "荣县",
                                "cid": "347"
                            },
                            {
                                "id": "2594",
                                "name": "大安区",
                                "cid": "347"
                            },
                            {
                                "id": "2595",
                                "name": "沿滩区",
                                "cid": "347"
                            },
                            {
                                "id": "2596",
                                "name": "贡井区",
                                "cid": "347"
                            },
                            {
                                "id": "2597",
                                "name": "自流井区",
                                "cid": "347"
                            }
                        ]
                    },
                    {
                        "id": "348",
                        "name": "乐山市",
                        "pid": "27",
                        "children": [
                            {
                                "id": "2598",
                                "name": "井研县",
                                "cid": "348"
                            },
                            {
                                "id": "2599",
                                "name": "犍为县",
                                "cid": "348"
                            },
                            {
                                "id": "2600",
                                "name": "夹江县",
                                "cid": "348"
                            },
                            {
                                "id": "2601",
                                "name": "峨眉山市",
                                "cid": "348"
                            },
                            {
                                "id": "2602",
                                "name": "金口河区",
                                "cid": "348"
                            },
                            {
                                "id": "2603",
                                "name": "沐川县",
                                "cid": "348"
                            },
                            {
                                "id": "2604",
                                "name": "马边彝族自治县",
                                "cid": "348"
                            },
                            {
                                "id": "2605",
                                "name": "峨边彝族自治县",
                                "cid": "348"
                            },
                            {
                                "id": "2606",
                                "name": "市中区",
                                "cid": "348"
                            },
                            {
                                "id": "2607",
                                "name": "沙湾区",
                                "cid": "348"
                            },
                            {
                                "id": "2608",
                                "name": "五通桥区",
                                "cid": "348"
                            }
                        ]
                    },
                    {
                        "id": "349",
                        "name": "凉山彝族自治州",
                        "pid": "27",
                        "children": [
                            {
                                "id": "2609",
                                "name": "美姑县",
                                "cid": "349"
                            },
                            {
                                "id": "2610",
                                "name": "甘洛县",
                                "cid": "349"
                            },
                            {
                                "id": "2611",
                                "name": "越西县",
                                "cid": "349"
                            },
                            {
                                "id": "2612",
                                "name": "冕宁县",
                                "cid": "349"
                            },
                            {
                                "id": "2613",
                                "name": "木里藏族自治县",
                                "cid": "349"
                            },
                            {
                                "id": "2614",
                                "name": "雷波县",
                                "cid": "349"
                            },
                            {
                                "id": "2615",
                                "name": "昭觉县",
                                "cid": "349"
                            },
                            {
                                "id": "2616",
                                "name": "喜德县",
                                "cid": "349"
                            },
                            {
                                "id": "2617",
                                "name": "西昌市",
                                "cid": "349"
                            },
                            {
                                "id": "2618",
                                "name": "盐源县",
                                "cid": "349"
                            },
                            {
                                "id": "2619",
                                "name": "布拖县",
                                "cid": "349"
                            },
                            {
                                "id": "2620",
                                "name": "普格县",
                                "cid": "349"
                            },
                            {
                                "id": "2621",
                                "name": "德昌县",
                                "cid": "349"
                            },
                            {
                                "id": "2622",
                                "name": "会东县",
                                "cid": "349"
                            },
                            {
                                "id": "2623",
                                "name": "会理县",
                                "cid": "349"
                            },
                            {
                                "id": "2624",
                                "name": "金阳县",
                                "cid": "349"
                            },
                            {
                                "id": "2625",
                                "name": "宁南县",
                                "cid": "349"
                            }
                        ]
                    },
                    {
                        "id": "350",
                        "name": "攀枝花市",
                        "pid": "27",
                        "children": [
                            {
                                "id": "2626",
                                "name": "盐边县",
                                "cid": "350"
                            },
                            {
                                "id": "2627",
                                "name": "米易县",
                                "cid": "350"
                            },
                            {
                                "id": "2628",
                                "name": "西区",
                                "cid": "350"
                            },
                            {
                                "id": "2629",
                                "name": "东区",
                                "cid": "350"
                            },
                            {
                                "id": "2630",
                                "name": "仁和区",
                                "cid": "350"
                            }
                        ]
                    },
                    {
                        "id": "351",
                        "name": "阿坝藏族羌族自治州",
                        "pid": "27",
                        "children": [
                            {
                                "id": "2631",
                                "name": "若尔盖县",
                                "cid": "351"
                            },
                            {
                                "id": "2632",
                                "name": "九寨沟县",
                                "cid": "351"
                            },
                            {
                                "id": "2633",
                                "name": "红原县",
                                "cid": "351"
                            },
                            {
                                "id": "2634",
                                "name": "松潘县",
                                "cid": "351"
                            },
                            {
                                "id": "2635",
                                "name": "黑水县",
                                "cid": "351"
                            },
                            {
                                "id": "2636",
                                "name": "马尔康县",
                                "cid": "351"
                            },
                            {
                                "id": "2637",
                                "name": "壤塘县",
                                "cid": "351"
                            },
                            {
                                "id": "2638",
                                "name": "茂县",
                                "cid": "351"
                            },
                            {
                                "id": "2639",
                                "name": "理县",
                                "cid": "351"
                            },
                            {
                                "id": "2640",
                                "name": "小金县",
                                "cid": "351"
                            },
                            {
                                "id": "2641",
                                "name": "金川县",
                                "cid": "351"
                            },
                            {
                                "id": "2642",
                                "name": "汶川县",
                                "cid": "351"
                            },
                            {
                                "id": "2643",
                                "name": "阿坝县",
                                "cid": "351"
                            }
                        ]
                    },
                    {
                        "id": "352",
                        "name": "宜宾市",
                        "pid": "27",
                        "children": [
                            {
                                "id": "2644",
                                "name": "江安县",
                                "cid": "352"
                            },
                            {
                                "id": "2645",
                                "name": "长宁县",
                                "cid": "352"
                            },
                            {
                                "id": "2646",
                                "name": "翠屏区",
                                "cid": "352"
                            },
                            {
                                "id": "2647",
                                "name": "宜宾县",
                                "cid": "352"
                            },
                            {
                                "id": "2648",
                                "name": "屏山县",
                                "cid": "352"
                            },
                            {
                                "id": "2649",
                                "name": "兴文县",
                                "cid": "352"
                            },
                            {
                                "id": "2650",
                                "name": "珙县",
                                "cid": "352"
                            },
                            {
                                "id": "2651",
                                "name": "高县",
                                "cid": "352"
                            },
                            {
                                "id": "2652",
                                "name": "筠连县",
                                "cid": "352"
                            },
                            {
                                "id": "2653",
                                "name": "南溪区",
                                "cid": "352"
                            }
                        ]
                    },
                    {
                        "id": "353",
                        "name": "巴中市",
                        "pid": "27",
                        "children": [
                            {
                                "id": "2654",
                                "name": "南江县",
                                "cid": "353"
                            },
                            {
                                "id": "2655",
                                "name": "通江县",
                                "cid": "353"
                            },
                            {
                                "id": "2656",
                                "name": "巴州区",
                                "cid": "353"
                            },
                            {
                                "id": "2657",
                                "name": "平昌县",
                                "cid": "353"
                            }
                        ]
                    },
                    {
                        "id": "354",
                        "name": "绵阳市",
                        "pid": "27",
                        "children": [
                            {
                                "id": "2658",
                                "name": "平武县",
                                "cid": "354"
                            },
                            {
                                "id": "2659",
                                "name": "北川羌族自治县",
                                "cid": "354"
                            },
                            {
                                "id": "2660",
                                "name": "安县",
                                "cid": "354"
                            },
                            {
                                "id": "2661",
                                "name": "三台县",
                                "cid": "354"
                            },
                            {
                                "id": "2662",
                                "name": "江油市",
                                "cid": "354"
                            },
                            {
                                "id": "2663",
                                "name": "梓潼县",
                                "cid": "354"
                            },
                            {
                                "id": "2664",
                                "name": "盐亭县",
                                "cid": "354"
                            },
                            {
                                "id": "2665",
                                "name": "游仙区",
                                "cid": "354"
                            },
                            {
                                "id": "2666",
                                "name": "涪城区",
                                "cid": "354"
                            }
                        ]
                    },
                    {
                        "id": "355",
                        "name": "广安市",
                        "pid": "27",
                        "children": [
                            {
                                "id": "2667",
                                "name": "邻水县",
                                "cid": "355"
                            },
                            {
                                "id": "2668",
                                "name": "广安区",
                                "cid": "355"
                            },
                            {
                                "id": "2669",
                                "name": "武胜县",
                                "cid": "355"
                            },
                            {
                                "id": "2670",
                                "name": "岳池县",
                                "cid": "355"
                            },
                            {
                                "id": "2671",
                                "name": "华蓥市",
                                "cid": "355"
                            }
                        ]
                    },
                    {
                        "id": "356",
                        "name": "资阳市",
                        "pid": "27",
                        "children": [
                            {
                                "id": "2672",
                                "name": "乐至县",
                                "cid": "356"
                            },
                            {
                                "id": "2673",
                                "name": "雁江区",
                                "cid": "356"
                            },
                            {
                                "id": "2674",
                                "name": "简阳市",
                                "cid": "356"
                            },
                            {
                                "id": "2675",
                                "name": "安岳县",
                                "cid": "356"
                            }
                        ]
                    },
                    {
                        "id": "357",
                        "name": "内江市",
                        "pid": "27",
                        "children": [
                            {
                                "id": "2676",
                                "name": "资中县",
                                "cid": "357"
                            },
                            {
                                "id": "2677",
                                "name": "威远县",
                                "cid": "357"
                            },
                            {
                                "id": "2678",
                                "name": "隆昌县",
                                "cid": "357"
                            },
                            {
                                "id": "2679",
                                "name": "市中区",
                                "cid": "357"
                            },
                            {
                                "id": "2680",
                                "name": "东兴区",
                                "cid": "357"
                            }
                        ]
                    },
                    {
                        "id": "358",
                        "name": "南充市",
                        "pid": "27",
                        "children": [
                            {
                                "id": "2681",
                                "name": "阆中市",
                                "cid": "358"
                            },
                            {
                                "id": "2682",
                                "name": "西充县",
                                "cid": "358"
                            },
                            {
                                "id": "2683",
                                "name": "蓬安县",
                                "cid": "358"
                            },
                            {
                                "id": "2684",
                                "name": "营山县",
                                "cid": "358"
                            },
                            {
                                "id": "2685",
                                "name": "南部县",
                                "cid": "358"
                            },
                            {
                                "id": "2686",
                                "name": "仪陇县",
                                "cid": "358"
                            },
                            {
                                "id": "2687",
                                "name": "顺庆区",
                                "cid": "358"
                            },
                            {
                                "id": "2688",
                                "name": "高坪区",
                                "cid": "358"
                            },
                            {
                                "id": "2689",
                                "name": "嘉陵区",
                                "cid": "358"
                            }
                        ]
                    },
                    {
                        "id": "359",
                        "name": "广元市",
                        "pid": "27",
                        "children": [
                            {
                                "id": "2690",
                                "name": "青川县",
                                "cid": "359"
                            },
                            {
                                "id": "2691",
                                "name": "苍溪县",
                                "cid": "359"
                            },
                            {
                                "id": "2692",
                                "name": "剑阁县",
                                "cid": "359"
                            },
                            {
                                "id": "2693",
                                "name": "旺苍县",
                                "cid": "359"
                            },
                            {
                                "id": "2694",
                                "name": "朝天区",
                                "cid": "359"
                            },
                            {
                                "id": "2695",
                                "name": "利州区",
                                "cid": "359"
                            },
                            {
                                "id": "2696",
                                "name": "元坝区",
                                "cid": "359"
                            }
                        ]
                    },
                    {
                        "id": "360",
                        "name": "遂宁市",
                        "pid": "27",
                        "children": [
                            {
                                "id": "2697",
                                "name": "大英县",
                                "cid": "360"
                            },
                            {
                                "id": "2698",
                                "name": "射洪县",
                                "cid": "360"
                            },
                            {
                                "id": "2699",
                                "name": "蓬溪县",
                                "cid": "360"
                            },
                            {
                                "id": "2700",
                                "name": "船山区",
                                "cid": "360"
                            },
                            {
                                "id": "2701",
                                "name": "安居区",
                                "cid": "360"
                            }
                        ]
                    },
                    {
                        "id": "361",
                        "name": "泸州市",
                        "pid": "27",
                        "children": [
                            {
                                "id": "2702",
                                "name": "古蔺县",
                                "cid": "361"
                            },
                            {
                                "id": "2703",
                                "name": "叙永县",
                                "cid": "361"
                            },
                            {
                                "id": "2704",
                                "name": "泸县",
                                "cid": "361"
                            },
                            {
                                "id": "2705",
                                "name": "合江县",
                                "cid": "361"
                            },
                            {
                                "id": "2706",
                                "name": "龙马潭区",
                                "cid": "361"
                            },
                            {
                                "id": "2707",
                                "name": "江阳区",
                                "cid": "361"
                            },
                            {
                                "id": "2708",
                                "name": "纳溪区",
                                "cid": "361"
                            }
                        ]
                    },
                    {
                        "id": "362",
                        "name": "达州市",
                        "pid": "27",
                        "children": [
                            {
                                "id": "2709",
                                "name": "渠县",
                                "cid": "362"
                            },
                            {
                                "id": "2710",
                                "name": "通川区",
                                "cid": "362"
                            },
                            {
                                "id": "2711",
                                "name": "宣汉县",
                                "cid": "362"
                            },
                            {
                                "id": "2712",
                                "name": "开江县",
                                "cid": "362"
                            },
                            {
                                "id": "2713",
                                "name": "大竹县",
                                "cid": "362"
                            },
                            {
                                "id": "2714",
                                "name": "万源市",
                                "cid": "362"
                            },
                            {
                                "id": "2715",
                                "name": "达县",
                                "cid": "362"
                            }
                        ]
                    }
                ]
            },
            {
                "id": "3",
                "name": "广东省",
                "children": [
                    {
                        "id": "28",
                        "name": "东莞市",
                        "pid": "3",
                        "children": [
                            {
                                "id": "206",
                                "name": "市辖区",
                                "cid": "28"
                            }
                        ]
                    },
                    {
                        "id": "29",
                        "name": "东沙群岛",
                        "pid": "3",
                        "children": [
                            {
                                "id": "207",
                                "name": "市辖区",
                                "cid": "29"
                            }
                        ]
                    },
                    {
                        "id": "30",
                        "name": "韶关市",
                        "pid": "3",
                        "children": [
                            {
                                "id": "208",
                                "name": "新丰县",
                                "cid": "30"
                            },
                            {
                                "id": "209",
                                "name": "乐昌市",
                                "cid": "30"
                            },
                            {
                                "id": "210",
                                "name": "南雄市",
                                "cid": "30"
                            },
                            {
                                "id": "211",
                                "name": "曲江区",
                                "cid": "30"
                            },
                            {
                                "id": "212",
                                "name": "乳源瑶族自治县",
                                "cid": "30"
                            },
                            {
                                "id": "213",
                                "name": "始兴县",
                                "cid": "30"
                            },
                            {
                                "id": "214",
                                "name": "仁化县",
                                "cid": "30"
                            },
                            {
                                "id": "215",
                                "name": "翁源县",
                                "cid": "30"
                            },
                            {
                                "id": "216",
                                "name": "浈江区",
                                "cid": "30"
                            },
                            {
                                "id": "217",
                                "name": "武江区",
                                "cid": "30"
                            }
                        ]
                    },
                    {
                        "id": "31",
                        "name": "佛山市",
                        "pid": "3",
                        "children": [
                            {
                                "id": "218",
                                "name": "顺德区",
                                "cid": "31"
                            },
                            {
                                "id": "219",
                                "name": "高明区",
                                "cid": "31"
                            },
                            {
                                "id": "220",
                                "name": "三水区",
                                "cid": "31"
                            },
                            {
                                "id": "221",
                                "name": "南海区",
                                "cid": "31"
                            },
                            {
                                "id": "222",
                                "name": "禅城区",
                                "cid": "31"
                            }
                        ]
                    },
                    {
                        "id": "32",
                        "name": "茂名市",
                        "pid": "3",
                        "children": [
                            {
                                "id": "223",
                                "name": "高州市",
                                "cid": "32"
                            },
                            {
                                "id": "224",
                                "name": "茂港区",
                                "cid": "32"
                            },
                            {
                                "id": "225",
                                "name": "化州市",
                                "cid": "32"
                            },
                            {
                                "id": "226",
                                "name": "电白县",
                                "cid": "32"
                            },
                            {
                                "id": "227",
                                "name": "信宜市",
                                "cid": "32"
                            },
                            {
                                "id": "228",
                                "name": "茂南区",
                                "cid": "32"
                            }
                        ]
                    },
                    {
                        "id": "33",
                        "name": "珠海市",
                        "pid": "3",
                        "children": [
                            {
                                "id": "229",
                                "name": "斗门区",
                                "cid": "33"
                            },
                            {
                                "id": "230",
                                "name": "香洲区",
                                "cid": "33"
                            },
                            {
                                "id": "231",
                                "name": "金湾区",
                                "cid": "33"
                            }
                        ]
                    },
                    {
                        "id": "34",
                        "name": "梅州市",
                        "pid": "3",
                        "children": [
                            {
                                "id": "232",
                                "name": "梅县",
                                "cid": "34"
                            },
                            {
                                "id": "233",
                                "name": "蕉岭县",
                                "cid": "34"
                            },
                            {
                                "id": "234",
                                "name": "丰顺县",
                                "cid": "34"
                            },
                            {
                                "id": "235",
                                "name": "梅江区",
                                "cid": "34"
                            },
                            {
                                "id": "236",
                                "name": "大埔县",
                                "cid": "34"
                            },
                            {
                                "id": "237",
                                "name": "兴宁市",
                                "cid": "34"
                            },
                            {
                                "id": "238",
                                "name": "五华县",
                                "cid": "34"
                            },
                            {
                                "id": "239",
                                "name": "平远县",
                                "cid": "34"
                            }
                        ]
                    },
                    {
                        "id": "35",
                        "name": "中山市",
                        "pid": "3",
                        "children": [
                            {
                                "id": "240",
                                "name": "市辖区",
                                "cid": "35"
                            }
                        ]
                    },
                    {
                        "id": "36",
                        "name": "清远市",
                        "pid": "3",
                        "children": [
                            {
                                "id": "241",
                                "name": "连山壮族瑶族自治县",
                                "cid": "36"
                            },
                            {
                                "id": "242",
                                "name": "阳山县",
                                "cid": "36"
                            },
                            {
                                "id": "243",
                                "name": "连南瑶族自治县",
                                "cid": "36"
                            },
                            {
                                "id": "244",
                                "name": "佛冈县",
                                "cid": "36"
                            },
                            {
                                "id": "245",
                                "name": "连州市",
                                "cid": "36"
                            },
                            {
                                "id": "246",
                                "name": "清新县",
                                "cid": "36"
                            },
                            {
                                "id": "247",
                                "name": "英德市",
                                "cid": "36"
                            },
                            {
                                "id": "248",
                                "name": "清城区",
                                "cid": "36"
                            }
                        ]
                    },
                    {
                        "id": "37",
                        "name": "湛江市",
                        "pid": "3",
                        "children": [
                            {
                                "id": "249",
                                "name": "雷州市",
                                "cid": "37"
                            },
                            {
                                "id": "250",
                                "name": "吴川市",
                                "cid": "37"
                            },
                            {
                                "id": "251",
                                "name": "赤坎区",
                                "cid": "37"
                            },
                            {
                                "id": "252",
                                "name": "麻章区",
                                "cid": "37"
                            },
                            {
                                "id": "253",
                                "name": "徐闻县",
                                "cid": "37"
                            },
                            {
                                "id": "254",
                                "name": "遂溪县",
                                "cid": "37"
                            },
                            {
                                "id": "255",
                                "name": "霞山区",
                                "cid": "37"
                            },
                            {
                                "id": "256",
                                "name": "廉江市",
                                "cid": "37"
                            },
                            {
                                "id": "257",
                                "name": "坡头区",
                                "cid": "37"
                            }
                        ]
                    },
                    {
                        "id": "38",
                        "name": "阳江市",
                        "pid": "3",
                        "children": [
                            {
                                "id": "258",
                                "name": "江城区",
                                "cid": "38"
                            },
                            {
                                "id": "259",
                                "name": "阳春市",
                                "cid": "38"
                            },
                            {
                                "id": "260",
                                "name": "阳东县",
                                "cid": "38"
                            },
                            {
                                "id": "261",
                                "name": "阳西县",
                                "cid": "38"
                            }
                        ]
                    },
                    {
                        "id": "39",
                        "name": "河源市",
                        "pid": "3",
                        "children": [
                            {
                                "id": "262",
                                "name": "龙川县",
                                "cid": "39"
                            },
                            {
                                "id": "263",
                                "name": "紫金县",
                                "cid": "39"
                            },
                            {
                                "id": "264",
                                "name": "和平县",
                                "cid": "39"
                            },
                            {
                                "id": "265",
                                "name": "源城区",
                                "cid": "39"
                            },
                            {
                                "id": "266",
                                "name": "连平县",
                                "cid": "39"
                            },
                            {
                                "id": "267",
                                "name": "东源县",
                                "cid": "39"
                            }
                        ]
                    },
                    {
                        "id": "40",
                        "name": "潮州市",
                        "pid": "3",
                        "children": [
                            {
                                "id": "268",
                                "name": "饶平县",
                                "cid": "40"
                            },
                            {
                                "id": "269",
                                "name": "潮安县",
                                "cid": "40"
                            },
                            {
                                "id": "270",
                                "name": "湘桥区",
                                "cid": "40"
                            }
                        ]
                    },
                    {
                        "id": "41",
                        "name": "广州市",
                        "pid": "3",
                        "children": [
                            {
                                "id": "271",
                                "name": "花都区",
                                "cid": "41"
                            },
                            {
                                "id": "272",
                                "name": "越秀区",
                                "cid": "41"
                            },
                            {
                                "id": "273",
                                "name": "从化市",
                                "cid": "41"
                            },
                            {
                                "id": "274",
                                "name": "番禺区",
                                "cid": "41"
                            },
                            {
                                "id": "275",
                                "name": "天河区",
                                "cid": "41"
                            },
                            {
                                "id": "276",
                                "name": "南沙区",
                                "cid": "41"
                            },
                            {
                                "id": "277",
                                "name": "黄埔区",
                                "cid": "41"
                            },
                            {
                                "id": "278",
                                "name": "增城市",
                                "cid": "41"
                            },
                            {
                                "id": "279",
                                "name": "白云区",
                                "cid": "41"
                            },
                            {
                                "id": "280",
                                "name": "海珠区",
                                "cid": "41"
                            },
                            {
                                "id": "281",
                                "name": "荔湾区",
                                "cid": "41"
                            },
                            {
                                "id": "282",
                                "name": "萝岗区",
                                "cid": "41"
                            }
                        ]
                    },
                    {
                        "id": "42",
                        "name": "云浮市",
                        "pid": "3",
                        "children": [
                            {
                                "id": "283",
                                "name": "罗定市",
                                "cid": "42"
                            },
                            {
                                "id": "284",
                                "name": "郁南县",
                                "cid": "42"
                            },
                            {
                                "id": "285",
                                "name": "云城区",
                                "cid": "42"
                            },
                            {
                                "id": "286",
                                "name": "云安县",
                                "cid": "42"
                            },
                            {
                                "id": "287",
                                "name": "新兴县",
                                "cid": "42"
                            }
                        ]
                    },
                    {
                        "id": "43",
                        "name": "揭阳市",
                        "pid": "3",
                        "children": [
                            {
                                "id": "288",
                                "name": "揭东县",
                                "cid": "43"
                            },
                            {
                                "id": "289",
                                "name": "榕城区",
                                "cid": "43"
                            },
                            {
                                "id": "290",
                                "name": "揭西县",
                                "cid": "43"
                            },
                            {
                                "id": "291",
                                "name": "惠来县",
                                "cid": "43"
                            },
                            {
                                "id": "292",
                                "name": "普宁市",
                                "cid": "43"
                            }
                        ]
                    },
                    {
                        "id": "44",
                        "name": "惠州市",
                        "pid": "3",
                        "children": [
                            {
                                "id": "293",
                                "name": "惠城区",
                                "cid": "44"
                            },
                            {
                                "id": "294",
                                "name": "博罗县",
                                "cid": "44"
                            },
                            {
                                "id": "295",
                                "name": "惠东县",
                                "cid": "44"
                            },
                            {
                                "id": "296",
                                "name": "惠阳区",
                                "cid": "44"
                            },
                            {
                                "id": "297",
                                "name": "龙门县",
                                "cid": "44"
                            }
                        ]
                    },
                    {
                        "id": "45",
                        "name": "江门市",
                        "pid": "3",
                        "children": [
                            {
                                "id": "298",
                                "name": "台山市",
                                "cid": "45"
                            },
                            {
                                "id": "299",
                                "name": "江海区",
                                "cid": "45"
                            },
                            {
                                "id": "300",
                                "name": "开平市",
                                "cid": "45"
                            },
                            {
                                "id": "301",
                                "name": "蓬江区",
                                "cid": "45"
                            },
                            {
                                "id": "302",
                                "name": "恩平市",
                                "cid": "45"
                            },
                            {
                                "id": "303",
                                "name": "新会区",
                                "cid": "45"
                            },
                            {
                                "id": "304",
                                "name": "鹤山市",
                                "cid": "45"
                            }
                        ]
                    },
                    {
                        "id": "46",
                        "name": "汕头市",
                        "pid": "3",
                        "children": [
                            {
                                "id": "305",
                                "name": "濠江区",
                                "cid": "46"
                            },
                            {
                                "id": "306",
                                "name": "金平区",
                                "cid": "46"
                            },
                            {
                                "id": "307",
                                "name": "潮南区",
                                "cid": "46"
                            },
                            {
                                "id": "308",
                                "name": "南澳县",
                                "cid": "46"
                            },
                            {
                                "id": "309",
                                "name": "龙湖区",
                                "cid": "46"
                            },
                            {
                                "id": "310",
                                "name": "潮阳区",
                                "cid": "46"
                            },
                            {
                                "id": "311",
                                "name": "澄海区",
                                "cid": "46"
                            }
                        ]
                    },
                    {
                        "id": "47",
                        "name": "肇庆市",
                        "pid": "3",
                        "children": [
                            {
                                "id": "312",
                                "name": "德庆县",
                                "cid": "47"
                            },
                            {
                                "id": "313",
                                "name": "四会市",
                                "cid": "47"
                            },
                            {
                                "id": "314",
                                "name": "端州区",
                                "cid": "47"
                            },
                            {
                                "id": "315",
                                "name": "广宁县",
                                "cid": "47"
                            },
                            {
                                "id": "316",
                                "name": "高要市",
                                "cid": "47"
                            },
                            {
                                "id": "317",
                                "name": "封开县",
                                "cid": "47"
                            },
                            {
                                "id": "318",
                                "name": "怀集县",
                                "cid": "47"
                            },
                            {
                                "id": "319",
                                "name": "鼎湖区",
                                "cid": "47"
                            }
                        ]
                    },
                    {
                        "id": "48",
                        "name": "汕尾市",
                        "pid": "3",
                        "children": [
                            {
                                "id": "320",
                                "name": "陆丰市",
                                "cid": "48"
                            },
                            {
                                "id": "321",
                                "name": "陆河县",
                                "cid": "48"
                            },
                            {
                                "id": "322",
                                "name": "市辖区",
                                "cid": "48"
                            },
                            {
                                "id": "323",
                                "name": "海丰县",
                                "cid": "48"
                            }
                        ]
                    },
                    {
                        "id": "49",
                        "name": "深圳市",
                        "pid": "3",
                        "children": [
                            {
                                "id": "324",
                                "name": "南山区",
                                "cid": "49"
                            },
                            {
                                "id": "325",
                                "name": "罗湖区",
                                "cid": "49"
                            },
                            {
                                "id": "326",
                                "name": "福田区",
                                "cid": "49"
                            },
                            {
                                "id": "327",
                                "name": "盐田区",
                                "cid": "49"
                            },
                            {
                                "id": "328",
                                "name": "龙岗区",
                                "cid": "49"
                            },
                            {
                                "id": "329",
                                "name": "宝安区",
                                "cid": "49"
                            }
                        ]
                    }
                ]
            }
        ],
        "msg": ""
    }
    res.json(params)
})

module.exports = router;